Repository: bingen13/devguides_translation
Catalog: translations/*/LC_MESSAGES/AddingSupportForABrailleDisplay.po
Languages: es

source: # Adding Support for a Braille Display
es: # Cómo añadir soporte para una pantalla braille

source: There are two options if you'd like to see an additional braille display supported by NVDA:
es: Hay dos opciones para conseguir que una pantalla braille se soporte en NVDA:

source: 1. Request that NV Access develops a driver; or
es: 1. Solicitar a NVAccess que haga un controlador o

source: 2. Write a driver yourself.
es: 2. Escribir un controlador por ti mismo.

source: ## Request that NV Access Develops a Driver
es: ## Solicitar que NVAccess desarrolle un controlador

source: Given our extremely limited resources and other priorities, it may be months before we can consider such a request.
es: NVAccess tiene recursos muy limitados, y pueden pasar meses hasta que consideren tu petición.

source: However, we will endeavour to support additional displays if we are able.
es: Sin embargo, este tipo de solicitudes son bienvenidas.

source: In order for NV Access to develop a driver, we will need:
es: Para que NVAccess pueda desarrollar un controlador, necesitan:

source: * Access to a physical display at our offices in Queensland, Australia for at least a month at no cost to NV Access (which means we will not cover the cost of any shipping to or from Australia);
es: * Acceso físicamente a la pantalla braille en las oficinas de Queensland, Australia, durante aproximadamente un mes y sin coste para NVAccess (el interesado corre con los gastos de envío desde y hacia Australia);

source: * Technical documentation from the braille display vendor regarding how to communicate with the display;
es: * Documentación técnica del fabricante sobre cómo comunicarse con la pantalla;

source: * Permission from the vendor to distribute the NVDA driver as open source code;
es: * Permiso del fabricante para distribuir el controlador de NVDA como software libre;

source: * Any drivers, libraries, etc. from the vendor necessary to communicate with the display;
es: * Cualquier controlador, biblioteca o documentación del fabricante para comunicarse con la pantalla;

source: * Permission from the vendor to freely redistribute any drivers, libraries, etc. with NVDA; and
es: * Permiso del fabricante para distribuir los controladores y bibliotecas necesarios con NVDA; y

source: * Information about any key commands, etc. for the display that are common across screen raeders.
es: * Información de atajos de teclado y comandos de la pantalla que sean comunes a todos los lectores de pantalla.

source: Note that if there are any significant changes to either NVDA or the display after the driver is initially developed, we may need further access to a physical display as above.
es: Ten en cuenta que si después del desarrollo hay cambios importantes en el controlador o el núcleo de NVDA, habrá que repetir otra vez el proceso con la pantalla física como antes.

source: If you'd like to request that we support a display, please file [an issue on GitHub](https://github.com/nvaccess/nvda/issues/new) including as much of the above as you can.
es: Si estás interesado en que se añada soporte para una nueva pantalla Braille, [abre una incidencia en GitHub (en inglés)](https://github.com/nvaccess/nvda/issues/new) aportando toda la información posible.

source: At the very least, you should contact the braille display vendor and facilitate contact between them and us.
es: También puedes facilitar el contacto entre el fabricante y NVAccess.

source: ## Write a Driver Yourself
es: ## Escribe un controlador por ti mismo

source: Since NVDA is open source, we will gladly accept braille display drivers written by others.
es: NVDA es de código abierto, y acepta controladores para pantallas braille escritos por la comunidad.

source: As with most of the rest of NVDA, braille display drivers are written in Python and must be licensed under the GNU General Public License version 2.
es: Como todos los demás componentes, los controladores para pantallas braille deben programarse en Python y liberarse bajo la GNU General Public License, versión 2.

source: A braille display driver is a Python module containing a `BrailleDisplayDriver` class which inherits from the `braille.BrailleDisplayDriver` base class.
es: Un controlador para pantalla braille es un módulo Python con una clase `BrailleDisplayDriver` que hereda de la clase `braille.BrailleDisplayDriver`.

source: See [the code documentation for the `braille.BrailleDisplayDriver` class](https://github.com/nvaccess/nvda/blob/master/source/braille.py#L1751) for further details.
es: Mira [la documentación del código de la clase `braille.BrailleDisplayDriver`](https://github.com/nvaccess/nvda/blob/master/source/braille.py#L1751) para más detalles.

source: For drivers that should be integrated into the braille display auto detection framework, driver specific meta data has to be added to the [`bdDetect` module](https://github.com/nvaccess/nvda/blob/master/source/bdDetect.py). Note that, in order for braille display auto detection to be supported, a driver has to be thread safe. Data is written to thread-safe braille display drivers in the background, thus improving performance.
es: Para aquellos controladores que deberían integrarse en el marco de trabajo de detección automática de pantallas braille, hay que añadir metadatos específicos del controlador al [módulo `bdDetect`](https://github.com/nvaccess/nvda/blob/master/source/bdDetect.py). Ten en cuenta que, para que se soporte la detección automática de la pantalla braille, el controlador debe tener seguridad de hilos. Los datos se escriben en los controladores de pantallas braille con seguridad de hilos en segundo plano, mejorando así el rendimiento.

source: Here are some quick tips:
es: Estos son algunos consejos rápidos que te guiarán en el desarrollo:

source: * If you want to communicate with the display via raw serial, HID or Bulk, see the [`hwIo` module](https://github.com/nvaccess/nvda/blob/master/source/hwIo.py).
es: * Si quieres comunicarte con la pantalla mediante puerto serie en bruto, Hid o Bulk, mira el [módulo `hwIo`](https://github.com/nvaccess/nvda/blob/master/source/hwIo.py).

source: This is the preferred form of communication, since thread safety as well as support for automatic detection of displays can be guaranteed using this method.
es: Esta es la forma preferida de comunicación, ya que se pueden garantizar el soporte para la detección automática de pantallas y la seguridad de hilos usando este método.

source: The following drivers are considered good examples.
es: Los siguientes controladores se consideran buenos ejemplos.

source: Also, the [`handyTech`](https://github.com/nvaccess/nvda/blob/master/source/brailleDisplayDrivers/handyTech.py) driver might be a good example of a driver that should support multiple models or protocols.
es: El controlador de [`handyTech`](https://github.com/nvaccess/nvda/blob/master/source/brailleDisplayDrivers/handyTech.py) podría ser un buen ejemplo de controlador que debería soportar varios modelos o protocolos.

source: * If you need to use a dll to communicate with the display, you can use the Python `ctypes` module.
es: * Si necesitas usar una dll para comunicarte con la pantalla, utiliza el módulo `ctypes` de Python.

source: However, we will generally not accept dlls, unless it is strictly necessary to use them.
es: Sin embargo, generalmente NV Access no aceptará dlls, a no ser que sea estrictamente necesario.

source: Also, dlls larger than 300 kb are generally not accepted for distribution with NVDA.
es: Además, las dlls que ocupen más de 300 KB no se aceptan generalmente a la hora de distribuirlas con NVDA.

source: Furthermore, note that problems in dlls are harder to debug, and that implementing support for the braille display auto detection framework might be impossible due to the non thread safety of the dll.
es: Además, ten en cuenta que los problemas en las dlls son más difíciles de depurar, e implementar el soporte para el marco de trabajo de detección automática podría ser imposible debido a la falta de seguridad de hilos en la dll.

source: The [`freedomScientific`](https://github.com/nvaccess/nvda/blob/master/source/brailleDisplayDrivers/freedomScientific.py) driver is a good example.
es: El controlador de [`freedomScientific`](https://github.com/nvaccess/nvda/blob/master/source/brailleDisplayDrivers/freedomScientific.py) es un buen ejemplo.

source: * If you need to use a COM object to communicate with the display, you can use the `comtypes` module.
es: * Si necesitas un objeto com para comunicarte con la pantalla, puedes usar el módulo `comtypes`.

source: The same notes as for dlls apply.
es: Hay que tener en cuenta lo mismo que con las dlls.

source: See the [Contributing to NVDA](https://github.com/nvaccess/nvda/wiki/Contributing) document for information about code style, etc.
es: Lee el documento sobre cómo contribuir con NVDA para obtener información sobre el estilo del código, etc.

source: Once you have completed your driver, you can submit a pull request.
es: Una vez termines tu controlador, puedes enviar una solicitud de cambios.
