Repository: bingen13/devguides_translation
Catalog: translations/*/LC_MESSAGES/appveyor.po
Languages: es

source: # Using AppVeyor to manage NVDA add-ons
es: # Usar AppVeyor para gestionar complementos de NVDA

source: ## Procedure to build and attach nvda-addon files to releases on GitHub
es: ## Procedimiento para compilar y adjuntar archivos nvda-addon a Releases (liberaciones) en GitHub

source: This can be used to automate the building of NVDA add-ons (binaries with the .nvda-addon extension), which will be uploaded from Appveyor to GitHub, and attached to the created release.
es: Este método se puede usar para automatizar la compilación de complementos de NVDA (binarios con la extensión .nvda-addon), los cuales van a ser subidos luego a Github y añadidos como adjuntos a la release (liberación) creada..

source: It works for add-ons based on the [Add-on Template](https://github.com/nvdaaddons/addontemplate).
es: Funciona para complementos basados en la [Plantilla para complementos](https://github.com/nvdaaddons/addontemplate).

source: ### Setting AppVeyor for add-ons
es: ### Configurando AppVeyor para complementos

source: 1. Get the code of an add-on.
es: 1. Consigue el código de un complemento.

source: Example:
es: Ejemplo:

source: git clone https://github.com/username/repo
es: git clone https://github.com/nombreusuario/repo

source: 2. In the root of the add-on folder (where the sconstruct file is placed), paste this [AppVeyor configuration file](https://gist.github.com/nvdaes/a486e45b98566d530688f6da9ce75f84/raw/d05b620185a58327b39da1215cf3c13c01249031/appveyor.yml) (appveyor.yml).
es: 2. En la raíz de la carpeta del complemento (la misma en la que está el archivo sconstruct), pega este [archivo de configuración de AppVeyor](https://gist.github.com/nvdaes/a486e45b98566d530688f6da9ce75f84/raw/d05b620185a58327b39da1215cf3c13c01249031/appveyor.yml) (appveyor.yml).

source: 3. If you don't have it, [create a personal API access token](https://github.com/settings/tokens) and [encrypt it](https://ci.appveyor.com/tools/encrypt).
es: 3. Si no tienes ya uno, [crea un token personal de acceso a la API de GitHub](https://github.com/settings/tokens) y [cífralo](https://ci.appveyor.com/tools/encrypt).

source: Note: you could need to set the following token scopes to avoid inconvenience when releasing tags:
es: Nota: podría ser necesario configurar los siguientes ámbitos de token para evitar inconvenientes al publicar tags:

source: 4. In the appveyor.yml file, replace the value provided for the secure key with your encrypted token. For instance, instead of
es: 4. En el archivo appveyor.yml, reemplaza el valor proporcionado para la clave segura por tu token cifrado. Por ejemplo, en lugar de

source: secure: yourEncryptedToken
es: secure: tuTokenCifrado

source: Now, you can paste your appveyor.yml file to any add-on posted on your GitHub account.
es: Ahora puedes publicar el archivo appveyor.yml en cualquier repositorio de complemento en tu cuenta de GitHub.

source: 5. [Sign in with AppVeyor](https://www.appveyor.com/).
es: 5. [Inicia sesión en AppVeyor](https://www.appveyor.com/).

source: 6. From AppVeyor, select New Project. (If needed, choose GitHub and authorize it).
es: 6. En AppVeyor, selecciona New Project (Nuevo Proyecto). (Si es necesario, elige GitHub y autorízalo).

source: 7. Locate the name of the repo you're interested in, move the mouse over it (for instance pressing NVDA+numpadDivide or NVDA+shift+m), and activate the "Add" link below.
es: 7. Localiza el nombre del repo en el que estás interesado, mueve el ratón sobre él (por ejemplo presionando NVDA+DividirBloqueNumérico o NVDA+shift+m), y activa el enlace "Añadir" debajo.

source: ### Releasing
es: ### Liberando

source: To post a new release of an add-on, you can create a tag and push it to GitHub:
es: Para publicar una nueva versión de un complemento, puedes crear una etiqueta y enviarla a GitHub:

source: Example
es: Ejemplo

source: Now, the release will be created and binary-1.0.nvda-addon will be attached on GitHub.
es: Entonces la release (versión) se creará y binario-1.0.nvda-addon se añadirá como adjunto a ella en GitHub.

source: Bonus track: Also, Abdel has created an [appveyorForFTP.yml file](https://gist.githubusercontent.com/nvdaes/a486e45b98566d530688f6da9ce75f84/raw/46236e04b02de117f9edbb30aaf626692116b6c3/appveyorForFTP.yml) for releasing using an FTP server.
es: Pista extra: además, Abdel ha creado un [archivo appveyorForFTP.yml](https://gist.githubusercontent.com/nvdaes/a486e45b98566d530688f6da9ce75f84/raw/46236e04b02de117f9edbb30aaf626692116b6c3/appveyorForFTP.yml) para publicar utilizando un servidor FTP.

source: ## Personal deployment environment
es: ## Entorno de despliegue personal

source: In the example above, we've described how to introduce the encrypted key of your GitHub personal token in the appveyor.yml file.
es: En el ejmplo anterior, hemos descrito cómo introducir la clave cifrada de tu token personal de GitHub en el archivo appveyor.yml.

source: If you want to keep this personal key, without sharing it in your repo, you can create a personal deployment environment.
es: Si quieres conservar esta clave personal sin compartirla en tu repositorio, puedes crear un entorno de despliegue personal.

source: For that, go to [your appveyor environment page](https://ci.appveyor.com/environments) and click on the "New environment" link.
es: Para ello, ve a [tu página de entorno de Appveyor](https://ci.appveyor.com/environments) y pulsa sobre el enlace "New environment".

source: Once in the new environment creation page, we describe below the procedure for creating a deployment for GitHub, as well as an FTP deployment:
es: Una vez en la página de creación de nuevo entorno, describimos a continuación el procedimiento para crear un despliegue para GitHub, así como un despliegue FTP:

source: ### Creating a personal deployment environment for GitHub
es: ### Creación de un entorno de despliegue personal para GitHub

source: To create a personal deployment environment for GitHub, you should make the following choices.
es: Para crear un entorno de despliegue personal para GitHub, deberías elegir las siguientes opciones.

source: The $(REPO_NAME) environment variable used in the release description was created in the before_deploy section of [this appveyor.yml configuration file](https://gist.githubusercontent.com/abdel792/708a787bb79b265c32b66e363e9cb5c1/raw/3757add3bd8a3d872453f949109b38769d28592d/appveyor.yml).
es: La variable de entorno $(REPO_NAME) usada en la descripción de la liberación se creó en la sección before_deploy de [este archivo de configuración appveyor.yml](https://gist.githubusercontent.com/abdel792/708a787bb79b265c32b66e363e9cb5c1/raw/3757add3bd8a3d872453f949109b38769d28592d/appveyor.yml).

source: You must use this personal deployment environment with its appropriate configuration file so that it can recognize the name of the add-on in its description.
es: Debes usar este entorno de despliegue personal con su archivo de configuración apropiado para que se pueda reconocer el nombre del complemento en la descripción.

source: 6. GitHub authentication token: Your personal GitHub token. (Warning: This is your personal GitHub token, not your encrypted key with Appveyor)
es: 6. GitHub authentication token: Tu token personal de GitHub. (Advertencia: se trata de tu token personal de GitHub, no tu clave cifrada con Appveyor)

source: 7. Repository name: Leave empty, this field is optional
es: 7. Repository name: Se deja vacío, este campo es opcional

source: This done, submit your form by validating "Add environment" button.
es: Con esto hecho, valida y envía el formulario pulsando el botón "Add environment".

source: ### Creating a personal deployment environment for FTP
es: ### Creación de un entorno de despliegue personal para FTP

source: To create a personal deployment environment for FTP, you should make the following choices:
es: Para crear un entorno de despliegue personal para FTP, deberías elegir las siguientes opciones:

source: 4. Host: Your host.
es: 4. Host: Tu servidor.

source: 5. Active mode: Leave empty, this field is optional
es: 5. Active mode: Se deja vacío, este campo es opcional

source: 6. Username: Your username
es: 6. Username: Tu nombre de usuario

source: 7. Password: Your password
es: 7. Password: Tu contraseña

source: 8. Remote folder: The name of the folder that will contain the add-on on your FTP server. (It can be something like /nvda-addons or /add-ons)
es: 8. Remote folder: El nombre de la carpeta que contendrá el complemento en tu servidor FTP. (Puede ser algo como /nvda-addons o /add-ons)

source: 10. Application: Leave empty, this field is optional
es: 10. Application: Se deja vacío, este campo es opcional

source: 11. Use alternative FTP library (beta): Leave empty, this field is optional
es: 11. Use alternative FTP library (beta): Se deja vacío, este campo es opcional

source: ### Adding the deploy section for personal environments
es: ### Añadir la sección de despliegue para entornos personales

source: Once your personal environment has been added, you'll just have to add the following deploy section to your appveyor.yml file, mentioning only the name you have chosen for your environment
es: Una vez se haya añadido tu entorno personal, tendrás que agregar la siguiente sección de despliegue a tu archivo appveyor.yml, mencionando sólo el nombre que hayas elegido para tu entorno

source: 1. For GitHub deployment:
es: 1. Para el despliegue en GitHub:

source: Example of [appveyor configuration file for GitHub personal deployment environment](https://gist.githubusercontent.com/abdel792/708a787bb79b265c32b66e363e9cb5c1/raw/3757add3bd8a3d872453f949109b38769d28592d/appveyor.yml)
es: Ejemplo de [archivo de configuración de Appveyor para un entorno de despliegue personal en GitHub](https://gist.githubusercontent.com/abdel792/708a787bb79b265c32b66e363e9cb5c1/raw/3757add3bd8a3d872453f949109b38769d28592d/appveyor.yml)

source: 2. For FTP deployment:
es: 2. Para el despliegue FTP:

source: Example of [appveyor configuration file for FTP personal deployment environment](https://gist.githubusercontent.com/abdel792/58c7fa82c44df08b06d2674bb8bd6c70/raw/75eede89b1702df923d36fdccc2ccc47b7046cc1/appveyorForFTP.yml)
es: Ejemplo de [archivo de configuración de Appveyor para un entorno de despliegue personal en FTP](https://gist.githubusercontent.com/abdel792/58c7fa82c44df08b06d2674bb8bd6c70/raw/75eede89b1702df923d36fdccc2ccc47b7046cc1/appveyorForFTP.yml)

source: ## Procedure to receive notifications about commits
es: ## Procedimiento para recibir notificaciones sobre los commits

source: For notifications about push events (recommended for add-ons review), please see:
es: Para las notificaciones sobre eventos push (recomendadas a la hora de revisar complementos), visita:

source: Anyway, if you want to use AppVeyor:
es: En cualquier caso, si quieres usar AppVeyor:

source: 1. Create an email address to receive notifications. For instance, you may use the [groups.io email integration](https://groups.io/static/features).
es: 1. Crea una dirección de correo para recibir notificaciones. Por ejemplo, puedes usar la [integración de correo electrónico de groups.io](https://groups.io/static/features).

source: 2. In the appveyor.yml file, add these lines:
es: 2. En el archivo appveyor.impl, añade las siguientes líneas:

source: Replace notificationsEmailAddress.example.com with a valid email address.
es: Reemplaza notificationsEmailAddress.example.com por una dirección de correo electrónico válida.

source: Here is a [topic in groups.io mailing list as a real example](https://nvdaes.groups.io/g/NVDAADDONSCOMMITS/topic/build_completed/27377767).
es: Hay un [tema en la lista de correo de groups.io que sirve como ejemplo real](https://nvdaes.groups.io/g/NVDAADDONSCOMMITS/topic/build_completed/27377767).

source: ## References
es: ## Referencias

source: - [Appveyor.yml reference](https://www.appveyor.com/docs/appveyor-yml/)
es: - [Referencia Appveyor.yml](https://www.appveyor.com/docs/appveyor-yml/)

source: - [Publishing artifacts to GitHub Releases | AppVeyor](https://www.appveyor.com/docs/deployment/github/#configuring-in-appveyoryml)
es: - [Publicando artifacts en releases de GitHub | AppVeyor](https://www.appveyor.com/docs/deployment/github/#configuring-in-appveyoryml)

source: - [Syntax of the release name value in the deploy section of the appveyor.yml configuration file](http://help.appveyor.com/discussions/questions/9221-syntax-of-the-release-name-value-in-the-deploy-section-of-the-appveyoryml-configuration-file)
es: - [Sintaxis del nombre de release en la sección deploy del archivo de configuración appveyor.yml](http://help.appveyor.com/discussions/questions/9221-syntax-of-the-release-name-value-in-the-deploy-section-of-the-appveyoryml-configuration-file)

source: - [mesa/appveyor.yml at master · anholt/mesa](https://github.com/anholt/mesa/blob/master/appveyor.yml)
es: - [mesa/appveyor.yml en master · anholt/mesa](https://github.com/anholt/mesa/blob/master/appveyor.yml)

source: - [Discussion on the NVDA add-ons mailing list](https://nvda-addons.groups.io/g/nvda-addons/topic/6220467)
es: - [Discusión en la lista de correo de NVDA-Addons (complementos de NVDA)](https://nvda-addons.groups.io/g/nvda-addons/topic/6220467)

source: - [Updates for appveyor by Abdel on the NVDA add-ons mailing list](https://nvda-addons.groups.io/g/nvda-addons/topic/31686195#7943)
es: - [Actualizaciones de Abdel para AppVeyor en la lista de correo de complementos de NVDA](https://nvda-addons.groups.io/g/nvda-addons/topic/31686195#7943)

source: ## Acknowledgements
es: ## Agradecimientos

source: Thanks to @abdel792, @derekriemer and @tuukao for making this possible.
es: Gracias a @abdel792, @derekriemer y @tuukao por hacer esto posible.
