Repository: bingen13/devguides_translation
Catalog: translations/*/LC_MESSAGES/Braille-framework.po
Languages: es

source: The following draft page provides an introduction into NVDA's braille framework. For more information about braille displays, read the page that describes the process of [Adding Support for a Braille Display](https://github.com/nvaccess/nvda/wiki/AddingSupportForABrailleDisplay).
es: El siguiente borrador proporciona una introducción al marco de trabajo braille de NVDA. Para más información sobre las pantallas braille, lee la página que describe el proceso de añadir soporte para una pantalla braille.

source: ## Basic introduction to Modules
es: ## Introducción básica a los módulos

source: NVDA"s braille framework depends on the following modules:
es: El marco de trabajo braille de NVDA depende de los siguientes módulos:

source: * [`braille.py`](https://github.com/nvaccess/nvda/blob/master/source/braille.py): contains the base of NVDA"s braille code, including the braille handler as well as a base braille display driver that all braille display drivers inherit from. Also, it contains classes for regions, braille buffers and braille display gestures, described in greater detail below.
es: * [`braille.py`](https://github.com/nvaccess/nvda/blob/master/source/braille.py): contiene la base del código de NVDA relacionado con el braille, incluyendo el manejador braille y un controlador base de pantalla braille del que todas las pantallas braille heredan. Además contiene clases para regiones, buffers braille y gestos de pantallas braille, descritos con más detalle después.

source: * [`brailleTables.py`](https://github.com/nvaccess/nvda/blob/master/source/brailleTables.py): contains definitions of liblouis braille tables used within NVDA.
es: * [`brailleTables.py`](https://github.com/nvaccess/nvda/blob/master/source/brailleTables.py): contiene definiciones de las tablas braille de Liblouis empleadas por NVDA.

source: * [`brailleInput.py`](https://github.com/nvaccess/nvda/blob/master/source/brailleInput.py): the code that is responsible for the processing of braille input and kkey presses from braille keyboards.
es: * [`brailleInput.py`](https://github.com/nvaccess/nvda/blob/master/source/brailleInput.py): código responsable de la entrada braille y las pulsaciones de teclado en teclados braille.

source: * [`bdDetect.py`](https://github.com/nvaccess/nvda/blob/master/source/bdDetect.py): contains definitions of detection data for braille displays and implements a Detector class that facilitates automatic detection of braille displays over USB or Bluetooth.
es: * [`bdDetect.py`](https://github.com/nvaccess/nvda/blob/master/source/bdDetect.py): contiene definiciones de datos de detección para pantallas braille e implementa una clase Detector que facilita la detección automática de pantallas braille conectadas por USB o bluetooth.

source: * [`hwIo.py`](https://github.com/nvaccess/nvda/blob/master/source/hwIo.py): contains classes that streamline thread safe communication with braille displays using HID, Serial or Bulk protocols.
es: * [`hwIo.py`](https://github.com/nvaccess/nvda/blob/master/source/hwIo.py): contiene clases que hacen posible la comunicación sincronizada en hilos con las pantallas braille, usando los protocolos HID, de puerto serie o Bulk.

source: * [`hwPortUtils.py`](https://github.com/nvaccess/nvda/blob/master/source/hwPortUtils.py): contains fucntions that ease detection of HID, USB or Serial based hardware.
es: * [`hwPortUtils.py`](https://github.com/nvaccess/nvda/blob/master/source/hwPortUtils.py): contiene funciones que facilitan la detección de hardware HID, USB o conectado por puerto serie.

source: ## The `braille` module
es: ## El módulo `braille`

source: ### The `BrailleHandler` class
es: ### La clase `BrailleHandler`

source: The `BrailleHandler` class is the playing point guard of the braille framework. It receives requests from NVDA's core to control what has to be shown on a braille display, thereby making use of underlying technics and classes, including BrailleBuffers and BrailleRegions. When braille is initialized using the initialize function, a single BrailleHandler is instantiated as braille.handler. Basically, the braille handler does the following:
es: La clase `BrailleHandler` es el jugador estrella del marco de trabajo braille. Recibe solicitudes desde el núcleo de NVDA para controlar qué se debe mostrar en una pantalla braille, haciendo uso de clases y técnicas subyacentes, incluidas BrailleBuffers y BrailleRegions. Cuando se inicializa el módulo braille llamando a la función initialize, se instancia un único objeto BrailleHandler como braille.handler. Básicamente, el manejador braille hace lo siguiente:

source: * It keeps track of the current braille display in use and enables or disables automatic detection if appropriate.
es: * Realiza un seguimiento de la pantalla braille usada actualmente y activa o desactiva la detección automática si procede.

source: * It keeps track of several braille settings, including tethering, focus context presentation, cursor blinking, message timeout, braille output tables, etc.
es: * Realiza un seguimiento de varios ajustes braille, incluyendo el seguimiento, presentación del contexto del foco, parpadeo del cursor, tiempo de espera del mensaje, tablas de salida braille, etc.

source: * it allows interaction with displays using gestures for scrolling and cursor routing
es: * Permite la interacción con las pantallas usando gestos de desplazamiento y movimiento del cursor

source: * it performs actions based on several NVDA events related to objects, including when an object gains focus or becomes the navigator object.
es: * Realiza acciones basadas en varios eventos de NVDA relacionados con objetos, incluyendo cuando un objeto recibe el foco o el navegador de objetos.

source: ### The `Region` and `BrailleBuffer` classes
es: ### Las clases `Region` y `BrailleBuffer`

source: The `Region` and `BrailleBuffer` classes are strongly related to each other. A `Region` can be seen as the smallest entity within the braille framework, presenting information about an NVDA object. A BrailleBuffer can be seen as a box of regions that are relevant for the current focus object, navigator object or review position.
es: Las clases `Region` y `BrailleBuffer` están fuertemente relacionadas entre sí. Una `Region` puede verse como la entidad más pequeña dentro del marco de trabajo braille, y presenta información sobre un objeto NVDA. Un BrailleBuffer puede verse como una caja de regiones que pueden ser relevantes para el objeto actual con el foco, el navegador de objetos o la posición de revisión.

source: There are basically three types of regions:
es: Hay básicamente tres tipos de regiones:

source: 1. `TextRegion`: A simple region that just contains some text and isn't related to an NVDA object.
es: 1. `TextRegion`: una región simple que contiene algo de texto y no está relacionada con un objeto NVDA.

source: It can be used to show braille messages, such as those that are shown when retrieving the current time or date, the current battery status or when changing an NVDA setting using a gesture.
es: Se puede usar para mostrar mensajes braille, tales como los que se muestran al recuperar la fecha y hora actuales, el estado actual de la batería o al cambiar una opción de NVDA con un gesto.

source: 2. `NVDAObjectRegion`: A region that shows information about an NVDA object, such as its name (I agree), its role (checkbox or chk) and states (not checked or ⣏⣀⣹).
es: 2. `NVDAObjectRegion`: una región que muestra información sobre un objeto NVDA, tal como su nombre (Acepto), su rol (casilla de verificación o cv) y sus estados (no marcada o ( )).

source: Note that NVDAObjectRegions *do not** show the text within an edit control, such as a text editor.
es: Ten en cuenta que los objetos NVDAObjectRegion **no muestran** el texto de un cuadro de edición, como el que puede haber en un editor de texto.

source: 3. `TextInfoRegion`: These regions contain the content of TextInfo objects. The position of the review cursor within screen review, the text shown at the caret in a text editor or the currently selected line within NVDA"s browse mode are all shown using a TextInfoRegion or one of its subclasses.
es: 3. `TextInfoRegion`: estas regiones tienen el contenido de los objetos TextInfo. La posición del cursor de revisión en revisión de pantalla, el texto bajo el cursor en un editor de texto o la línea seleccionada actualmente en el modo exploración de NVDA se muestran usando un objeto TextInfoRegion o una de sus subclases.

source: A `BrailleBuffer` is responsible for chaining several `Region` instances together. When viewing an object that has been selected using object navigation, the buffer usually contains one or two objects;; one NVDAObjetRegion for the object's properties and an optional TextInfoRegion to show the text within the object when it is a text control. When showing a focused object however, the buffer may also contain several objects that form the so called focus ancestry of an object.
es: Un `BrailleBuffer` es responsable de concatenar varias instancias `Region` juntas. Al ver un objeto que ha sido seleccionado mediante navegación de objetos, el búfer normalmente contiene uno o dos objetos; un NVDAObjectRegion con las propiedades del objeto y un TextInfoRegion opcional para mostrar el texto del objeto cuando es un control de texto. Al mostrar el objeto con el foco, sin embargo, el búfer también puede contener varios objetos que forman lo que se conoce como ascendencia del foco de un objeto.

source: The structure of a buffer is probably best described using an example.
es: La estructura de un búfer puede probablemente describirse mejor con un ejemplo.

source: 1. Using the NVDA menu, go to `Preferences` > `Settings` and select the `Speech` category. Alternatively, you can press control+NVDA+v to open this category within the settings dialog.
es: 1. Usando el menú NVDA, ve a `Preferencias` > `Opciones` y selecciona la categorúia `Voz`. Alternativamente, puedes pulsar control+NVDA+v para abrir esta categoría en el diálogo de opciones.

source: 2. Focus the synthesizer edit control that contains the name of the current synthesizer.
es: 2. Lleva el foco al cuadro de edición que contiene el nombre del sintetizador actual.

source: 3. In this particular case, the braille buffer contains 4 regions:
es: 3. En este caso particular, el búfer braille contiene 4 regiones:

source: 1. An NVDAObjectRegion for the dialog, represented by the text "'NVDA: Speech (normal configuration) dlg"
es: 1. Un NVDAObjectRegion para el diálogo, representado por el texto "NVDA: Voz (configuración normal) dlg"

source: 2. An NVDAObjectRegion for the synthesizer grouping, represented by the text "'Synthesizer grp Alt+s"
es: 2. Un NVDAObjectRegion para el grupo sintetizador, representado por el texto "Sintetizador grp Alt+s"

source: 3. An NVDAObjectRegion for the synthesizer text control, represented by the text "Synthesizer ro mln edt Alt+s"
es: 3. Un NVDAObjectRegion para el control de texto del sintetizador, representado con el texto "Sintetizadorsl mln ce Alt+s"

source: 4. A TextInfoRegion for the contents of the synthesizer text control, which contains the text "Windows OneCore voices"
es: 4. Un TextInfoRegion para los contenidos del control de texto del sintetizador, que contiene el texto "Voces Windows OneCore"

source: These regions or parts of the buffer form the raw text of the buffer: 'NVDA: Speech (normal configuration) dlg Synthesizer grp Alt+s Synthesizer ro mln edt Alt+s Windows OneCore voices
es: Estas regiones o partes del búfer forman el texto en bruto del búfer: 'NVDA: Voz (configuración normal) dlg Sintetizador grp Alt+s Sintetizador sl mln ce Alt+s Voces Windows OneCore'

source: Note that this buffer is almost 200 characters in size and in braille characters, this might be even more, depending on your current braille table of use. However, a braille display may have only 40 braille cells. This is where NVDA makes a distiction between a braille buffer or a braille window. The braille window is the part of the buffer that is currently visible on your braille display. As you may expect, the braille window has a maximum size of the length of the current braille display. In the case that the braille window contains less characters, the braille display is padded up with spaces. You can change your position in a buffer with the scroll buttons on a braille display, in which case the position of the braille window is changed, effectively changing what is currently visible on your braille display.
es: Observa que este búfer tiene un tamaño de aproximadamente casi 200 caracteres, y en caracteres braille podrían ser más, dependiendo de la tabla braille en uso. Sin embargo, una pantalla braille puede contener sólo 40 celdas braille. Aquí es donde NVDA hace una distinción entre un búfer braille y una ventana braille. La ventana braille es la parte del búfer que se encuentra actualmente visible en tu pantalla braille. Como puedes esperar, la ventana braille tiene un tamaño máximo equivalente a la medida de la pantalla braille actual. En caso que la ventana braille contenga menos caracteres, el resto de la pantalla braille se rellena con espacios. Puedes cambiar tu posición en un búfer con los botones de desplazamiento de la pantalla braille, en cuyo caso la posición de la ventana braille cambia, cambiando efectivamente lo que es visible en tu pantalla braille.
