Repository: bingen13/devguides_translation
Catalog: translations/*/LC_MESSAGES/Copyright-headers.po
Languages: es

source: In most files (covered by the GNU GPL) use the following copyright header:
es: En la mayoría de los archivos del código fuente, cubiertos por la licencia GNU Gpl, usa una cabecera como la siguiente:

source: Replacing:
es: Reemplaza:

source: - `<YOUR NAME>` with your name.
es: - `<Tu nombre>` por tu nombre.

source: - `<CREATED YEAR>` the year the file was created
es: - `<Año de creación>` por el año de creación del archivo

source: - `<LAST UPDATED YEAR>`when the file was last updated. For new files this can be missing. E.g. a file created in 2017 might have `#Copyright (C) 2017`
es: - `<Año de última actualización>` por el año en que se actualizó el archivo por última vez. En los archivos nuevos no es necesario. Por ejemplo, un archivo que se ha creado en 2018 podría tener `#Copyright (C) 2018`

source: # Copyright (C) <CREATED YEAR>-<LAST UPDATED YEAR> NV Access Limited, <YOUR NAME>
es: # Copyright (C) <AÑO DE CREACIÓN>-<AÑO DE ÚLTIMA ACTUALIZACIÓN> NV Access Limited, <TU NOMBRE>

source: Some files are covered by the GNU LGPL, for example the the controller client, and the examples. This allows someone to use them (or parts of them) as-is. In this case use the following header:
es: Algunos archivos están cubiertos por la licencia GNU LGPL, como los ejemplos o el cliente del controlador utilizado por muchos programas para comunicarse con NVDA. Esto permite que cualquiera use todo o parte de su contenido tal y como está. En este caso utiliza la siguiente cabecera:

source: In some files an older style of referring to the contributors is used. The contributors is not a list of names and may just say something like:
es: En algunos archivos se usa un estilo más antiguo para referirse a las personas que han contribuido con él. Los contribuyentes no se expresan como una lista de nombres, sino escribiendo algo como:

source: `Copyright (C) 2006-2016 NVDA Contributors`. We are in the process of trying to convert these to the new style of explicit contributors. That process is a bit tricky. You have to use the git logs to figure out when the file was created and who touched it and then build a copyright line accordingly.
es: `Copyright (C) 2006-2016 NVDA Contributors `. NV Access trabaja para eliminar este viejo estilo y utilizar uno más nuevo indicando todos los nombres. El proceso es un poco complicado. Hay que mirar los registros de Git para ver cuándo se creó el archivo y quién lo ha tocado, y construir una línea de copyright adecuadamente.

source: **Note:**
es: **Nota:**

source: We decided to remove the filename comment from the top of the file, since it doesn't really add anything, and is a source of error on file rename / copying copyright headers between files.
es: NV Access decidió borrar el nombre de los archivos que se podía ver en la primera línea del comentario de copyright, ya que no aporta nada y es una causa frecuente de errores al renombrar o copiar las cabeceras de un archivo a otro.
