Repository: bingen13/devguides_translation
Catalog: translations/*/LC_MESSAGES/gcaddoninternals.po
Languages: es

source: # NVDA Add-on internals: Golden Cursor
es: # Complementos de NVDA vistos por dentro: Golden Cursor

source: Author: Joseph Lee
es: Autor: Joseph Lee

source: ## Introduction
es: ## Introducción

source: A graphical user interface isn't complete without means of moving around the screen and interacting with various elements. For years, a computer mouse was a handy tool for working with graphical elements, with touchscreens and mixed reality replacing functions of the mouse for some people. Even with the introduction of the mouse in the 1970's and move towards touch interaction in the 21st century, one input device has stil remained king of computer interaction: keyboards.
es: Una interfaz gráfica de usuario no está completa si no da la posibilidad de moverse por la pantalla e interactuar con diversos elementos. Durante años, un ratón de ordenador ha sido una herramienta muy útil para trabajar con elementos gráficos, siendo algunas de sus funciones sustituidas para algunas personas por tecnologías tales como pantallas táctiles o realidad mixta. Incluso con la llegada del ratón en la década de los 70 y el movimiento hacia la interacción táctil en el siglo XXI, un dispositivo de entrada ha permanecido todavía como el rey de la interacción con ordenadores: el teclado.

source: For many blind people, the concept of using a mouse (or touch interaction) may sound foreign, especially for people used to textual interfaces. For some people, using the mouse as a blind person was only a dream. Recent advancements in screen reading has bridged the gap somewhat, although there are areas that still need work, including describing cursor colors, more accuracy in mouse cursor shape announcement and so on, as well as ability to move the mouse with a keyboard. Fortunately, the last advancement is now a reality thanks to an add-on we'll be examining in this aricle: Golden Cursor.
es: Para muchas personas ciegas, el concepto de usar un ratón (o interacción táctil) puede sonar extraño, especialmente para aquellas acostumbradas a interfaces basadas en texto. Para algunos, usar el ratón siendo ciegos era solamente un sueño. Los recientes avances en lectores de pantalla lo han posibilitado un poco, aunque hay áreas que todavía necesitan trabajo: descripción de los colores del cursor, más precisión en el anunciado de sus cambios de forma, así como la posibilidad de mover el ratón con un teclado. Por suerte, el último punto ya se ha hecho realidad gracias a un complemento que examinaremos en este artículo: Golden Cursor.

source: Simply speaking, Golden Cursor is an add-on that allows NVDA users to manipulate the mouse via keyboard. Although Windows does have mouse keys, a keyboard with a physical numpad is required to take full advantage of this. On the other hand, Golden Cursor does not require a physical numpad, thus making it a bit more universal. Even though the add-on has seen little development activity, it is still an interesting add-on to study, as it showcases the enthusiasm the NVDA community has shown for this add-on, and a chance for the author of this article to improve the add-on and present its inner workings. In "NVDA Add-on Internals: Golden Cursor", we'll learn the history behind this add-on, recent developments, and dive into how this add-on improves mouse usability for blind people around the world.
es: A modo de resumen, Golden Cursor es un complemento que permite a los usuarios de NVDA manipular el ratón utilizando el teclado. Aunque Windows tiene la función de teclas del ratón, es imprescindible disponer de un teclado numérico para aprovechar al máximo esta característica. Por otra parte, Golden Cursor no necesita un teclado numérico físico, haciéndolo por tanto más universal. Incluso aunque el complemento ha tenido poca actividad de desarrollo últimamente, sigue siendo digno de estudio al ser un caso de éxito. La comunidad se ha mostrado entusiasmada con este complemento, y este artículo supone una oportunidad para su autor para mejorar el complemento y exponer los detalles internos de su trabajo. En este artículo conoceremos la historia que hay tras este complemento, los desarrollos recientes, y veremos cómo mejora la usabilidad del ratón para personas ciegas de todo el mundo.

source: To download this add-on, visit https://addons.nvda-project.org/addons/goldenCursor.en.html. The source code repository can be found at https://github.com/josephsl/goldenCursor.
es: Para descargar este complemento, visita la sección de complementos en el menú superior de nuestra web. Su código fuente se encuentra en https://github.com/josephsl/goldenCursor.

source: ## Golden Cursor: A History
es: ## Golden Cursor: la historia

source: Towards end of 2015, an Arabic-speaking NVDA translator contacted NVDA add-ons team and introduced the community to an add-on a friend of the translator was developing. Called "Golden Cursor", the add-on came with keyboard commands to manipulate the mouse. Since the community has shown interest in this add-on, I decided to contact the devleoper and review the new add-on.
es: Hacia finales de 2015, un traductor árabe contactó con el equipo de complementos de NVDA y presentó ante la comunidad un complemento que un amigo suyo estaba desarrollando. Llamado "Golden Cursor", el complemento vino con órdenes de teclado para manipular el ratón. Ya que la comunidad ha mostrado interés en este complemento, decidí contactar con el desarrollador y revisarlo.

source: Although the add-on had potential, it had numerous coding problems. for example, in early drafts, it used Python's boolean statements like this:
es: Aunque el complemento tenía potencial, padecía varios problemas de codificación. Por ejemplo, en sus versiones preliminares, usaba sentencias booleanas de Python como estas:

source: if something == False: #code
es: if algo == False: #código

source: ## Add-on mechanics
es: ## Mecanismos del complemento

source: The "wheel" is actually a call to SetCursorPos Windows API function, wrapped inside winUser module (as winUser module wraps user32.dll), ultimately controlled by moveMouse method in the add-on. The moveMouse method takes the mouse direction flag, and based on cursor location, direction given and mouse restriction flag, positions the mouse cursor on the new location. The direction flags are:
es: Realmente, la "rueda" es una llamada a la función de la api de Windows SetCursorPos, encapsulada dentro del módulo winUser (ya que winUser encapsula las funciones de user32.dll), y controlada en última instancia por el método moveMouse del complemento. El método moveMouse recibe un indicador con la dirección del ratón, y basándose en la posición actual del mismo, su dirección y el indicador de restricciones, posiciona el cursor del ratón en la nueva ubicación. Los indicadores de dirección son:

source: * 0: Move mouse to the right.
es: * 0: mueve el ratón hacia la derecha.

source: * 1: Move mouse to the left.
es: * 1: mueve el ratón hacia la izquierda.

source: * 2: Move mouse down.
es: * 2: mueve el ratón hacia abajo.

source: * 3: Move mouse up.
es: * 3: mueve el ratón hacia arriba.

source: The moveMouse routine is as follows:
es: El procedimiento para mover el ratón es el siguiente:

source: 1. Obtains the current mouse location by calling GetCursorPos function, which returns current X and Y mouse coordinates.
es: 1. Se obtiene la ubicación actual del cursor llamando a la función GetCursorPos, que devuelve las coordenadas x e y del ratón.

source: 2. Calculates the new mouse location based on direction given and movement unit (movement unit can range from 1 to 100 pixels; a pixel (picture element) is a very small square on displays used to hold display output, such as color, intensity and others, and displays ship with millions of pixels). For example, if Control=Windows+right arrow is pressed, since we're moving to the right, new X coordinate will be current X coordinate plus the movement unit. Similarly, if Contorl+Windows+left arrow is pressed, the new X coordinate will be current coordinate minus the movement unit.
es: 2. Se calcula la nueva ubicación del ratón basada en la dirección dada y la unidad de movimiento (esta unidad tiene un rango que varía entre 1 y 100 píxeles; un píxel (del inglés picture element) es un cuadrado muy pequeño en los monitores usado para procesar la información saliente, como por ejemplo el color, intensidad y demás, y los monitores vienen con millones de píxeles). Por ejemplo, si pulsamos ctrl+windows+flecha derecha ya que nos movemos en esa dirección, la nueva coordenada x será la suma de la coordenada x actual y la unidad de movimiento. De manera similar, si pulsamos ctrl+windows+flecha izquierda, la nueva coordenada x será la resta de la coordenada x actual y la unidad de movimiento.

source: 3. If mouse restriction is set (that is, if a mouse is told to stay at the current application), the new locatin will be somewhere inside the restircted application, otherwise mouse will move. Then SetCursorPos function is claled to plce the mouse on the new location.
es: 3. Si se establece una restricción del ratón (por ejemplo, si lo configuramos para que deba permanecer en la aplicación actual), la nueva ubicación estará en algún lugar dentro de la aplicación donde restringimos, en cualquier otro caso el ratón se moverá. A continuación, se llama a la función SetCursorPos para establecer en pantalla la nueva ubicación del ratón.

source: 4. The add-on also includes ability to announce mouse coordinates, and if this is true, new coordinate (at least the new X or Y coordinate) will be announced.
es: 4. El complemento también incluye la posibilidad de verbalizar las nuevas coordenadas del ratón. Si esta característica está activada, se verbalizará al menos una coordenada (x o y) o ambas.

source: Mouse coordinate tag and jumping to a specific coordinate is a variation of the above mechanism. When one wishes to move mouse to another location, one can invoke mouse jump dialog and type the new coordinate (x, then comma, then y value). Similarly, when one wishes to mark a mouse locatoin with a tag, one can move th mouse to the desired location and open positions dilaog, give it a label nad press Enter, with the tag saved to an ini file named for the app name with the file extension of .gc (for example, outlook.gc for mouse tags for Microsoft Outlook). Then one can invoke positions list dialog, select a tag, and press Enter to move the mouse to the tagged location, with the positoins list dilaog also providing means to rename, delete or clear the tag for the application.
es: El etiquetado de coordenadas y el salto a coordenadas específicas son dos variantes del mecanismo explicado más arriba. Cuando se desea desplazar el ratón a otra ubicación, se puede invocar el diálogo de salto y escribir las nuevas coordenadas (valor de x, una coma, y luego el valor de y). De forma similar, si se desea marcar una ubicación del ratón con una etiqueta, se puede mover el ratón a la ubicación deseada y abrir el diálogo de posiciones, escribir una etiqueta y pulsar intro, guardando esta etiqueta en un fichero ini cuyo nombre es el nombre de la aplicación y la extensión .gc (por ejemplo, outlook.gc para etiquetas del ratón en Microsoft Outlook). A continuación, se puede invocar el diálogo de lista de posiciones, seleccionar una etiqueta, y pulsar intro para mover el ratón a la ubicación etiquetada, con el diálogo de lista de posiciones ofreciendo también opciones para renombrar, eliminar o limpiar las etiquetas para la aplicación.

source: Besides mouse movement commands, the add-on comes with two option flags to announce new mouse coordinate in pixels and to restrict mouse movement to the currently using app.
es: Además de las órdenes de movimiento del ratón, este complemento viene equipado con dos indicadores que permiten configurar si se verbalizan las nuevas coordenadas del ratón en píxeles, o si se restringe el movimiento del mismo a la aplicación utilizada actualmente.

source: ## Screen coordinates on Windows
es: ## Coordenadas de la pantalla en Windows

source: For people familiar with mathematical representation of a 2D graph or a plane, the ideal starting point (or origin) would be center, or for computer monitors, bottom left. However, on Windows, the starting point is top left. For example, on a 1920 by 1080 pixel display, the top left is (0, 0), and top right is (1920, 0). Using this logic, we can see that bottom left is (0, 1080), and bottom right is (1920, 1080). Note that you need to subtract one from the maximum, so the coordinate for the bottom right corner becomes (1919, 1079).
es: Para la gente familiarizada con la representación matemática de un plano o un gráfico 2D, el punto de inicio ideal (también llamado origen) podría ser el centro, o para monitores de ordenador, la esquina inferior izquierda. Sin embargo, en Windows, el punto de inicio es la esquina superior izquierda. Por ejemplo, en una pantalla con una resolución de 1920x1080 píxeles, la esquina superior izquierda es (0,0), y la esquina superior derecha es (1920,0). Aplicando esta lógica, podemos ver que la esquina inferior izquierda es (0,1080) y la inferior derecha es (1920,1080). Ten en cuenta que es necesario restar una unidad del máximo, por lo que la coordenada de la esquina inferior derecha en realidad es (1919,1079).

source: When we apply this to mouse movement, the X coordinate increases when the mouse moves to the right, while the Y coordinate decreases as the mouse moves up. For sake of completeness, mouse movement expressions are:
es: Cuando aplicamos esto al movimiento del ratón, la coordenada x se incrementa al mover el ratón a la derecha, mientras que la coordenada y disminuye cuando lo subimos hacia arriba. Para dar más completitud, las expresiones de movimiento del ratón son:

source: * Mouse moving left: new X = current X - movement unit
es: * Se mueve el ratón hacia la izquierda: nueva x = x actual - unidad de movimiento

source: * Mouse moving down: new Y = current Y + movement unit
es: * Se mueve el ratón hacia abajo: nueva y = y actual + unidad de movimiento

source: * Mouse moving up: new Y = current Y - movement unit
es: * Se mueve el ratón hacia arriba: nueva y = y actual - unidad de movimiento

source: ## Conclusion
es: ## Conclusión

source: It is said that the simple something is, the better. The Golden Cursor add-on fits this definition perfectly: a simple add-on that is surprisingly powerful and useful. The ability to use the keyboard to move the mouse has been a dream for many, and now, thanks to this add-on, it has become a reality. Time will tell how this add-on will evolve to meet people's needs, and some useful ideas are already being planned by the community.
es: Se suele decir que cuanto más simple es algo, mejor. El complemento Golden Cursor encaja en esta definición perfectamente: un complemento simple que a la vez es sorprendentemente potente y útil. La capacidad para usar el teclado para mover el ratón ha sido un sueño para muchos, y ahora, gracias a este complemento, se ha hecho realidad. El tiempo dirá como evolucionará este complemento para satisfacer las necesidades de la gente, ya se están planteando algunas buenas ideas en la comunidad.

source: ## References
es: ## Referencias

source: * Pixel (Wikipedia): https://en.wikipedia.org/wiki/Pixel
es: * Píxel (Wikipedia): https://en.wikipedia.org/wiki/Pixel

source: * GetCursorPos (user32.dll) reference (Windows API): https://msdn.microsoft.com/en-us/library/windows/desktop/ms648390(v=vs.85).aspx
es: * Referencia de GetCursorPos (user32.dll) (Windows API): https://msdn.microsoft.com/en-us/library/windows/desktop/ms648390(v=vs.85).aspx

source: * SetCursorPos (user32.dll) reference (Windows API): https://msdn.microsoft.com/en-us/library/windows/desktop/ms648394(v=vs.85).aspx
es: * Referencia de SetCursorPos (user32.dll) (Windows API): https://msdn.microsoft.com/en-us/library/windows/desktop/ms648394(v=vs.85).aspx
