Repository: bingen13/devguides_translation
Catalog: translations/*/LC_MESSAGES/githubWebhooks.po
Languages: es

source: # Using GitHub webhooks to receive notifications
es: # Usar Github webhooks para recibir notificaciones

source: ## Purpose
es: ## Propósito

source: This can be helpful to receive notifications, for example on a mailing list, when Gitub repos trigger push events, i.e., when new code or tags are pushed in the add-ons development process.
es: Esto puede ser útil para recibir notificaciones, por ejemplo en una lista de correo, cuando los repositorios de Github disparan eventos push, por ejemplo al enviar nuevas etiquetas o código en el proceso de desarrollo de complementos.

source: ## Procedure
es: ## Procedimiento

source: ### Create a Google web app
es: ### Crear una aplicación web de Google

source: 1. Copy this [script sample](https://gist.github.com/nvdaes/c5cb65b148e6e989d3e243b61719a80a/raw/4f5129705fa49b01ff5434535492870ac2c750e5/githubPushNotifier.gs) in an accessible editor, such as Notepadd++ or Notepad:
es: 1. Copia este [script de ejemplo](https://gist.github.com/nvdaes/c5cb65b148e6e989d3e243b61719a80a/raw/4f5129705fa49b01ff5434535492870ac2c750e5/githubPushNotifier.gs) en un editor accesible, como el bloc de notas o Notepad++:

source: 2. Replace email@example.com with the email address you want to use, for instance, using the [groups.io email integration](https://groups.io/static/features).
es: 2. Reemplaza email@example.com por la dirección de correo que quieras usar, por ejemplo el servicio de [integración de correo electrónico de groups.io](https://groups.io/static/features).

source: 3. Create a project at
es: 3. Crea un proyecto en

source: - In the multi-line edit box, copy your modified script and press control+s to save.
es: - En el cuadro de edición multilínea, copia tu script modificado y pulsa ctrl+s para guardar.

source: - Select Publish > Deploy as web app.
es: - Selecciona Publicar > Desplegar como aplicación web.

source: - Under Execute the app as, select run with your account.
es: - Bajo Ejecutar la app como, selecciona ejecutar con tu propia cuenta.

source: - Under Who has access to the app, select Anyone, even anonymous.
es: - Bajo Quién tiene acceso a la app, selecciona Cualquiera, incluso si es anónimo.

source: - Click Deploy.
es: - Haz clic en desplegar.

source: - Copy the Current web app URL.
es: - Copia la URL actual de la aplicación web.

source: For more details, please see
es: Para más detalles, consulta

source: ### Configure a webhook on GitHub
es: ### Configurar un webhook en GitHub

source: 1. From a GitHub repo, go to Settings > Webhooks > Add webhook.
es: 1. Desde un repositorio git, ve a Settings > Webhooks > Add webhook.

source: 2. In the Payload URL edit box, copy the URL for your web app.
es: 2. En el cuadro de edición Payload URL, copia la URL de tu aplicación web.

source: 3. In the Content type combo box, select application/json.
es: 3. En el cuadro combinado Content type, selecciona application/json.

source: 4. In the Enable SSL verification set of radio buttons, disable this option.
es: 4. En el conjunto de botones de opción Enable SSL verification, deshabilita esta opción.

source: 5. Press Add webhook.
es: 5. Pulsa en Add webhook.

source: Note: In the above process, you may need to confirm your GitHub password.
es: Nota: en este proceso, puede ser necesario que confirmes tu contraseña de Github.

source: ## References
es: ## Referencias
