Repository: bingen13/devguides_translation
Catalog: translations/*/LC_MESSAGES/Github-issue-template-explanation-and-examples.po
Languages: es

source: # Creating new issues on the NVDA project
es: # Creación de nuevas incidencias en el proyecto NVDA

source: This page is meant to serve as an explanation for how to fill out our [Github issue templates](https://github.com/nvaccess/nvda/blob/master/.github/ISSUE_TEMPLATE/).
es: Esta página se ha creado para servir como explicación al rellenar las [plantillas de incidencia en GitHub (en inglés)](https://github.com/nvaccess/nvda/blob/master/.github/ISSUE_TEMPLATE/).

source: The template uses github markdown, to provide formatting for headings, lists, quotes etc. If you are not familiar, please take some time to learn about [Github markdown](https://guides.github.com/features/mastering-markdown/)
es: La plantilla usa markdown de Github, para proporcionar formato en los encabezados, listas, citas, etc. Si no estás familiarizado con esto, tómate algo de tiempo para aprender sobre [el markdown de Github (en inglés)](https://guides.github.com/features/mastering-markdown/)

source: **Warning**: In all but exceptional circumstances we require this template to be completed. Your issue will likely be closed if this template has not been followed.
es: **Advertencia**: salvo en raras circunstancias, es necesario completar toda la plantilla. Probablemente se cerrará tu incidencia si no se ha seguido esta plantilla.

source: We currently have two templates, both are described on this page:
es: Actualmente tenemos dos plantillas, ambas se describen en esta página:

source: - for bug reports
es: - para informes de fallos

source: - for feature requests.
es: - para solicitud de características.

source: ## General information
es: ## Información general

source: The following information applies to all issues (bug reports, new features, even pull requests). At the start of the template there is a HTML comment block which points to this wiki page, it can be left in place and will not appear once the issue is saved. Feel free to delete it.
es: La siguiente información se aplica a todas las incidencias (informes de fallos, solicitudes de características, e incluso solicitudes de cambio). Al principio de la plantilla hay un bloque de comentarios en HTML que apunta hacia la versión inglesa de esta página en la wiki de NVDA. Se puede dejar como está, y no aparecerá una vez que se guarde la incidencia. Elimínalo si lo deseas.

source: ### Attachments / Images
es: ### Adjuntos e imágenes

source: It's important to include any files that are required to reproduce an issue. This might be a required file for an office suite, or a link to a code playground such as CodePen or JSFiddle, or perhaps a standalone HTML file. Github does not allow all [file types to be attached](https://help.github.com/articles/file-attachments-on-issues-and-pull-requests/), however, zip files are allowed, so you can always zip your file and attach that instead.
es: Es importante incluir cualquier archivo necesario para reproducir la incidencia. Este podría ser un archivo necesario para una suite ofimática, o un enlace a un recreador de código como CodePen o JSFiddle, o tal vez un archivo HTML independiente. Github no permite adjuntar todos los [tipos de archivos](https://help.github.com/articles/file-attachments-on-issues-and-pull-requests/). Sin embargo, sí se permiten los archivos zip, por lo que puedes comprimir tu archivo y adjuntar el resultado.

source: #### Logs
es: #### Registros

source: In most cases an NVDA log file is incredibly helpful when trying to understand/fix an issue, please remember to attach one. More [instructions are available on the wiki](https://github.com/nvaccess/nvda/wiki/LogFilesAndCrashDumps). If you are getting a crash dump file (nvda_crash.dmp) please also include it.
es: En la mayor parte de los casos, un archivo de registro de NVDA es increíblemente útil cuando se intenta comprender o resolver un problema, así que no olvides adjuntarlo. Hay instrucciones al respecto en los documentos para desarrolladores de esta web. Si lo que obtienes es un archivo de minivolcado (nvda_crash.dmp), inclúyelo también.

source: #### Screenshots
es: #### Capturas de pantalla

source: While we welcome **images/screenshots** to help explain a problem, be aware that many of the developers of NVDA are blind and will greatly appreciate this image being described in text. Most tools allow you to copy text out of them.
es: Aunque las **imágenes / capturas de pantalla** son bienvenidas para ayudar a explicar un problema, ten en cuenta que muchos de los desarrolladores de NVDA son ciegos y apreciarán mejor la imagen si está descrita como texto. La mayoría de las herramientas te permiten copiar texto fuera de ellas.

source: ### Tips
es: ### Consejos

source: * Consider swapping to the preview tab in order to read through your issue at any stage to confirm the issue reads as expected.
es: * Plantéate ir a la pestaña Preview para leer tu incidencia en cualquier momento y confirmar que queda como esperas.

source: * If you have trouble following this template, or with the initial investigation that is required, please politely ask for assistance from the fantastic community of people on the [NVDA users mailing list](https://github.com/nvaccess/nvda-community/wiki/Connect#international-users-mailing-list-english)
es: * Si tienes problemas siguiendo esta plantilla, o con la investigación inicial necesaria, pide educadamente asistencia a la fantástica comunidad que se encuentra en la [lista de correo de NVDA en español](https://groups.google.com/group/nvda-es)

source: ## Feature Request template
es: ## Plantilla de solicitud de características

source: After the HTML comment ([discussed earlier](#General_information)), you may provide a brief overview of the issue. Then fill in each of the following headings which match those that are found in the template, with a short description of how to fill in each section.
es: Después del comentario en HTML ([explicado antes](#informacion-general)), puedes proporcionar una breve descripción de la incidencia. A continuación, rellena cada uno de los siguientes encabezados, correspondientes con los que hay en la plantilla, con una breve descripción de cómo rellenar cada sección.

source: ### Is your feature request related to a problem? Please describe.
es: ### ¿Está tu solicitud de características relacionada con un problema? Por favor, descríbelo.

source: This section should provide a clear and concise description of what the problem is. Ex. I'm always frustrated when [...]
es: Esta sección debería proporcionar una descripción clara y concisa de cuál es el problema. Por ejemplo: siempre me frustro cuando [...]

source: ### Describe the solution you'd like
es: ### Describe la solución que te gustaría

source: A clear and concise description of what you want to happen. If you can provide technical details about how to address the problem, please do so. Feel free to add a subheading.
es: Una descripción clara y concisa de lo que quieres que pase. Si puedes proporcionar detalles técnicos para solucionar el problema, no dudes en hacerlo. Puedes añadir un subencabezado si quieres.

source: ### Describe alternatives you've considered
es: ### Describe alternativas en las que has pensado

source: A clear and concise description of any alternative solutions or features you've considered.
es: Una descripción clara y concisa de soluciones o características alternativas que te hayas planteado.

source: ### Additional context
es: ### Contexto adicional

source: Add any other context for the feature request here. This might be the other applications and their versions that the feature is expected to work with (EG Firefox or Microsoft Word). Also consider whether you can upload an attachment document that will help to serve as a test case for the feature.
es: Añade cualquier otro contexto para la solicitud de características aquí. Podría ser las otras aplicaciones y versiones de las mismas con las que se espera que funcione la característica (por ejemplo, Firefox o Microsoft Word). Además, plantéate si puedes subir un documento adjunto que ayude como caso de prueba para la característica.

source: ## Bug report template
es: ## Plantilla de informe de fallos

source: After the HTML comment ([discussed earlier](#general-information)), you may provide a brief overview of the issue. Then fill in each of the following headings which match those that are found in the template, with a short description of how to fill in each section.
es: Después del comentario en HTML ([explicado antes](#informacion-general)), puedes proporcionar una breve descripción de la incidencia. A continuación, rellena cada uno de los siguientes encabezados, correspondientes con los que hay en la plantilla, con una breve descripción de cómo rellenar cada sección.

source: ### Steps to reproduce:
es: ### Pasos para reproducir:

source: This section should contain a list of the steps you take to demonstrate the problem. While you are working out the steps required, please make a copy of your [NVDA log to attach to the issue](https://github.com/nvaccess/nvda/wiki/LogFilesAndCrashDumps).
es: Esta sección debería contener una lista de los pasos que realizas para demostrar el problema. Mientras los estés realizando, haz una copia de tu registro de NVDA para adjuntarla a la incidencia.

source: *Example:*
es: *Ejemplo:*

source: > 1. Open Chrome
es: > 1. Abrir Chrome

source: > 1. Browse to www.google.com
es: > 2. Navegar a www.google.com

source: > 1. Type "Hello"
es: > 3. Escribir "Hola"

source: > 1. Press Enter
es: > 4. Pulsar intro

source: ### Actual behavior:
es: ### Comportamiento actual:

source: This section should tell us what actually happens when these steps are taken.
es: Esta sección debería explicar qué sucede realmente al llevar a cabo los pasos anteriores.

source: > An NVDA error sound is heard.
es: > Se oye un sonido de error de NVDA.

source: ### Expected behavior:
es: ### Comportamiento esperado:

source: This section should tell us what you expect to happen when these steps are taken.
es: En esta sección deberías explicar qué esperas que pase al seguir los pasos anteriores.

source: > There should be no error sound, and the page should change to show the search results.
es: > No debería haber sonido de error, y la página debería cambiar para mostrar los resultados de la búsqueda.

source: ### System configuration:
es: ### Configuración del sistema:

source: This section has several sub-sections. These are all about the system you are using when encountering the issue. If you are encountering the issue with multiple different configurations, please list them. This helps us to be able to reproduce the issue, or help us to investigate why this issue occurs for some users and not others.
es: Esta sección tiene varias subsecciones. Estas van sobre el sistema que estás usando al encontrar el fallo. Si encuentras el fallo con diversas configuraciones diferentes, lístalas. Esto ayuda a los desarrolladores a reproducir el problema, o investigar por qué el problema les ocurre a algunos usuarios y a otros no.

source: #### NVDA installed/portable/running from source:
es: #### NVDA Instalado/portable/ejecutándose desde el código fuente:

source: This tells us how you are using NVDA.
es: Esto indica a los desarrolladores cómo estás utilizando NVDA.

source: > Installed
es: > Instalado

source: #### NVDA version:
es: #### Versión de NVDA:

source: The version of NVDA that you are using when demonstrating the issue. This can be copied from the about option, in the NVDA help menu.
es: La versión de NVDA que estás utilizando para demostrar el problema. Se puede copiar desde la opción Acerca de, en el menú Ayuda de NVDA.

source: #### Windows version:
es: #### Versión de Windows:

source: The version of Windows that you are using. You can copy this from the "System Information" application:
es: La versión de Windows que estás usando. Puedes copiarla desde la aplicación "Información del sistema":

source: 1. Press `Windows+r` to open the run dialog
es: 1. Pulsa `Windows+r` para abrir el diálogo ejecutar

source: 1. Type `msinfo32` and press enter
es: 2. Escribe `msinfo32` y pulsa intro

source: 1. From the "System summary" treeview item, press tab to get to the right pane.
es: 3. Desde el elemento de árbol "Resumen del sistema", pulsa tab para llegar al panel derecho.

source: 1. Press down arrow twice to get to "Version"
es: 4. Pulsa flecha abajo dos veces para llegar a "Versión"

source: 1. Press `Control+C` to copy the version information.
es: 5. Pulsa `control+c` para copiar la información de versión.

source: > Windows 10 Version 1607 Build 14393.1066
es: > Windows 10 Versión 1607, Compilación 14393.1066

source: #### Name and version of other software in use when reproducing the issue:
es: #### Nombre y versión de otro software en uso al reproducir el problema:

source: Typically you can get this information from the "About" dialog of the software.
es: Normalmente puedes obtener información desde el diálogo "Acerca de" del software.

source: > Chrome version: 67.0.3396.87
es: > Chrome versión: 67.0.3396.87

source: #### Other information about your system:
es: #### Otra información de tu sistema:

source: This is other information about your setup that you think might be relevant to us.
es: Se trata de otra información sobre tu configuración que crees que podría ser importante para los desarrolladores.

source: > Running Windows 10 in a VM
es: > Ejecuto Windows 10 desde una máquina virtual

source: ### Other questions:
es: ### Otras preguntas:

source: This section has sub-sections, asking about the basic investigation steps you may have completed. Please feel free to add more information here to tell us about what you have tried.
es: Esta sección tiene subsecciones que preguntan sobre los pasos básicos de la investigación que puedes haber completado. Si quieres, añade más información aquí para contarle a los desarrolladores qué pruebas has hecho.

source: #### Does the issue still occur after restarting your PC?
es: #### ¿El problema todavía ocurre después de reiniciar tu PC?

source: Restarting your computer will help to ensure that software is in a fresh state.
es: Reiniciar tu ordenador ayudará a asegurar que el software se encuentra en un estado más fresco.

source: #### Have you tried any other versions of NVDA?
es: #### ¿Has probado otras versiones de NVDA?

source: Knowing whether this issue occurs in previous releases helps us to understand if this is a newly introduced issue, and gives us an indication as to whether it is a change in our software or others that has introduced the problem.
es: Saber si el problema ocurre en versiones anteriores ayuda a los desarrolladores a entender si es un problema recién introducido, y les da una pista sobre si es un cambio en NVDA o el responsable del problema es otro programa.

source: > * NVDA 2018.1 - no error sound
es: > * NVDA 2018.1 - no hay sonido de error

source: > * NVDA 2018.2 - has error sound
es: > * NVDA 2018.2 - tiene el sonido de error
