Repository: bingen13/devguides_translation
Catalog: translations/*/LC_MESSAGES/GSOC-2019-Ideas-List.po
Languages: es

source: We should consider moving these handlers into C++, ensuring that they are run on separate threads from NVDA's main core thread. Each handler should place its filtered data into a queue and wake up the core with some kind of low-level win32 event. The core can then take from the queue and process as it normally does.
es: Se debería plantear la posibilidad de mover estos manejadores a C++, asegurándose de que se ejecuten en hilos distintos al del núcleo principal de NVDA. Cada manejador debería dejar sus datos filtrados en una cola y despertar al núcleo con algún tipo de evento Win32 a bajo nivel. El núcleo entonces puede recoger de la cola y procesar la información como lo haría normalmente.

source: ### Performance measuring system for NVDA
es: ### Sistema de medida de rendimiento para NVDA

source: We would like to gather information about the performance of NVDA's various subsystems within day to day usage, so that we can better understand the performance issues that some people are reporting, especially those on low-end hardware.
es: A NV Access le gustaría recopilar información sobre el rendimiento de los distintos subsistemas de NVDA al usarlos día a día, y de esa forma entender mejor los problemas de rendimiento de los que informan los usuarios, especialmente aquellos con hardware de gama baja.

source: Collection and submission of performance data should be opt-in, and should not in itself cause negative impact on performance.
es: La recopilación y envío de los datos de rendimiento debe ser opcional, y en sí misma no debería causar un impacto negativo en el rendimiento.

source: Information such as how often the core is woken up, how long a core cycle takes on average, number of accessibility API events are received, how long navigating to the next or previous line in a document takes etc.
es: Información sobre cada cuánto tiempo despierta el núcleo, cuánto lleva de media un ciclo del núcleo, cuántos eventos se reciben de las apis de accesibilidad, cuánto tiempo lleva navegar a la línea anterior o siguiente en un documento, etc.

source: At very least this data could be stored locally with the ability for the user to send it to NV Access manually. At best, this data would be sent directly to NV Access servers automatically, assuming the user has allowed this.
es: Como mínimo se podrían almacenar estos datos de forma local y dar la capacidad al usuario de enviarlos a NV Access manualmente. Lo mejor sería que los datos se enviaran a los servidores de NV Access automáticamente, siempre que el usuario lo haya permitido.

source: ### Improve the UX of the NVDA updater
es: ### Mejorar la experiencia de usuario con el actualizador de NVDA

source: Related issues: [#2257](https://github.com/nvaccess/nvda/issues/2257), [#7451](https://github.com/nvaccess/nvda/issues/7451), [#9174](https://github.com/nvaccess/nvda/issues/9174)
es: Incidencias relacionadas: [#2257](https://github.com/nvaccess/nvda/issues/2257), [#7451](https://github.com/nvaccess/nvda/issues/7451), [#9174](https://github.com/nvaccess/nvda/issues/9174)

source: Currently if there is an update available for NVDA, a dialog comes to the foreground notifying the user. this can interrupt the user and or the user may miss it or even accidentally activate it.
es: Actualmente, si hay una actualización disponible para NVDA, se muestra un diálogo en primer plano para notificar al usuario. Esto puede interrumpir al usuario, que además podría pulsar de forma accidental alguno de los botones.

source: We should consider providing a UX for updates similar to other software, that makes use of modern notification APIs such as toasts and the Windows 10 notification API.
es: Debería plantearse la posibilidad de proporcionar una experiencia de usuario similar a la de otros programas, que haga uso de las apis modernas de notificación, como por ejemplo la API de notificación de Windows 10 o las notificaciones emergentes.

source: Perhaps included in this work could be also improving the update process so that:
es: Quizás en este trabajo se podrían incluir mejoras en el proceso de actualización como las siguientes:

source: - Administrative access is no longer required to update NVDA (we could use a service like Mozilla products)
es: - Que ya no haga falta acceso como administrador para actualizar NVDA (se podría usar un servicio como el que tienen los productos de Mozilla)

source: - Unpack NVDA in the background, so updating only takes as long as renaming a folder and registering some shortcuts etc. Rather than the user having to wait for all files to be copied.
es: - Extraer NVDA en segundo plano, de tal forma que la actualización dure sólo lo que se tarda en renombrar una carpeta, registrar algunos accesos directos, etc. en vez de que el usuario tenga que esperar a que se copien todos los archivos.

source: ### Customize order and inclusion of object and formatting information to speech and braille
es: ### Personalizar el orden y la inclusión de la información de objetos y formato con voz y braille

source: Related issues: #7232
es: Incidencias relacionadas: #7232

source: When NVDA reports a particular control in speech or braille, it includes information such as the control's name, role (button, checkbox, slider etc), states (checked, pressed, collapsed etc), its value if it has one (100% for example), description, keyboard shortcut, position in group, and several other possible properties.
es: Cuando NVDA anuncia un control determinado mediante voz o braille, incluye información como su nombre, su rol (botón, casilla de verificación, deslizador, etc), estados (marcado, pulsado, contraído, etc), su valor si lo tiene (100% por ejemplo), descripción, atajo de teclado, posición en el grupo, y otras posibles propiedades varias.

source: The order in which NVDA reports these properties is hard-coded, and is roughly the same for both speech and braille.
es: El orden en que NVDA anuncia estas propiedades es rígido, y es casi el mismo para voz y braille.

source: We should consider allowing the user to customize the order in which this information is presented, and allow it to be configured separately for speech and braille.
es: Debería plantearse la posibilidad de permitir que el usuario personalice el orden en el que se presenta esta información, y que se configure de forma separada para voz y braille.

source: Perhaps some kind of template language could be used to represent the order, along with a suitable UI that could allow the average user to be able to insert, remove and reorder properties.
es: Quizás se podría usar algún tipo de lenguaje de plantilla para representar este orden, junto con una interfaz de usuario adecuada que permita al usuario medio ser capaz de insertar, eliminar y reordenar propiedades.

source: This UI would have to allow separate configuring for both speech and braille, and may go as far as separate configurations for both browse mode and focus mode (i.e. reporting controls embedded in a document such as a link, verses a stand-alone control in a dialog).
es: Esta interfaz debería separar las configuraciones de voz y braille, y puede llegar incluso a separar la configuración para el modo foco y el modo exploración (por ejemplo, anunciar controles incrustados en un documento tales como enlaces, en comparación con un control independiente en un diálogo).

source: Similar to reporting controls, NVDA reports many text formatting attributes. Again, currently the order of this information is hard-coded and is pretty much the same in both speech and braille. Example formatting attributes are font name, font size, attributes such as bold, italic and underline, font and background color, paragraph alignment and much more.
es: De manera similar a cómo se anuncian controles, NVDA informa sobre muchos atributos de texto. De nuevo, esta información vuelve a ser rígida y es casi la misma tanto en voz como en braille. Algunos atributos de formato de ejemplo son el nombre de la fuente, tamaño de fuente, atributos como negrita, cursiva o subrayado, color de fuente y fondo, alineación de párrafo y muchos más.

source: We should consider allowing the user to customize the order of this information, and allow them to configure it separately for both speech and braille.
es: Debería plantearse la idea de permitir que el usuario personalice el orden de esta información, y permitir que lo configuren por separado para voz y braille.

source: ### Integrate NVDA with the windows magnifier
es: ### Integrar NVDA con la lupa de Windows

source: There are a number of NVDA users who use NVDA in conjunction with the [Magnifier built into Windows](https://support.microsoft.com/en-au/help/11542/windows-use-magnifier). We should consider a tighter integration between NVDA and the Windows Magnifier. Examples:
es: Hay un buen número de usuarios que utilizan NVDA junto con la [lupa incorporada en Windows](https://support.microsoft.com/en-au/help/11542/windows-use-magnifier). Debería plantearse la posibilidad de mejorar la inegración entre NVDA y la lupa de Windows. Ejemplos:

source: - Allow the user to configure all Magnifier settings directly from NVDA. This means they do not have to learn two different assistive programs, and their preferences can be saved in the same configuration.
es: - Permitir al usuario configurar todos los ajustes de la lupa desde NVDA. Esto significa que no tendrían que aprender a usar dos programas de asistencia, y sus preferencias podrían guardarse en la misma configuración.

source: - Synchronize the Magnifier with NVDA's focus / object navigation. I.e. if the user specifically navigates with NVDA, the Magnifier should follow along.
es: - Sincronizar la lupa con la navegación de NVDA por objetos o foco. Por ejemplo: si el usuario navega exclusivamente con NVDA, la lupa debería seguirlo.

source: - Learn from the innovative ideas in the free [Glassbrick](https://www.glassbrick.org/) magnifier, and ensure that NVDA can offer the same if not better interaction and configurability.
es: - Aprender de las ideas innovadoras del ampliador gratuito [Glassbrick](https://www.glassbrick.org/), y asegurarse de que NVDA puede ofrecer la misma o mejor interacción y configuración.
