Repository: bingen13/devguides_translation
Catalog: translations/*/LC_MESSAGES/guideLines.po
Languages: es

source: # Add-on guidelines #
es: # Pautas de complementos #

source: The following is a set of guidelines that current and potential add-on authors should use when writing add-ons:
es: En el siguiente documento se presenta un conjunto de pautas que deberían seguir tanto los desarrolladores actuales de complementos como aquellos que potencialmente pueden serlo:

source: 1. Use the addonTemplate from https://github.com/nvdaaddons/addonTemplate
es: 1. Usa la plantilla de complemento que se encuentra en https://github.com/nvdaaddons/addonTemplate

source: 2. Addon name should not contain "nvda", "plugin", "appmodule", "globalPlugin" as part of its name, the user should not have to worry about implementational issues.
es: 2. El nombre del complemento no debería contener palabras tales como "nvda", "plugin", "appmodule", "globalPlugin" en su composición, el usuario no debería tener que preocuparse de detalles de la implementación.

source: 3. Addon name should be of the form "name", or "firstSecond" or "first_second"
es: 3. El nombre del complemento debería tener la forma "nombre", o "primeroSegundo", o "primero_segundo"

source: examples: "word", "dropbox", "extendedWinamp", "resourceMonitor" or "resource_monitor". Dashes in names are currently not supported by the automated system.
es: ejemplos: "word", "dropbox", "extendedWinamp", "resourceMonitor" o "resource_monitor". El sistema automatizado no soporta guiones en el nombre.

source: 4. Make sure that your add-on is released under GPL license or an equivalent that is GPL compatible, as NVDA itself is GPL and add-ons are hosted by NVDA.
es: 4. Asegúrate de que tu complemento se libera bajo la licencia GPL o una equivalente compatible con ella, ya que el propio NVDA es GPL y el alojamiento de los complementos corre a cargo de NVDA.

source: ## Versioning ##
es: ## Versionado ##

source: 1. Use major dot minor revision, example: 1.0, 1.1 etc. A date-based versioning such as 2016.1 or 16.07 are also supported (termed continuous delivery).
es: 1. Usa el formato de revisión mayor punto menor, ejemplo: 1.0, 1.1, etc. Un versionado basado en fecha como 2016.1 o 16.07 también sirve (lo que se denomina una entrega continua).

source: 2. When new functionality is added, update major revision, i.e. 2.0, 3.0. For date-based version, designate a version as a major version.
es: 2. Cuando se añadan funciones nuevas, actualiza la revisión mayor: 2.0, 3.0, etc. Para versiones basadas en fecha, simplemente elige una como versión mayor.

source: 3. When making a release that has only translation updates, update the minor revision, 3.1, 3.2 etc. Making sure that the new languages are mensioned in a commit message. There is no need to add the new languages to the readme.md.
es: 3. Al liberar una versión que sólo incluya actualización de traducciones, actualiza la revisión menor: 3.1, 3.2, etc. Asegúrate de que los nuevos idiomas se mencionan en el mensaje de un commit. No hay necesidad de añadirlos al archivo readme.md.

source: 4. git tag the release, note special git push for tags.
es: 4. Añade un tag a cada versión en git, y recuerda que los cambios de tags (etiquetas) se envían de una forma especial al repositorio al hacer push.

source: ## Release process ##
es: ## Proceso de liberación ##

source: 1. After releasing an add-on version, if you know that you will be making changes to both old and new major versions, use a separate maintenance branch for the old version (e.g. 1.x, 2.x, etc.) with the maintenance release committed from the old version branch. Then merge the old changes to the new major version. If continuous delivery/date-based versioning is in use, perform development from master.
es: 1. Después de liberar la nueva versión de un complemento, si sabes que harás cambios a la nueva versión mayor y la anterior, usa una rama separada de mantenimiento para la versión vieja (1.x, 2.x, etc.) y manda tus commits a esta rama. Luego, mézclalos con la rama de la versión nueva. Si se usa un sistema de entrega continua o versiones basadas en fecha, realiza el desarrollo desde master.

source: 2. After making a stable release (and generating the add-on installation package), update the version to indicate that its under development for the next version, i.e. 3.1-dev. Note this means that the version number should only be 3.0 for a few minutes, and should be changed to 3.1-dev to indicate new development. The version number can be changed from 3.1-dev to 4.0-dev if/when new features are added.
es: 2. Después de crear una versión estable (y generar el paquete de instalación del complemento), actualiza el número de versión para indicar que está en desarrollo la siguiente versión, ejemplo: 3.1-dev. Por tanto, ten en cuenta que el número de versión en este caso debería ser 3.0 durante unos pocos minutos, y debería cambiarse a 3.1-dev para indicar que hay un desarrollo en curso.

source: 3. A stable release (such as 1.0, 2.0, 2.1, etc.) should be posted as a stable add-on, provided that there are no critical bugs reported within the past two weeks after the last commit. An add-on (or a version of an add-on) under active development and for which regular commits are made should be listed as a development add-on for testing by users.
es: 3. Una versión estable (tales como 1.0, 2.0, 2.1, etc.) debería publicarse como tal sólo si no se ha informado de fallos graves en las últimas dos semanas después del commit más reciente. Un complemento (o la versión de un complemento) bajo desarrollo activo y para el que se hacen commits regularmente debería listarse como un complemento en desarrollo para que los usuarios hagan pruebas.

source: 4. Stable releases should be made no closer than 2 weeks apart, to allow translators to do their work, unless fixing a chritical/showstopper bug.
es: 4. Las versiones estables no deben hacerse con menos de dos semanas de diferencia, para que los traductores puedan trabajar en ellas, a menos que se solucione un fallo crítico y de altísima prioridad.

source: 5. Announce the availibility of the new version on various NVDA mailing lists (e.g. NVDA add-ons list).
es: 5. Informa de la disponibilidad de esta nueva versión en distintas listas de correo de NVDA, como la lista de complementos.

source: 6. If possible, add-on authors should release the add-on and responsible for pulling in translations via translations workflow. For more information, see the [Make add-ons translatable](https://github.com/nvdaaddons/nvdaaddons.github.io/wiki/MakeAddonsTranslatable)) article.
es: 6. Si es posible, los creadores de complementos deberían utilizar el flujo de trabajo oficial de NVDA para gestionar sus traducciones. Para más información, consulta el artículo [hacer un complemento traducible mediante el sistema de traducciones de la comunidad](https://nvda.es/documentacion/desarrollo/desarrollo-de-complementos/hacer-un-complemento-traducible-mediante-el-sistema-de-traducciones-de-la-comunidad).

source: ## Coding Style ##
es: ## Estilo del código ##

source: 1. Indent with either 4 spaces or 1 tab. Tab-based indentation is strongly encouraged.
es: 1. Haz el indentado o bien con cuatro espacios, o con un tabulador. La segunda opción es la más recomendada.

source: 2. All messages presented to the user should be translatable (with some exceptions), if we are the creator of the message.
es: 2. Todos los mensajes presentados al usuario deberían ser traducibles (salvo excepciones), si somos los creadores del mensaje.

source: 3. Messages containing multiple '%s' or %'d' or are of the form
es: 3. Los mensajes que contengan varios comodines '%s' o '%d' o siguen el formato

source: "%(name)s .. %(name2)s" should be rewritten to _("{name1} .. {name2}").format(name1=v1, name2=v2)
es: "%(name)s .. %(name2)s" deberían reescribirse como _("{name1} .. {name2}").format(name1=v1, name2=v2)

source: 4. Translatable messages should have a translator comment to explain where/when the message is presented, so that the translator can test the message easily when s/he installs the addon. If the translatable string is similar to main NvDA messages, indicate this as well.
es: 4. Los mensajes traducibles deberían tener un comentario para traductores para explicar dónde o cuándo se presentarán al usuario, para que los traductores puedan probar el resultado de su traducción fácilmente al instalar el complemento. Si la cadena traducible es similar a alguna contenida en los mensajes principales de NVDA, indícalo también.

source: 5. If your addon needs to store any configuration:
es: 5. Si tu complemento necesita guardar cualquier ajuste de configuración:

source: - dont use:
es: - no uses:

source: - do use:
es: - usa en su lugar:

source: 6. Unless there is a good reason for it, it is recommended to use config.conf so add-on settings (particularly for global plugins) can be made available to configuration profiles.
es: 6. A menos que haya una buena razón para lo contrario, se recomienda usar config.conf para que los ajustes del complemento (especialmente si lleva extensiones globales) estén disponibles al usar perfiles de configuración.

source: 7. When working on a new or modifying a major feature, create/use branches other than master branch, as it helps merging and code review (via pull request) process and to find bugs easily.
es: 7. Cuando trabajes en una nueva característica importante o modifiques una existente, crea o utiliza ramas distintas a la rama master, ya que ayudan en el proceso de mezcla y revisión de código (a través de solicitudes de cambio) y a encontrar fallos fácilmente.

source: ## Documentation and key bindings ##
es: ## Documentación y órdenes de teclado ##

source: 1. If you are adding new keyboard commands as part of your add-on, be sure to consult NVDA Command Quick Reference and other community supported add-on commands before assigning a new command.
es: 1. Si añades nuevas órdenes de teclado como parte de tu complemento, consulta la referencia rápida de órdenes de NVDA y las órdenes de otros complementos oficiales de la comunidad antes de asignarlas.

source: 2. For NvDA 2013.3 or later: If you wish to categorize your keyboard bindings (for easier identification so the user can change it), either assign the same category as NVDA script categories (if your add-on enhances some parts of NVDA such as adding a shortcut to a preferences dialog) or create new categories if needed (if the add-on provides other features such as support for advanced features of a program).
es: 2. Para NVDA 2013.3 o posterior: si quieres categorizar tus órdenes de teclado (para una identificación más sencilla y que el usuario pueda cambiarlas), asigna una categoría existente en NVDA (si si tu complemento mejora partes de NVDA como una orden nueva para abrir un diálogo de preferencias), o bien crea nuevas categorías si es necesario (si el complemento ofrece otras características como el soporte para funciones avanzadas de un programa).

source: 3. Please provide a readme.md file listing changes between versions, shortcut keys (if any) and usage notes and other information, see one of the other git repos for examples.
es: 3. Por favor, ofrece un archivo readme.md en el que se listen los cambios entre versiones, atajos de teclado (si los hay), notas de uso y otra información relevante. Inspírate en cualquiera de los complementos oficiales ya existentes.

source: 4. Files addon/doc/*/readme.md should not be translated by hand and committed to the repository, but should be generated and committed from the translation system.
es: 4. Los archivos addon/doc/*/readme.md no deberían traducirse a mano y enviarse al repositorio, sino que deberían generarse y enviarse desde el sistema oficial de traducciones.

source: 5. If you translate an addon to your language and commit to git, please inform your nvda translation maintainer for your language so that work is not duplicated, in any case it is better to keep translations on the translation system.
es: 5. Si traduces un complemento a tu idioma y lo envías a Git, por favor notifícaselo al responsable de traducción de NVDA en tu idioma para que no se duplique el trabajo. En cualquier caso, siempre es mejor mantener las traducciones en el sistema oficial de traducciones.

source: ## Sharing and add-on reviews ##
es: ## Revisiones al compartir un complemento ##

source: 1. If you haven't, subscribe to NVDA Add-ons list located at Groups.IO.
es: 1. Si todavía no lo has hecho, suscríbete a la lista de complementos situada en groups.IO.

source: 2. Request a basic review (license and copyright, documentation, basic user experience, security, etc.). When doing so, be sure to provide the link to the add-on source code along with installers if any.
es: 2. Solicita una revisión básica (licencia y derechos de autor, documentación, experiencia de usuario básica, seguridad, etc.). Al hacerlo, asegúrate de proporcionar el enlace al código fuente del complemento, junto con instaladores, si los hay.

source: 3. If the basic review passes, you can declare the add-on stable or wait a while so you can work on addressing review comments before releasing a stable version. If you choose to wait, you have an option of releasing a development version for wider testing.
es: 3. Si se supera la revisión básica, puedes declarar el complemento estable o esperar un tiempo para resolver comentarios expuestos durante la revisión antes de liberar una versión estable. Si decides esperar, tienes la opción de liberar una versión de desarrollo para que se hagan pruebas más extensas.

source: 4. If the review does not pass, you are asked to address comments from reviewers. Once you address review comments, ask the reviewer to go over your add-on once more. This is done until the add-on passes basic review, and this is rare.
es: 4. Si la revisión no se supera, se te pedirá que sigas las instrucciones de los revisores. Una vez soluciones sus comentarios, pide a tu revisor que haga la revisión una vez más. Esto se hace hasta que el complemento supere la revisión básica, pero es extraño.

source: 5. If your add-on passes basic review, you have an option of asking for a more thorough review. These may involve looking at add-on messages, GUI widget toolkit compatibility, potential bugs and so on. It is up to you to respond to comments on thorough reviews and address them when you have time.
es: 5. Si tu complemento supera la revisión básica, puedes pedir una revisión más profunda. Esta implica mirar los mensajes del complemento, compatibilidad con los controles del motor de interfaz gráfica, fallos potenciales y demás. Es decisión tuya reaccionar a los comentarios de la revisión en profundidad y solucionarlos cuando tengas tiempo.
