Repository: bingen13/devguides_translation
Catalog: translations/*/LC_MESSAGES/internals.po
Languages: es

source: In order to make graphical widgets accessible to assistive technologies, operating systems and applications can use special purpose accessibility APIs. These APIs provide information about the widget such as its name, type/role (button, check box, editable text field, etc.), description, value, states (checked, unavailable, invisible, etc.) and keyboard shortcut. Accessibility APIs also provide events to allow assistive technologies to monitor changes, such as when the focus changes, properties of an object (such as name, description, value, and state) change, etc. Rich accessibility APIs provide additional information, including the ability to access detailed information about and track the cursor in editable text controls, and table information such as row and column coordinates. NVDA relies heavily on accessibility APIs to gather information. Several accessibility APIs are used, including Microsoft Active Accessibility (MSAA) (also known as IAccessible), [IAccessible2](http://www.linuxfoundation.org/en/Accessibility/IAccessible2), Java Access Bridge and UI Automation.
es: Para hacer accesibles los widgets gráficos a las tecnologías de asistencia, las aplicaciones y los sistemas operativos pueden usar apis específicas de accesibilidad. Estas apis ofrecen información sobre el widget tal como su nombre, tipo/rol (botón, casilla de verificación, campo de texto editable, etc.), descripción, valor, estados (marcado, no disponible, invisible, etc.) y atajo de teclado. Las apis de accesibilidad también ofrecen eventos para permitir a las tecnologías de asistencia monitorizar cambios, tales como los cambios de foco, de propiedades de un objeto (tales como nombre, descripción, valor y estado), etc. Las apis de accesibilidad enriquecida ofrecen información adicional, incluyendo la capacidad de acceder a detalles de los campos de texto editables y seguir la posición del cursor, o conocer en una tabla las coordenadas de fila y columna. NVDA se apoya en las apis de accesibilidad para recopilar información. Se usan varias apis de accesibilidad, incluyendo Microsoft Active Accessibility (MSAA, también llamada IAccessible), [IAccessible2](http://www.linuxfoundation.org/en/Accessibility/IAccessible2), Java Access Bridge y UI Automation.

source: ### Native APIs
es: ### Apis nativas

source: Some widgets do not expose sufficient information via accessibility APIs to make them fully accessible. For example, MSAA, which is the accessibility API used by most standard Windows controls, does not provide the ability to obtain the location of the cursor or retrieve individual units of text in editable text fields. However, some widgets provide their own native APIs (not specific to accessibility) which can be used to obtain this information. NVDA makes use of these APIs where possible; e.g. in standard edit controls.
es: Algunos widgets no exponen información suficiente a las apis de accesibilidad para ser completamente accesibles. Por ejemplo, MSAA, que es la api de accesibilidad usada por la mayoría de controles estándar, no ofrece la posibilidad de obtener la ubicación del cursor o recuperar unidades individuales de texto en campos de texto editable. Sin embargo, algunos widgets ofrecen sus propias apis nativas (no específicas para accesibilidad) que pueden usarse para obtener esta información. NVDA hace uso de estas apis cuando es posible; por ejemplo en campos de edición estándar.

source: ### Operating System Functions
es: ### Funciones del sistema operativo

source: Aside from accessibility and native APIs, Windows provides many functions which can be used to obtain information and perform tasks. Information that can be obtained includes the class name of a window, the current foreground window and system battery status. Tasks that can be performed include moving/clicking the mouse and sending key presses.
es: Además de apis nativas y de accesibilidad, Windows ofrece muchas funciones que pueden usarse para obtener información y realizar tareas. La información que puede obtenerse incluye el nombre de clase de una ventana, la ventana actual en primer plano o el estado de la batería del sistema. Entre las tareas que pueden hacerse están mover el ratón o hacer clic con él y enviar pulsaciones de teclado.

source: ## NVDA Components
es: ## Componentes de NVDA

source: NVDA is built with an extensible, modular, object oriented, abstract design. It is divided into several distinct components.
es: NVDA ha sido construido con un diseño extensible, modular, abstracto y orientado a objetos. Está dividido en muchos componentes distintos.

source: ### Launcher
es: ### Lanzador

source: The launcher is the module which the user executes to start NVDA. It is contained in the file `nvda.pyw` (`nvda.exe` or variations for binary builds). It handles command line arguments, performs some basic initialisation and starts the [#Core core] (unless NVDA is already running or a command line option specifies otherwise).
es: El lanzador es el módulo que el usuario ejecuta para iniciar NVDA. Se encuentra en el archivo `nvda.pyw` (`nvda.exe` o variantes en versiones binarias). Este módulo procesa los argumentos de la línea de órdenes, realiza una inicialización básica e inicia el núcleo (a menos que NVDA ya esté ejecutándose o una opción de la línea de órdenes especifique lo contrario).

source: ### Core
es: ### Núcleo

source: The core (in the function `core.main`) loads the configuration, initialises all other components and then enters the main loop.
es: El núcleo (en la función `core.main`) carga la configuración, inicializa todos los demás componentes y entra en el bucle principal.

source: The initialization steps in `core.main` are thus:
es: Por lo tanto, los pasos de inicialización en `core.main` son:

source: 1. Obtains the configuration file path and the name for the initial configuration file unless overridden from the command line.
es: 1. Se obtiene la ruta al archivo de configuración y el nombre del archivo de configuración inicial, a menos que ya se especifique en la línea de órdenes.

source: 2. Initializes configuration management subsystem (`config.initialize`).
es: 2. Se inicializa el subsistema de administración de configuración (`config.initialize`).

source: 3. Unless silenced by the user, NVDA's startup sound is played unless minimal initialization option is specified in the command line.
es: 3. A menos que el usuario lo silencie, se reproduce el sonido de inicio de NVDA si la opción de inicialización mínima no se especifica en la línea de órdenes.

source: 4. Obtains following information:
es: 4. Se obtiene la siguiente información:

source: * Log level as defined by the user unless a predefined log level is specified in the command line.
es: * Nivel de registro tal y como lo ha definido el usuario, a no ser que se especifique en la línea de órdenes un nivel de registro predefinido.

source: * Language (either a specific language or the language used by the Windows operating system).
es: * Idioma (ya sea específico o el que usa Windows por defecto).

source: * Version information for NVDA, Python, Windows and COMTypes package.
es: * Información de versión de NVDA, Python, Windows y el paquete ComTypes.

source: 5. Loads add-ons (by default, they live in addons folder in user configuration folder). One of the jobs of this routine is to see if the user told NVDA to disable add-ons.
es: 5. Se cargan los complementos (por defecto, se encuentran en la carpeta addons en el directorio de configuración de usuario). Uno de los trabajos que se hacen en esta parte es comprobar si el usuario ha indicado que se desactiven los complementos.

source: 6. Next, NVDA continues by initializing app module handler, NvDA Helper and speech components including speech dictionaries.
es: 6. A continuación, NVDA inicializa el manejador de módulos de aplicación, NVDA Helper y los componentes de voz incluyendo los diccionarios.

source: 7. If it took NVDA five seconds or more to initialize components, this fact is recorded and the user will hear, "Loading NVDA, please wait".
es: 7. Si la inicialización de componentes tarda más de cinco segundos, se registra este hecho y se verbaliza la frase "Cargando NVDA. Espera por favor".

source: 8. Next, wxPython, braille support (including braille input module), display model and GUI subsystem are prepared.
es: 8. Después WXPython, el soporte braille (incluyendo el módulo de entrada braille), el modelo de pantalla y el subsistema gráfico se preparan.

source: 9. Localization support preparation is next, preparing NVDA to display its interface in the configured language.
es: 9. El soporte de idiomas va después, preparando a NVDA para que muestre su interfaz en el idioma adecuado.

source: 10. The NVDA API module is initialized, including setting initial focus, mouse and other objects.
es: 10. Se inicializa el módulo api de NVDA. Aquí se incluye el establecimiento inicial del foco, el ratón y otros objetos.

source: 11. NvDA then initializes various modules for accessibility API's. In case of Java Access Bridge (JAB) and UI Automation (UIA), relevant checks are performed at this time (for example, making sure the user is running Windows 7 or later when initializing UIA support).
es: 11. NVDA inicializa módulos para distintas apis de accesibilidad. En el caso de Java Access Bridge (JAB) o UI Automation (UIA), se realizan varias comprobaciones en este paso (por ejemplo, se comprueba que el usuario tiene Windows 7 o posterior antes de iniciar el soporte UIA).

source: 12. Next, input support modules are initialized, including the input core itself and modules supporting input from keyboards, mice and touchscreens (if one is installed on a computer running Windows 8 and later).
es: 12. Se inicializan los módulos de soporte de entrada, incluyendo el módulo inputCore y los módulos que soportan la entrada desde teclados, ratones y pantallas táctiles (si el ordenador tiene Windows 8 o posterior y alguna pantalla instalada).

source: 13. Lastly, global plugin handler and global plugins are initialized. With this step complete, basic NVDA features such as GUI support are ready for action.
es: 13. Finalmente, se inicializa el manejador de extensiones globales y las propias extensiones. Con este paso completado, las características básicas de NVDA como por ejemplo el soporte GUI están listas para la acción.

source: 14. Depending on command line options, configuration values and circumstances such as installing silently, NVDA will perform appropriate action such as displaying the welcome dialog, performing automatic update check and so on.
es: 14. Dependiendo de las opciones de la línea de órdenes, valores de configuración y circunstancias como la instalación silenciosa, NVDA realizará las acciones adecuadas: mostrar el diálogo de bienvenida, comprobar automáticamente si hay actualizaciones, etc.

source: The main loop keeps looping until NVDA is instructed to exit. IN each iteration/tick, the core pumps the [#APIHandlers API] and [#InputHandlers input] handlers, [#RegisteredGenerators registered generators] and the main queue. All events, scripts, etc. are indirectly queued to this main queue by API and input handlers, so pumping the main queue causes these to be executed. The main loop is what "drives" NVDA or makes it "tick".
es: El bucle principal se mantiene iterando hasta que NVDA recibe la orden de salir. En cada iteración o ciclo, el núcleo llama a los manejadores de api y entrada, a los generadores registrados y a la cola principal. Todos los eventos, scripts, etc. llegan indirectamente a la cola principal a través de los manejadores de api y entrada, por lo que al llamar a esta cola hacemos que se ejecuten. El bucle principal es lo que le da vida a NVDA.

source: Once NVDA is instructed to exit, the core terminates all other components, saves the configuration if appropriate and then exits. The details steps are as follows:
es: Una vez NVDA recibe la orden de salir, el núcleo hace finalizar a todos los demás componentes, guarda la configuración si debe hacerlo y después sale. Los pasos detallados son los siguientes:

source: 1. If update check is in progress, tells update check to quit.
es: 1. Si la comprobación de actualizaciones está en proceso, se le ordena terminar.

source: 2. NVDA then terminates watchdog (NVDA core monitor), global plugin support (along with global plugins if any), GUI subsystem and saves user settings if told to do so.
es: 2. Se finaliza watchdog (el monitor del núcleo), el soporte de extensiones globales (junto con las extensiones si hay alguna), el subsistema gráfico y se guarda la configuración de usuario si hay que hacerlo.

source: 3. If focus is located on a control, NVDA is instructed to call lose focus event on this control.
es: 3. Si el foco está ubicado en un control, NVDA llama al evento loseFocus en este control.

source: 4. NVDA continues by terminating various subsystems, starting with tree interceptor handler, accessibility API support, app module handler and various app modules, input handlers, speech and braille support and add-on handler.
es: 4. NVDA finaliza varios subsistemas, empezando por el manejador de interceptores de árbol, el soporte de apis de accesibilidad, manejador de módulos de aplicación y sus módulos cargados, manejadores de entrada, soporte de voz y braille, y manejador de complementos.

source: 5. Lastly, unless explicitly silenced, NVDA shutdown sound is played, and the message window is destroyed.
es: 5. Finalmente, a menos que haya sido silenciado explícitamente, se reproduce el sonido de cierre de NVDA y se destruye la ventana de mensajes.

source: #### Event and Script Handling
es: #### Procesamiento de scripts y entrada

source: Rather than queuing scripts and events directly to the main queue, this is abstracted using the `eventHandler` and `scriptHandler` modules. Input and API handlers use these modules to queue or directly execute scripts and events.
es: En vez de poner los eventos y los scripts directamente en la cola, esto se abstrae mediante los módulos `eventHandler` y `scriptHandler`. Los manejadores de api y entrada usan estos módulos para poner en la cola o ejecutar directamente estos eventos y scripts.

source: #### Registered Generators
es: #### Generadores registrados

source: Some tasks need to run in the background without causing NVDA to block (freeze) while waiting for them to complete. They need to execute code regularly, but at no specific time interval. NVDA allows Python generator functions to be registered for this purpose. Once registered, the generator will be pumped once for each iteration/tick of the main loop. Examples of this include the say all and speak spelling functionality. They are registered using `queueHandler.registerGeneratorObject`.
es: Algunas tareas necesitan ejecutarse en segundo plano sin causar que NVDA se bloquee (cuelgue) mientras espera a que estas tareas se completen. Necesitan ejecutar código regularmente, pero no en un intervalo de tiempo concreto. NVDA permite registrar funciones generadoras de Python con este propósito. Una vez registradas, se ejecutarán una vez en cada ciclo o iteración del bucle principal. Algunos ejemplos de esto son las funciones de verbalizar todo o deletrear. Se registran llamando a `queueHandler.registerGeneratorObject`.

source: ### Input Handlers
es: ### Manejadores de entrada

source: The input handlers handle input from various sources. Currently, there are three main input handler modules: `keyboardHandler`, `mouseHandler` and `touchHandler`. [#OutputDrivers Braille display drivers] can also handle input. These handlers listen for input and generate appropriate [#InputGestures input gestures] and events.
es: Los manejadores de entrada gestionan la entrada desde distintas fuentes. Actualmente, hay tres módulos principales de entrada: `keyboardHandler`, `mouseHandler` y `touchHandler`. Los controladores de pantallas braille también pueden procesar la entrada. Estos manejadores escuchan la entrada y generan gestos de entrada y eventos según corresponda.

source: ### Input Gestures
es: ### Gestos de entrada

source: An input gesture is an abstract representation of a single piece of input from the user; e.g. a key press. All input gestures derive from the base `inputCore.InputGesture` class. This allows all input to be handled in a consistent, unified way. For example, any input gesture can be bound to any script, both in code and by the user.
es: Un gesto de entrada es una representación abstracta de una unidad mínima de entrada por parte del usuario; por ejemplo, la pulsación de una tecla. Todos los gestos de entrada heredan de la clase base `inputCore.InputGesture`. Esto permite procesar toda la entrada de una manera consistente y unificada. Por ejemplo, cualquier gesto de entrada puede asociarse a cualquier script, tanto mediante código como por el propio usuario.

source: ### API Handlers
es: ### Manejadores de api

source: These handle initialisation, listening for events and termination for specific accessibility and native APIs. They also contain utility functions useful for working with their API. When an event is received for a widget, an appropriate [#NVDAObjects NVDA object] is fetched or constructed and an event is then queued for that NVDA object. Together with [#NVDAObjects NVDA objects], they abstract the handling of queries and events for specific APIs so that the bulk of NVDA need not be concerned with specific APIs. To introduce support for a new API, a developer just creates another API handler and appropriate NVDA objects without needing to change the majority of the code. API handler modules include `IAccessibleHandler` for MSAA/IAccessible and IAccessible2, `JABHandler` for Java Access Bridge and `UIAHandler` for UI Automation.
es: Los manejadores de api administran la inicialización, finalización y escucha de eventos en apis nativas y específicas de accesibilidad. También contienen funciones útiles para trabajar con su api. Cuando se recibe un evento para un widget, se construye o recupera un objeto NVDA adecuado y el evento se mete en la cola para ese objeto. Además de los objetos NVDA, también abstraen el manejo de eventos y consultas para apis específicas, por lo que el resto de módulos no necesitan conocer los detalles internos de cada api. Para introducir soporte para una nueva api, el desarrollador simplemente crea otro manejador de api y objetos NVDA adecuados sin necesidad de cambiar la mayoría del código. Los módulos manejadores de api incluyen `IAccessibleHandler` para MSAA/IAccessible e IAccessible2, `JABHandler` para Java Access Bridge y `UIAHandler` para UI Automation.

source: ### Output Modules
es: ### Módulos de salida

source: Separate modules encapsulate the handling of output functionality. Currently, there are two main output modules: `speech` and `braille`. There is also the `tones` module, which is used to output tones/beeps, and `nvWave` module used to play wave files indicating specific events.
es: Distintos módulos encapsulan el manejo de la funcionalidad de salida. Hay actualmente dos módulos principales: `speech` y `braille`. También está el módulo `tones`, que se usa para reproducir tonos o pitidos, y el módulo `nvWave`, usado para reproducir archivos de sonido wav ante ciertos eventos.

source: For most cases, speech and braille will output similar texts. To facilitate this, a dedicated user interface (ui) module is provided to speak and/or braille a message. This function (`ui.message`) calls `speech.speakMessage` and `braille.handler.message` functions.
es: En la mayoría de casos, la síntesis de voz y el braille emitirán el mismo texto de salida. Para facilitar esta tarea, se ofrece un módulo con una interfaz de usuario dedicada (ui) para enviar un mensaje por voz y/o braille. La función `ui.message` llama a las funciones `speech.speakMessage` y `braille.handler.message`.

source: ### Output Drivers
es: ### Controladores de salida

source: Synth drivers are drivers to allow NVDA to utilise particular speech synthesisers. They are derived from the `synthDriverHandler.SynthDriver` base class.
es: Los controladores de sintetizador permiten que NVDA utilice distintos sintetizadores de voz. Heredan de la clase base `synthDriverHandler.SynthDriver`.

source: Braille display drivers are drivers to allow NVDA to utilise particular braille displays. They are derived from the `braille.BrailleDisplayDriver` base class.
es: Los controladores de pantallas braille permiten que NVDA utilice modelos específicos de estos dispositivos. Heredan de la clase base `braille.BrailleDisplayDriver`.

source: ### NVDA Objects
es: ### Objetos NVDA

source: An NVDA object (NVDAObject) is an abstract representation of a single widget in NVDA. All NVDA objects derive from the base `NVDAObjects.NVDAObject` class. Methods and properties are used to query information about, handle events from and execute actions on the widget represented by the NVDA object in an abstract way. This means that the bulk of NVDA need not be concerned with specific accessibility or native APIs, but can instead work with a single, abstract representation. This allows for the seemless support and integration of many vastly different APIs.
es: Un objeto NVDA (NVDAObject) es una representación abstracta de un widget único en NVDA. Todos los objetos NVDA heredan de la clase base `NVDAObjects.NVDAObject`. Los métodos y propiedades se usan para consultar información, capturar eventos o ejecutar acciones en el widget representado por el objeto NVDA de una forma abstracta. Esto significa que la implementación de NVDA no tiene que estar atada a apis nativas o de accesibilidad, sino que puede trabajar con una representación única y abstracta. Esto permite integrar y dar soporte a muchas apis diferentes.

source: It is here that the full power of object oriented programming is used. Many methods are implemented on the base `NVDAObject` class and only need to be overridden if specific functionality is required. Similarly, if a particular widget is non-standard, problematic, provides additional information using other mechanisms, etc., it can simply subclass another NVDA object and override methods as appropriate.
es: Aquí es donde se usa todo el potencial de la programación orientada a objetos. Muchos métodos se implementan en la clase base `NVDAObject`, y sólo es necesario redefinirlos si se requiere funcionalidad específica. De forma similar, si un widget en particular no es estándar, problemático, ofrece información usando otros mecanismos, etc., simplemente se hace una subclase de NVDAObject y se sobreescriben los métodos que correspondan.

source: NVDA objects that might be used in any application are contained in the NVDAObjects package. [#AppModules App modules] may also define NVDA objects specific to an application.
es: Los objetos NVDA que podrían usarse en cualquier aplicación se encuentran en el paquete NVDAObjects. Los módulos de aplicación también pueden definir objetos NVDA específicos para una aplicación.

source: ### Text Ranges
es: ### Rangos de texto
