Repository: bingen13/devguides_translation
Catalog: translations/*/LC_MESSAGES/internals.po
Languages: es

source: When working with editable text controls, NVDA needs to be able to obtain information about the text in the widget. Aside from just retrieving the entire text, proper navigation requires retrieval of specific units of text (e.g. paragraphs, lines, words and characters), as well as the ability to find and set the location of the caret and selection. Also, if the widget supports formatting, NVDA should be able to retrieve text attributes such as font name, size, bold, italic, underline and whether there is a spelling error. Each API provides a different way of querying and manipulating text. Just as NVDA objects provide an abstract representation of a widget, TextInfo objects provide an abstract representation of a range of text. These objects are derived from the `textInfos.TextInfo` base class.
es: Al trabajar con controles de texto editable, NVDA debe ser capaz de obtener información sobre el texto en el widget. En vez de recuperar todo el texto simplemente, para una navegación adecuada se necesitan recuperar unidades específicas de texto (párrafos, líneas, palabras y letras), así como la habilidad de buscar y establecer la ubicación del caret y la selección. También, si el widget soporta formato, NVDA debería ser capaz de recuperar atributos del texto tales como nombre de la fuente, tamaño, negrita, cursiva, subrayado y si hay un error ortográfico. Cada api tiene su forma particular de consultar y manipular texto. Al igual que los objetos NVDA ofrecen una representación abstracta de un widget, los objetos TextInfo ofrecen una representación abstracta de un rango de texto. Estos objetos heredan de la clase base `textInfos.TextInfo`.

source: ### Global Commands
es: ### Órdenes globales

source: The global commands object (`globalCommands.GlobalCommands`) contains built-in global scripts; i.e. they can be executed everywhere. For example, the review, report current focus and date/time scripts are all located in global commands.
es: El objeto de órdenes globales (`globalCommands.GlobalCommands`) contiene scripts integrados; pueden ejecutarse en todas partes. Por ejemplo, los scripts de revisar, verbalizar objeto bajo el foco o anunciar la hora y la fecha están todos ubicados ahí.

source: ### Plugins
es: ### Extensiones

source: NvDA allows third-parties to extend NvDA's functionality through plugins and add-ons. These may define custom NVDA objects for specific applications, add global features and add support for new braille displays and speech synthesizers. There are three plugin types: appModules, globalPlugins and drivers, with drivers further divided between speech synthesizer and braille display support.
es: NVDA permite a terceros extender su funcionalidad mediante extensiones y complementos. Estos pueden definir objetos NVDA específicos para ciertas aplicaciones, agregar características globales o añadir soporte para nuevas pantallas braille y sintetizadores de voz. Hay tres tipos de extensiones: módulos de aplicación, extensiones globales y controladores, donde estos últimos se dividen en a su vez en sintetizadores de voz y soporte para pantallas braille.

source: #### App Modules
es: #### Módulos de aplicación

source: Generally, most widgets may appear in any application and an [#NVDAObjects NVDA object] should therefore be included in the main `NVDAObjects` package. However, there are sometimes cases where a widget is implemented specifically for one application, as well as cases where a single event must be overridden or a script must be provided only in one application. An app module provides support specific to an application for these cases.
es: Generalmente, la mayoría de widgets pueden aparecer en una aplicación y por tanto se debería incluir un nuevo objeto NVDA en el paquete principal `NVDAObjects`. Sin embargo, algunas veces se dan casos en los que se implementa un widget específicamente para una aplicación, como también hay casos donde debe sobreescribirse un único evento u ofrecerse un script sólo en una aplicación. Un módulo de aplicación da soporte específico para una aplicación en estos casos.

source: An app module is derived from the `appModuleHandler.AppModule` base class. App modules receive events for all [#NVDAObjects NVDA objects] in the application and can bind scripts which can be executed anywhere in that application. They can also implement their own NVDA objects for use within the application.
es: Un módulo de aplicación hereda de la clase base `appModuleHandler.AppModule`. Los módulos de aplicación reciben eventos para todos los objetos NVDA que hay en la aplicación y pueden asociar scripts que pueden ejecutarse en cualquier zona de esa aplicación. También pueden implementar sus propios objetos NVDA para usarlos en el contexto de la aplicación.

source: #### Global Plugins
es: #### Extensiones globales

source: Aside from application specific customisation using [#AppModules app modules], it is also possible to extend NVDA on a global level. For example, new global commands can be added, behaviour can be changed and new GUI toolkits can be supported. This can be done using global plugins.
es: Además de la personalización específica de aplicaciones usando módulos de aplicación, es posible extender NVDA a nivel global. Por ejemplo, pueden añadirse nuevas órdenes globales, cambios de comportamiento, soporte para nuevos motores gráficos, etc. Esto puede hacerse con extensiones globales.

source: A global plugin is derived from the `globalPluginHandler.GlobalPlugin` base class. Similar to [#GlobalCommands global commands], they can bind scripts which can be executed everywhere. They can also implement their own global [#NVDAObjects NVDA Objects].
es: Una extensión global hereda de la clase base `globalPluginHandler.GlobalPlugin`. De forma similar a las órdenes globales, pueden asociar scripts que pueden ejecutarse en todas partes. También pueden implementar sus propios objetos NVDA.

source: ### Tree Interceptors
es: ### Interceptores de árbol

source: Sometimes, it is necessary to intercept events and scripts for an entire hierarchy (or tree) of [#NVDAObjects NVDA objects]. For example, this is necessary to seemlessly handle complex documents which consist of many objects. This can be done using a tree interceptor.
es: En ocasiones, es necesario interceptar eventos y scripts para una jerarquía entera (o árbol) de objetos NVDA. Por ejemplo, esto es necesario para trabajar con documentos complejos que están formados por muchos objetos. Esto puede hacerse usando un interceptor de árbol.

source: A tree interceptor (TreeInterceptor) is derived from the `treeInterceptorHandler.TreeInterceptor` base class. It receives events and scripts for all [#NVDAObjects NVDA objects] beneath and including the root NVDA object. Tree interceptors are created when a TreeInterceptor class is returned from the `treeInterceptorClass` property of an NVDA object.
es: Un interceptor de árbol (TreeInterceptor) hereda de la clase base `treeInterceptorHandler.TreeInterceptor`. Recibe scripts y eventos para todos los objetos NVDA que incluye, también para el objeto raíz. Los interceptores de árbol se crean cuando se devuelve la clase TreeInterceptor en la propiedad `treeInterceptorClass` de un objeto NVDA.

source: ### Virtual Buffers
es: ### Buffers virtuales

source: Complex documents such as web pages are very often not flat; i.e. information does not simply run from top to bottom. Because of this, complex document browsers often do not provide a way to navigate documents using the caret, and even when they do, it is often problematic. Therefore, screen readers need to create their own flat representation of a document from the object hierarchy provided by the browser and allow the user to navigate this flat representation. NVDA calls these virtual buffers. Due to the extreme slowness of performing large numbers of [#Out-of-processCode out-of-process] queries, NVDA creates these with the help of [#In-processCode in-process code].
es: Los documentos complejos tales como páginas web con mucha frecuencia no son planos; la información no va de arriba hacia abajo. Por este motivo, los exploradores de documentos complejos no ofrecen frecuentemente una manera de navegar por ellos usando el caret, e incluso cuando lo hacen, suele dar problemas. Por tanto, los lectores de pantalla necesitan crear una representación plana de un documento a partir de la jerarquía de objetos ofrecida por el navegador, y permitir al usuario navegar por esta representación plana. NVDA llama a esto buffers virtuales. Debido a la extrema lentitud al hacer un gran número de consultas fuera de proceso, NVDA los crea con la ayuda de código dentro del proceso.

source: A virtual buffer (VirtualBuffer) in NVDA is derived from the `virtualBuffers.VirtualBuffer` base class and is a type of [#TreeInterceptors tree interceptor].
es: Un buffer virtual (VirtualBuffer) en NVDA hereda de la clase base `virtualBuffers.VirtualBuffer` y es un tipo de interceptor de árbol.

source: NVDA has its own graphical user interface to allow for easy configuration and other user interaction. This code is primarily contained in the `gui` package. [wxPython](http://www.wxpython.org/) is used as the GUI toolkit.
es: NVDA dispone de su propia interfaz gráfica para facilitar el proceso de configuración y otras interacciones del usuario. Su código está principalmente dentro del paquete `gui`. Se usa [wxPython](http://www.wxpython.org/) como motor gráfico.

source: ## Special Object Functions
es: ## Funciones especiales de objetos

source: ### Events
es: ### Eventos

source: NVDA object, app module and virtual buffer instances can all contain special methods which handle events for NVDA Objects. These methods are all named beginning with "event_"; e.g. `event_gainFocus` and `event_nameChange`. These events are generally executed by a call to `eventHandler.executeEvent`, which is in turn generally called resultant to events queued by [#APIHandlers API Handlers]. Most events do not take any additional arguments. App modules and virtual buffers are passed a handler function which should be called if the event should be handled by the next handler; e.g. the object itself.
es: Todas las instancias de NVDAObject, AppModule y VirtualBuffer pueden contener métodos especiales que capturan eventos para objetos NVDA. Todos estos métodos se nombran empezando por "event_"; por ejemplo `event_gainFocus` y `event_nameChange`. Estos eventos son generalmente ejecutados en una llamada a `eventHandler.executeEvent`, realizada generalmente en los eventos en cola puestos por los manejadores de api. La mayoría de eventos no necesitan argumentos adicionales. Los módulos de aplicación y buffers virtuales reciben una función manejadora a la que debería llamarse si queremos que el evento capturado sea procesado por el siguiente manejador de eventos; por ejemplo, el objeto en sí mismo.

source: NVDA object, app module and virtual buffer instances can all contain special methods called scripts which are executed in response to [#InputGestures input gestures] from the user. These methods are all named beginning with "script_"; e.g. `script_reportCurrentFocus` and `script_dateTime`. Script methods are passed the input gesture that triggered them.
es: Todas las instancias de NVDAObject, AppModule y VirtualBuffer pueden contener métodos especiales llamados scripts, que se ejecutan como respuesta a gestos de entrada por parte del usuario. Todos estos métodos se nombran comenzando con "script_"; por ejemplo `script_reportCurrentFocus` y `script_dateTime`. Los métodos de tipo script reciben como argumento el gesto de entrada que los llamó.

source: Input gestures are bound to scripts in the class using a `__gestures` dict. They can also be bound at runtime using `bindGesture`. These are inherited from `baseObject.ScriptableObject`.
es: Los gestos de entrada se asocian a los scripts en la clase usando un diccionario llamado `__gestures`. También pueden asociarse en tiempo de ejecución llamando a `bindGesture`. Estos métodos se heredan de la clase `baseObject.ScriptableObject`.

source: ## Inter-process Communication
es: ## Comunicación interproceso

source: In general terms, every running application or service on a computer, including NVDA, is a separate process. No process can access data in another process except via special operating system mechanisms. This is called inter-process communication (IPC).
es: En términos generales, cada aplicación o servicio en un ordenador, incluyendo NVDA, constituye un proceso independiente. Ningún proceso puede acceder a datos de otro proceso salvo si usa mecanismos especiales del sistema operativo. Esto se llama comunicación interproceso (IPC).

source: ### Out-of-process Code
es: ### Código fuera del proceso

source: NVDA functions primarily out-of-process. That is, events and queries for information from other processes must be marshalled (communicated) between NVDA and the process in question using IPC. This is many times slower than queries and events managed in the same process. However, for the majority of screen reader functionality, this performance hit is insignificant.
es: NVDA funciona principalmente fuera de los procesos. Esto significa que los eventos y consultas de información de otros procesos deben fluir por un canal de comunicaciones entre NVDA y el proceso en cuestión usando IPC. Muchas veces esto es más lento que las consultas y eventos administradas en el propio proceso. Sin embargo, para la mayoría de funciones del lector de pantalla, la pérdida de rendimiento es insignificante.

source: ### In-process Code
es: ### Código dentro del proceso

source: When large numbers of queries need to be made in one hit, working [#Out-of-processCode out-of-process] is far too slow. A noteworthy example is rendering a web page into a flat representation, as is done by [#VirtualBuffers virtual buffers]. In these cases, code can be "injected" into the remote process. Because this code is running in the same process, queries and events are much faster, as they do not have to be marshalled between processes, which means that large numbers of queries are quite fast. NVDA can then perform single out-of-process queries for relevant information.
es: Cuando es necesario hacer un gran número de consultas de golpe, trabajar fuera del proceso es demasiado lento. Un ejemplo típico es el renderizado de una página web en una representación plana, tal y como hacen los buffers virtuales. En estos casos, el código puede "inyectarse" en el proceso remoto. Como el código inyectado está en el proceso en cuestión, las consultas y eventos son mucho más rápidos, ya que no hay que usar comunicación interproceso. Esto significa que se pueden hacer muchas consultas de golpe más rápido. NVDA puede realizar entonces consultas únicas desde fuera del proceso y obtener información relevante.

source: In-process code must be small and light-weight, as it is being injected into other processes. It must also be as fast as possible to allow for maximum performance. Python is unsuitable for this task. All of NVDA's in-process code is written in C++, which allows for maximum performance and minimal overhead.
es: El código dentro del proceso debe ser pequeño y ligero, ya que se inyecta en otros procesos. También debe ser tan rápido como sea posible para garantizar el máximo rendimiento. Python no es adecuado para esta tarea. Todo el código de NVDA que se inyecta en los procesos está escrito en C++, que garantiza un rendimiento máximo y sobrecarga mínima.
