Repository: bingen13/devguides_translation
Catalog: translations/*/LC_MESSAGES/internals.po
Languages: es

source: # NVDA feature internals
es: # Características internas de NVDA

source: This article is designed to give users and developers a tour of internals of various features of NVDA. Thus, it is important to have some knowledge of NVDA itself, Python, C++ and programming concepts to follow this article.
es: Este artículo está diseñado para ofrecer a los usuarios y desarrolladores un recorrido por el interior de algunas características de NVDA. Por tanto, es importante tener algunos conocimientos de Python, C++, conceptos generales de programación y NVDA en sí mismo para seguirlo.

source: Note: This article is directly based on (and is an enhanced version of) the design overview document found in NVDA Community website. Parts of this article are based on NVDA User Guide.
es: Nota: este artículo está basado en el documento de descripción del diseño que se encuentra en un sitio web, y es una versión mejorada del mismo. Parte de los contenidos de este documento provienen de la guía de usuario.

source: ## Introduction
es: ## Introducción

source: ### About NVDA
es: ### Acerca de NVDA

source: NVDA (Nonvisual Desktop Access) is a free, open-source, community-driven screen reader for Microsoft Windows. This modular, highly extensible screen reader provides all the features expected from screen readers, such as accepting keyboard input to perform various tasks, displaying a rich set of configuration options, responding to events and so on.
es: NVDA (acceso no visual a ordenadores de escritorio (Non Visual Desktop Access)) es un lector de pantalla gratuito, de código abierto y dirigido por la comunidad para Microsoft Windows. Este lector de pantalla modular y altamente extensible ofrece todas las funciones que se espera de un lector de pantalla, tales como aceptar entrada por teclado para realizar ciertas tareas, mostrar un rico y variado conjunto de opciones de configuración, responder a eventos, etc.

source: ### Audience
es: ### Audiencia

source: As this is an article on feature internals, we will assume that you meet the following prerequisites:
es: Ya que este es un artículo que habla de características internas, se asumirá que cumples los siguientes requisitos previos:

source: - You are a user of NVDA and curious about how things work.
es: - Eres un usuario de NVDA y tienes curiosidad por saber cómo funciona.

source: - You have some experience with programming and are familiar with C++ and Python.
es: - Tienes alguna experiencia programando y conocimientos en C++ y Python.

source: - You would like to contribute your expertise but don't know where to start and how NVDA performs its job.
es: - Quieres contribuir con tus conocimientos pero no sabes por dónde empezar ni cómo hace su trabajo NVDA.

source: - You are a new or a seasoned NVDA add-on writer and like to dive deeper into NVDA internals.
es: - Eres nuevo o tienes experiencia escribiendo complementos y quieres conocer el funcionamiento interno de NVDA.

source: ### Article structure
es: ### Estructura del artículo

source: It might be pointless to talk about internals of a complex software system such as NVDA without having something we can follow. As such, we'll start by letting you see how to obtain NVDA source code and the software packages involved in doing this and building NVDA for the first time.
es: Sería inútil hablar de cuestiones internas de un complejo sistema de software como NVDA sin tener algo que podamos seguir. Por tanto, vamos a empezar por ver cómo obtener el código fuente de NVDA y los paquetes de software involucrados, y la construcción de NVDA por primera vez.

source: After you download the source code, you might be interested in seeing the contents of the source code folder and the modules which holds NVDA together. In addition to learning more about various NVDA components and a high-level overview of runtime life of NVDA, you'll get a chance to learn why NVDA uses two programming languages for various tasks.
es: Después de descargar el código fuente, podrías estar interesado en ver el contenido de las carpetas de su interior y la relación entre los módulos que conforman NVDA. Además de aprender más sobre los distintos componentes de NVDA y una descripción a alto nivel de su vida en tiempo de ejecución, tendrás la oportunidad de saber por qué NVDA usa dos lenguajes de programación.

source: Next, we'll visit routines that will let NVDA start on your computer (installer and launcher), including the trick NVDA employs to detect that it is installed on a computer or running from a USB flash drive. Following that, we'll visit core.main, the function responsible for starting and exiting NVDA and things it does in between.
es: A continuación, visitaremos los procedimientos que permiten que NVDA se inicie en tu equipo (instalador y lanzador) incluyendo aquellos que se usan para saber si NVDA está instalado o se ejecuta desde una unidad USB. Después de eso, visitaremos core.main, la función responsable de iniciar NVDA, salir de él y procesar todo lo que ocurre entre estos dos sucesos.

source: A significant portion of the article will focus on the life of NVDA and things it does to let thousands of blind people use computers. We'll visit what scripts and events are, how accessibility API's are handled, how overlay classes and objects come to life, a tour of browse mode functionality and get a chance to interview various app modules, speech synthesizers and braille display driver modules. We'll then visit add-on subsystem and discuss how various add-ons use various NVDA functionality.
es: Una parte significativa del artículo se enfocará en la vida de NVDA y qué es lo que hace para permitir el acceso a los ordenadores a miles de personas ciegas. Durante nuestro recorrido sabremos qué son los scripts y los eventos, cómo se manejan las apis de accesibilidad, cómo vienen a la vida los objetos y clases superpuestos, una visita al funcionamiento del modo exploración, y tendremos una oportunidad de entrevistar a distintos módulos de aplicación, sintetizadores de voz y controladores braille. Después de eso hablaremos del subsistema de complementos y debatiremos sobre cómo estos usan y mejoran la funcionalidad de NVDA.

source: Following our discussion of important NVDA routines, we'll take a look at NVDA's user interface and how user settings are managed. We'll also tour what happens when NVDA is told to check for updates, how NVDA changes its behavior when running from secure screens, Ease of Access integration and other miscellaneous services.
es: Siguiendo con nuestra discusión sobre las rutinas importantes de NVDA, echaremos un vistazo a su interfaz de usuario y cómo se administra la configuración. También sabremos qué pasa cuando NVDA busca actualizaciones, cómo cambia su comportamiento en pantallas seguras, su integración con el servicio de facilidad de uso del sistema y otros servicios adicionales.

source: Lastly, we'll talk about how you can make a feature idea come to life. We'll briefly talk about coding style, submitting patches for review and will conclude with development process.
es: Finalmente, te explicaremos cómo hacer realidad una idea. Hablaremos brevemente del estilo del código, cómo enviar parches para que se revisen y concluiremos con el proceso de desarrollo.

source: ## Where to obtain NVDA source code and compile NVDA
es: ## Dónde obtener el código fuente y cómo compilar NVDA

source: If you would like to learn NVDA's internals, it is important to have NVDA source code handy. Like many open-source projects, NVDA uses Git for source code management. For more information on obtaining source code, see AccessingAndRunningSourceCode article.
es: Si quieres aprender cómo funciona NVDA por dentro, es importante tener a mano su código fuente. Como muchos proyectos de código abierto, NVDA usa Git para administrar el código. Para más información sobre cómo obtener el código fuente, visita el artículo correspondiente de nuestra documentación para desarrolladores.

source: ### Building NVDA
es: ### Construcción de NVDA

source: There are times when you would like to see NVDA in action. To help you with this and in case you'd like to test a new feature idea, you should build NVDA from source. Source code compilation steps are managed by SCons, and details on how to build NVDA from source can be found in readme.md found in the root directory of the NVDA source code.
es: Hay ocasiones en las que te gustaría ver a NVDA en acción. Para ayudarte en esto y en caso de que quieras probar una nueva característica, deberías construir NVDA desde el código. La herramienta SCons administra los pasos de compilación del código fuente, y se pueden encontrar detalles sobre cómo construir NVDA en el archivo readme.md que hay en la raíz del código fuente, o traducidos en nuestra web.

source: ## NVDA components and source code layout
es: ## Componentes de NVDA y disposición del código fuente

source: When you open the folder containing the source code, you may have noticed that it is composed of various directories besides the "source" directory. Let's examine the folder structure, and after that, we'll tour various components that holds NVDA together.
es: Cuando abras la carpeta que contiene el código fuente, te darás cuenta de que hay varios directorios además de "source". Examinemos la estructura de las carpetas, y después de eso, haremos un recorrido por distintos componentes que conforman NVDA.

source: ### Source code folder structure
es: ### Estructura de la carpeta del código fuente

source: The source code package comprises following folders and files:
es: El paquete de código fuente consta de las siguientes carpetas y archivos:

source: - build: Created when NVDA is built from source and is used as a staging area for compiled code.
es: - build: se crea al construir NVDA desde el código fuente y se usa como área intermedia para el código compilado.

source: - extras: Contains NVDA Controller Client package.
es: - extras: contiene el paquete del cliente para el controlador de NVDA.

source: - include: Major dependencies needed by NVDA, such as IAccessible2 library, are stored here.
es: - include: la mayoría de las dependencias que NVDA necesita, como por ejemplo la biblioteca IACcessible2, se almacenan aquí.

source: - launcher: Holds the MSI for NVDA's launcher.
es: - launcher: contiene el código del lanzador de NVDA.

source: - misc-deps: The miscellaneous dependencies folder houses other packages required to build NVDA such as various Python packages.
es: - misc-deps: contiene paquetes necesarios para construir NVDA, entre ellos paquetes Python.

source: - nvdaHelper: Contains the C++ portion of NVDA used in various situations.
es: - nvdaHelper: contiene la parte de código en C++ de NVDA usada en distintas situaciones.

source: - output: The resulting packages from various build tasks are stored here.
es: - output: los paquetes resultantes de las tareas de construcción se almacenan aquí.

source: - site_scons: Other packages built by SCons are stored here.
es: - site_scons: otros paquetes construidos por SCons se almacenan aquí.

source: - source: This is where Python portion of NVDA lives. We'll talk about contents of this directory throughout this article.
es: - source: aquí es donde vive el código Python de NVDA. Hablaremos del contenido de este directorio a lo largo de este artículo.

source: - uninstaller: Routines used by NVDA's uninstaller is stored here.
es: - uninstaller: almacena los procedimientos que usa el desinstalador de NVDA.

source: - user_docs: Documentation files for NVDA are stored in this folder.
es: - user_docs: aquí se almacenan los archivos con la documentación de usuario de NVDA.

source: ### NVDA components overview
es: ### Descripción de los componentes de NVDA

source: NVDA relies on various components to perform its job, such as supporting various accessibility API's, understanidng keyboard commands, sending output to a braille display and more. Here is a complete list of components used by NVDA:
es: NVDA se apoya en varios componentes para realizar su trabajo (dar soporte a varias apis de accesibilidad, entender órdenes de teclado, enviar la salida a una pantalla braille, etc.). Aquí se encuentra una lista completa de los componentes de NVDA:

source: - Installer: This module is the first module encountered when using NVDA for the very first time.
es: - Instalador: este es el primer módulo que nos encontramos al usar NVDA por primera vez.

source: - Launcher (nvda.pyw, nvda.exe if using binary builds): Used to start NVDA. This module is responsible for checking command-line arguments and performs initial startup tasks.
es: - Lanzador (nvda.pyw, nvda.exe en versiones binarias): se usa para iniciar NVDA. Este módulo es el encargado de comprobar los argumentos de la línea de órdenes y realizar distintas tareas de inicialización.

source: - NVDA service: This is used when NVDA runs as a service, such as when using NVDA in secure screens. A related module is used to register NVDA with Ease of Access (Windows Vista and later).
es: - Servicio de NVDA: este se usa cuando NVDA se ejecuta como servicio, por ejemplo al usarlo en pantallas seguras. Existe un módulo relacionado que registra NVDA con el servicio de accesibilidad (Windows Vista y posterior).

source: - Core: Performs bulk of NVDA's startup routine, coordinates how NVDA should exit and involved in NVDA's life from start to finish.
es: - Núcleo: se encarga de todo lo relativo al inicio de NVDA, coordina cómo debe cerrarse y está implicado en la vida de NVDA desde el principio hasta el fin.

source: - Event processor: Routines in event handler and queue handler are used to process events, queue events and perform related actions.
es: - Procesador de eventos: las instrucciones en el manejador de eventos y en el procesador de cola se usan para procesar eventos, meterlos en la cola y realizar acciones relacionadas.

source: - Accessibility API support: NVDA comes with handlers for MSAA (Microsoft Active Accessibility)/IAccessible, IAccessible2, Java Access Bridge (JAB) and UI Automation (UIA). Together with various overlay classes, API handlers allow NVDA to present uniform experience across different API's.
es: - Soporte para apis de accesibilidad: NVDA viene con manejadores para MSAA (Microsoft Active Accessibility)/IAccessible, IAccessible2, Java Access Bridge (JAB) y UI Automation (UIA). Junto con varias clases de superposición, los manejadores de apis permiten a NVDA presentar una experiencia uniforme entre distintas apis.

source: - Text navigation and access: Various methods for handling different types of text widgets are provided in text infos package.
es: - Acceso y navegación por texto: se ofrecen varios métodos para trabajar con distintos widgets de texto en el paquete text infos.

source: - App modules: NVDA comes with several app modules to let you use NVDA in various apps. Coordinating app module support is app module handler, and its duties include managing app module initialization and termination and keeping track of which app modules are active.
es: - Módulos de aplicación: NVDA viene con varios módulos que te permiten usarlo en distintas aplicaciones. El coordinador del soporte de módulos de aplicación es el manejador de módulos de aplicación, también llamado app module handler, y entre sus tareas se encuentran administrar el inicio y finalización de módulos de aplicación, y llevar un registro con los módulos que están activos.

source: - Global plugins: A global plugin adds interesting functionality to be used by NVDA users, and there is a manager that keeps an eye on global plugins: global plugin handler.
es: - Extensiones globales: una extensión global añade funciones muy interesantes para los usuarios de NVDA, y hay un administrador que no les quita ojo: el global plugin handler o manejador de extensiones globales.

source: - Add-on subsystem: You can write or use add-ons to enhance NVDA's functionality. Coordinating various NVDA add-ons is add-on handler, which is invoked when installing and removing add-ons and throughout the life of an add-on.
es: - Subsistema de complementos: puedes programar o utilizar complementos para extender la funcionalidad de NVDA. El manejador de complementos (addonHandler) es el encargado de coordinarlos, y reacciona al instalarlos, desinstalarlos y durante la vida de cada complemento.

source: - Browse mode management: Routines housed in virtual buffers package and browse mode module allow you to navigate complex documents such as PDF documents and websites.
es: - Administración del modo exploración: el código almacenado en el paquete virtualBuffers y en el módulo browseMode te permite navegar por documentos complejos, tales como sitios web o documentos pdf.

source: - Input support: The input core and its subordinates handle various input scenarios. This include a key press from a keyboard, flick on a touchscreen, tracking mouse movement and recording actions associated with a button on a braille display.
es: - Soporte de entrada: el módulo inputCore y aquellos relacionados con él controlan distintos escenarios de entrada. Estos incluyen una pulsación de teclado, un movimiento en una pantalla táctil, el rastreo del movimiento del ratón y la pulsación de un botón en una pantalla braille.

source: - Output routines: NVDA can be told to announce something via speech, braille, tones, wave file playback or combination of these.
es: - Componentes de salida: se le puede pedir a NVDA que anuncie algo a través de voz, braille, tonos, la reproducción de un archivo de sonido o una combinación de todo esto.

source: - Speech and synthesizers: These two subsystems allow NVDA to speak things on screen via a user-defined speech synthesizer.
es: - Voz y sintetizadores: estos dos subsistemas permiten a NVDA verbalizar lo que hay en pantalla a través de un sintetizador de voz definido por el usuario.

source: - Braille display management: This complex subsystem allows NVDA to communicate with various braille displays to send braille text or receive and interpret input from them.
es: - Administración de pantallas braille: este complejo subsistema permite que NVDA se comunique con distintas pantallas braille para enviarles texto o recibir e interpretar la entrada que se realice desde ellas.

source: - Message announcer: NVDA can announce various information via speech and/or braille using a function in the "ui" module.
es: - Anunciado de mensajes: NVDA puede anunciar información por síntesis de voz o braille usando una función disponible en el módulo "ui".

source: - Graphical user interface: NVDA can show various dialogs, windows and so on, all housed in the "gui" package.
es: - Interfaz gráfica de usuario: NVDA puede mostrar múltiples diálogos y ventanas, todos ellos alojados en el paquete "gui".

source: - Configuration management: The config package not only houses the default configuration for NVDA, but also acts as a clerk responsible for managing user configuration such as switching between configuration profiles.
es: - Administración de la configuración: el paquete config no sólo aloja la configuración por defecto de NVDA, sino que también se usa para administrar la configuración de usuario y alternar entre distintos perfiles.

source: - Localization support: Various modules are involved when supporting NVDA localization, including language handler and translation files for NVDA interfaces in different languages.
es: - Soporte de idiomas: hay varios módulos implicados en la traducción de NVDA, incluidos languageHandler y los archivos de traducción de la interfaz de NVDA en distintos idiomas.

source: - NVDA helper: this module performs two things: allows NVDA's Python routines to call C++ routines and used to let NVDA communicate with other programs via code injection and other advanced techniques.
es: - NVDA helper: este módulo realiza dos acciones: permite al código Python comunicarse con código C++, y permite que NVDA se comunique con otros programas mediante inyección de código y otras técnicas avanzadas.

source: - Windows API wrappers: NVDA comes with wrapper modules for some Windows API functions, housed in different modules named after Windows API libraries such as user32.dll wrapped in winUser.py.
es: - Soporte para la API de Windows: NVDA viene con módulos que abstraen algunas funciones de la api de Windows, alojadas en módulos tales como winUser.py, que contiene funciones de la biblioteca user32.dll.

source: We will examine these modules in detail throughout this article (the rest of this article is based on the Design Overview article). But first, let's learn more about NVDA's architecture, starting with some important definitions.
es: Examinaremos en detalle estos módulos a lo largo de este artículo. El resto del artículo está basado en el de descripción del diseño. Pero primero aprendamos algo más sobre la arquitectura de NVDA, comenzando con algunas definiciones importantes.

source: ## Terminology
es: ## Terminología

source: ### Abbreviations
es: ### Abreviaturas

source: * API: Application programming interface
es: * API: interfaz de programación de aplicaciones

source: * GUI: Graphical user interface
es: * GUI: interfaz gráfica de usuario

source: * OS: Operating system
es: * SO: sistema operativo

source: * DLL: Dynamic Link Library
es: * DLL: biblioteca de vínculos dinámicos

source: ### Definitions
es: ### Definiciones

source: * Caret: The system cursor; i.e. the cursor generally moved when you use the normal cursor keys.
es: * Caret: el cursor del sistema; por ejemplo, el cursor que se mueve generalmente cuando pulsas las flechas y el tabulador.

source: * Focus: The highlighted region of screen where the system sets focus.
es: * Foco: la región resaltada de la pantalla donde el sistema establece el foco.

source: * Script: A function which is executed in response to input from the user such as key presses from the keyboard, manipulating braille display controls and taps on touchscreens. Also known as a command.
es: * Script: función que se ejecuta en respuesta a la entrada de usuario: pulsaciones de teclado, manipulación de controles en pantallas braille o toques en pantallas táctiles. El script también puede llamarse comando u orden.

source: * Gesture: A piece of input such as a keyboard command.
es: * Gesto: unidad mínima de entrada. Por ejemplo, una orden de teclado.

source: * Event: A routine to be used when certain conditions occur.
es: * Evento: código que debe ejecutarse cuando se dan ciertas condiciones.

source: * Widget: An individual component in a GUI with which a user can interact; e.g. a button, an editable text field, a list box, etc. Also known as a control or object.
es: * Widget: un componente individual en una GUI con el que el usuario puede ineractuar; por ejemplo un botón, un campo de texto editable, un cuadro de lista, etc. También es conocido como control u objeto.

source: ### Programming Languages
es: ### Lenguajes de programación

source: NVDA is primarily written in the [Python programming language](http://www.python.org/), which allows for rapid development among other benefits. Code that needs to be [#In-processCode injected into other processes] is written in C++ for high performance.
es: NVDA ha sido desarrollado principalmente con el [lenguaje de programación Python](http://www.python.org/), que permite un desarrollo rápido entre otras ventajas. El código que se inyecta en otros procesos está escrito en C++ para aumentar el rendimiento.

source: Note: Because of dependencies, NVDA is written using Python 2.7.
es: Nota: por cuestión de dependencias, NVDA utiliza Python 2.7.

source: ### Accessibility APIs
es: ### Apis de accesibilidad
