Repository: bingen13/devguides_translation
Catalog: translations/*/LC_MESSAGES/LogFilesAndCrashDumps.po
Languages: es

source: # Log Files and Crash Dumps
es: # Archivos de registro y volcado de errores

source: ## Log Files
es: ## Archivos de registro

source: When reporting problems, it is often useful to provide an NVDA log file. This file shows what NVDA was doing when the problem occurred. Sometimes, a particular problem is difficult to reproduce or not reproduceable at all on other systems, so the log file can act as a further description or recording of the problem as it happened.
es: Al informar de fallos, con frecuencia es útil aportar un archivo de registro. Este archivo muestra qué estaba haciendo NVDA cuando el error ocurrió. Algunas veces, el problema es particularmente difícil de reproducir o no es totalmente reproducible en otros sistemas, por lo que un archivo de registro puede valer como una descripción más en profundidad de un fallo o un registro del problema mientras estaba ocurriendo.

source: A log file should be attached to a GitHub issue at the same time or after it is created. It is important not to simply paste fragments or entire log files in to an issue comment, as this clutters the issue and may mangle certain information needed from the log.
es: El archivo de registro se debería adjuntar a la incidencia de GitHub mientras la creamos, o justo después. Es importante no pegar fragmentos del archivo o el texto completo como comentario en la incidencia, ya que esto la satura y puede hacer que se pierda información necesaria del registro.

source: ### Log levels
es: ### Niveles de registro

source: By default, NVDA's log level is set to `Info`. This means that only informational messages, warning messages and major error messages are logged. This level of logging may be useful for crashes of NVDA or when nothing better is available. However, in order to provide much more detail, you can set NVDA's log level to `Debug` (In General Settings under Preferences in the NVDA menu) before the error occurs. Setting the log level to `Debug` tells NVDA to also log information such as what keys were pressed, what was spoken and other messages to help developers diagnose problems. Although this detail will help a great deal in solving the issue, please be aware that because key presses and spoken messages are logged, the log may contain personal information.
es: Por defecto, NVDA tiene el nivel de registro puesto en `información`. Esto significa que sólo se registran mensajes informativos, advertencias y errores graves. Este nivel de registro puede ser útil cuando NVDA da un error fatal o cuando no se dispone de nada mejor. Sin embargo, para aportar más información detallada, puedes establecer el nivel de registro en `depuración` (en los ajustes generales de NVDA, submenú preferencias del menú NVDA) antes de que el error ocurra. Al establecer el nivel de registro en `depuración`, se registran cosas tales como qué teclas se han pulsado, qué mensajes ha verbalizado NVDA y otra información útil que puede ayudar a los desarrolladores a realizar un diagnóstico. Por favor, ten en cuenta que aunque se aporta una gran cantidad de información para resolver la incidencia, el hecho de que se registren mensajes hablados y pulsaciones de teclado hace que el registro pueda contener información personal.

source: ### Collecting the log file
es: ### Recuperar el archivo de registro

source: To retrieve a log file to be attached to an issue, after the problem occurs and before closing NVDA, do the following:
es: Para recuperar un archivo de registro para después adjuntarlo a una incidencia, después de que ocurra el problema y antes de cerrar NVDA, haz lo siguiente:

source: 1. Open the log viewer found under Tools in the NVDA menu.
es: 1. Abre el visualizador de registro de NVDA. Lo encontrarás en el menú herramientas.

source: 2. In the log viewer, choose Save As from the Log menu, and save the file to a place of your choice.
es: 2. En el visualizador de registro, ve al menú registro y pulsa en Guardar como. Guarda el archivo de registro en el lugar que prefieras.

source: 3. Finally, this file you have saved can be attached to an issue on GitHub.
es: 3. Finalmente, adjunta el archivo en la incidencia de GitHub.

source: If you have already closed NVDA or NVDA crashed, you can always find the log file for the last time NVDA was running. For most users, this file can be found in the [user temporary folder](#user-temporary-folder) `%temp%`. If you have not started NVDA since it last exited (e.g. you have some sight or are using another screen reader), the file you want is `nvda.log`. If you have started NVDA since it last exited, the file you want is `nvda-old.log`. For those running from source, these files are in the source directory.
es: Si ya habías cerrado NVDA o se ha cerrado por culpa de un error fatal, siempre puedes encontrar el registro de la última vez que NVDA estaba funcionando. Para la mayoría de usuarios, este archivo se puede encontrar en la carpeta temporal de usuario (%temp%). Si no has iniciado NVDA desde la última vez que se cerró (por ejemplo, porque tienes vista o usas otro lector de pantalla), el archivo que quieres es nvda.log. Si has vuelto a iniciar NVDA, el archivo que buscas se llama nvda-old.log. Para aquellos que usan NVDA desde el código fuente, los archivos de registro están en la carpeta source.

source: ## Crash Dumps
es: ## Volcado de errores

source: This applies to NVDA 2014.1 and later. Earlier versions do not generate crash dumps.
es: Esta sección se aplica a NVDA 2014.1 y versiones posteriores. Las versiones anteriores no generan volcado de errores.

source: If NVDA crashes, it will generate a file called a minidump which will help developers to determine the cause of the crash. In addition, minidumps can also be generated on request for other applications which crash if NVDA is suspected as the cause of the crash.
es: Si NVDA sufre un error fatal, genera un archivo llamado minivolcado (minidump) que ayudará a los desarrolladores a saber la causa del error. Además, se pueden generar minivolcados a petición para otras aplicaciones si se sospecha que NVDA es el causante de sus errores.

source: ### Minidumps for NVDA Itself
es: ### Minivolcados para NVDA en sí

source: When NVDA crashes, it will usually restart itself. In some rare circumstances, this may not work. If NVDA crashes, a minidump will be generated in a file called nvda_crash.dmp. For most users, this file can be found in the [user temporary folder](#user-temporary-folder) `%temp%`. For users running from source, `nvda_crash.dmp` will be placed in the source directory.
es: Si NVDA sufre un error fatal, se reinicia a sí mismo en la mayoría de las ocasiones. En algunas circunstancias extrañas, esto puede no funcionar. Si NVDA sufre un error fatal, se genera un minivolcado en un archivo llamado nvda_crash.dmp. La mayoría de usuarios podrán encontrarlo en el directorio temporal del usuario (%temp%). Para aquellos que usen NVDA desde el código fuente, el archivo aparecerá en la carpeta source.

source: ### Minidumps for Other Applications
es: ### Minivolcados para otras aplicaciones

source: If an application you are using is crashing and NVDA is the suspected cause, you can request that a minidump be generated when that application crashes. You should generally only do this if requested by a developer or if you are an advanced user. This is not enabled by default and it needs to be enabled for each application after it is started. To enable it for a given application:
es: Si una aplicación que estás usando falla y sospechas que NVDA es la causa, puedes solicitar que se genere un minivolcado cuando esa aplicación falle. Sólo deberías hacer esto si un desarrollador te lo pide o si eres un usuario avanzado. Por defecto no está habilitado y debes habilitarlo en cada aplicación de la que quieras obtener un minivolcado una vez comiences el proceso de reproducción del error. Para habilitar el volcado para una aplicación específica:

source: 1. Switch to the application.
es: 1. Navega hasta la aplicación.

source: 2. Press `NVDA+control+z` to open the NVDA Python console.
es: 2. Pulsa `NVDA+ctrl+z` para abrir la consola Python.

source: 3. Type the following command exactly as it appears (you will probably want to copy and paste it):
es: 3. Escribe este comando tal y como aparece (o copia y pega si lo prefieres):

source: 4. Press enter.
es: 4. Pulsa intro.

source: 5. The path to the file that will be generated will be presented. If you wish to copy it, you can press `F6` to move to the console output.
es: 5. La ruta donde se generará el archivo aparecerá en la consola. Si quieres copiarla, pulsa f6 para moverte al panel de salida de la consola.

source: These dumps will always be placed in the [user temporary folder](#user-temporary-folder) `%temp%`. They are named in the form nvda_crash_appName_processId.dmp, where appName is the name of the application's executable file.
es: Estos volcados se almacenarán siempre en el directorio temporal del usuario (%temp%). Su nombre sigue la forma nvda_crash_appname_processid.dmp, donde appname es el nombre del archivo ejecutable de la aplicación.

source: ### Alternative Way to Get Minidumps for Other Applications
es: ### Forma alternativa de obtener minivolcados para otras aplicaciones

source: Sometimes, the method described above (having NVDA generate a minidump when an application crashes) doesn't work; no minidump is generated. Instead, you can configure Windows to collect minidumps when any application crashes. To do this:
es: A veces, el método descrito arriba (haciendo que NVDA genere un minivolcado cuando una aplicación falla) no funciona; no se genera un minivolcado. En vez de esto, puedes configurar Windows para que recopile minivolcados cuando falle cualquier aplicación. Para hacerlo:

source: For users experienced with the Registry: Create the following (empty) key: `HKEY_LOCAL_MACHINE\SOFTWARE\Microsoft\Windows\Windows Error Reporting\LocalDumps`
es: Para usuarios con experiencia manejando el registro: crea la siguiente clave vacía: `HKEY_LOCAL_MACHINE\SOFTWARE\Microsoft\Windows\Windows Error Reporting\LocalDumps`

source: More detailed instructions for users who aren't familiar with the registry (though this should generally not be attempted by users without some technical knowledge of Windows):
es: Instrucciones más detalladas para usuarios que no saben manejar el registro (y que no deberían hacerse si no tienes conocimientos técnicos de Windows):

source: 1. Press Windows+r and type `regedit` to open the Registry Editor.
es: 1. Pulsa `windows+r` y escribe regedit para abrir el editor del registro.

source: 2. Move to the following key: `HKEY_LOCAL_MACHINE\SOFTWARE\Microsoft\Windows\Windows Error Reporting`
es: 2. Desplázate hasta esta clave: `HKEY_LOCAL_MACHINE\SOFTWARE\Microsoft\Windows\Windows Error Reporting`

source: - If you're running Windows 10, you can simply paste this into the address bar in the Registry Editor and press enter.
es: - Si tienes Windows 10, copia la clave en la barra de direcciones del editor del registro y pulsa intro.

source: - Otherwise, use the tree to locate the key, where the backslashes indicate deeper levels of the tree.
es: - En cualquier otro caso, desplázate por el árbol, donde cada barra invertida representa un nivel que debes desplegar.

source: 3. Open the context menu for the `Windows Error Reporting` key and select New -> Key.
es: 3. Abre el menú de contexto sobre la clave `Windows Error Reporting` y elige nuevo, clave.

source: 4. Type `LocalDumps` exactly as it appears and press enter.
es: 4. Escribe `LocalDumps` tal y como aparece y pulsa intro.

source: When an application crashes, it will display the standard Windows application crash dialog. Once that dialog is closed, the crash dump will be placed in `%localappdata%\CrashDumps`.
es: Cuando una aplicación falle, se mostrará el típico diálogo de envío de informe de errores. Al cerrar este diálogo, el archivo de volcado aparecerá en `%localappdata%\crashDumps`.

source: You should disable this once you have collected the dump you're interested in, as otherwise, dumps will be collected for all future crashes and consume disk space. To disable this, just delete the `LocalDumps` key you created earlier.
es: Deberías desactivar la generación de volcados tan pronto como tengas el de la aplicación que te interesa, o de lo contrario se generarán archivos para todos los fallos que haya en el futuro, consumiendo espacio en disco. Para desactivarla, simplemente borra la clave LocalDumps que creaste anteriormente.

source: See the [Collecting User-Mode Dumps MSDN article](https://msdn.microsoft.com/en-us/library/windows/desktop/bb787181(v=vs.85).aspx) for more information about this functionality.
es: Consulta [este artículo de MSDN](https://msdn.microsoft.com/en-us/library/windows/desktop/bb787181(v=vs.85).aspx) para más información.

source: ### Attaching Minidumps to Issues
es: ### Cómo adjuntar minivolcados a incidencias

source: In order to attach a minidump to a GitHub issue, you will need to place it in a zip archive. You can do this by navigating to the minidump file in File Explorer, activating the context menu, selecting Send to and then selecting Compressed (zipped) folder.
es: Para adjuntar un archivo de volcado a una incidencia de GitHub, necesitarás situarlo en un archivo zip. Puedes hacer esto buscando el archivo en el explorador de Windows, activando el menú de contexto, seleccionando "Enviar a" y a continuación "Carpetas comprimidas (en zip)".

source: ## User Temporary Folder
es: ## Carpeta temporal del usuario

source: The user temporary folder can be accessed by typing `%temp%` in most places where a folder name can be typed. For example, you can type this in the address bar of File Explorer, the Run dialog accessed by pressing `Windows key+r` or a file open or browse dialog.
es: Se puede acceder a la carpeta temporal del usuario escribiendo `%temp%` en casi cualquier sitio donde se pueda escribir un nombre de carpeta. Por ejemplo, puedes escribir en la barra de direcciones del explorador de Windows, en el diálogo ejecutar que se abre pulsando windows+r, o un diálogo de abrir archivo / examinar.
