Repository: bingen13/devguides_translation
Catalog: translations/*/LC_MESSAGES/MakeAddonsTranslatable.po
Languages: es

source: # Make add-ons translatable throught the NVDA's translation system #
es: # Hacer complementos traducibles mediante el sistema de traducciones de NVDA #

source: ## Steps ##
es: ## Pasos ##

source: 1. Authors request the inclusion of an add-on in the translation system via the [NVDA add-ons mailing list](https://nvda-addons.groups.io/g/nvda-addons).
es: 1. Los autores solicitan la inclusión de un complemento en el sistema de traducciones mediante la [lista de correo de complementos de NVDA](https://nvda-addons.groups.io/g/nvda-addons).

source: 2. A member of the NVDA add-on team creates a repo for the add-on at
es: 2. Un miembro del equipo de complementos de NVDA crea un repositorio para el complemento en

source: - If the author has a Bitbucket account, s/he can request admin access to the add-on repo, and write access to [add-on files](https://bitbucket.org/nvdaaddonteam/addonFiles).
es: - Si el autor tiene una cuenta en Bitbucket, el/ella puede solicitar acceso de administrador al repositorio del complemento, y acceso de escritura a [add-on files](https://bitbucket.org/nvdaaddonteam/addonFiles).

source: - The add-on repo must contain a branch named stable, where authors or other people with write access to the repo should merge code considered stable when the add-on is updated. This branch is used to send translatable messages to, and receive l10n updates from, the [NVDA translation repo](http://subversion.assembla.com/svn/screenReaderTranslations).
es: - El repositorio del complemento debe contener una rama llamada stable, donde los autores u otras personas con acceso de escritura al repositorio deberían enviar código considerado estable cuando el complemento se actualice. Esta rama se usa para enviar mensajes traducibles a, y recibir mensajes traducidos desde, [el repositorio de traducción de NVDA](http://subversion.assembla.com/svn/screenReaderTranslations).

source: 3. Admins register the add-on and commit settings for translators from Exbi server (nvdal10n@exbi.nvaccess.org):
es: 3. Los administradores registran el complemento y envían los ajustes para traductores desde el servidor exbi (nvdal10n@exbi.nvaccess.org):

source: - cd into mr
es: - cd a mr

source: - cd into addons/addonRepoName
es: - cd a mr/addons/addonRepoName

source: - svn commit */settings -m "Make blah add-on available for translation."
es: - svn commit */settings -m "Make blah add-on available for translation." ("se hace al complemento blah disponible para traducción", mensaje a enviar a los traductores)

source: 4. edit addonFiles/automatic.crontab, so that l10n updates are merged into the stable branch, and translators receive new messages automatically.
es: 4. Editar addonfiles/automatic.crontab, a fin de que los mensajes se añadan a la rama stable, y de que los traductores reciban nuevos mensajes automáticamente.

source: - Copy one of the lines for one of the existing addons, just change the addon name and paste it in the correct section, commit and push.
es: - Copia una de las líneas para un complemento existente, cambia el nombre del complemento y pégala en la sección correcta, commit y push.

source: - Note: Admins can perform the above process manually, running mr addon2svn and mr svn2addon from Exbi.
es: - Nota: Los administradores pueden realizar el proceso arriba manualmente, ejecutando mr svn2addon y mr addon2svn desde exbi.

source: ## Maintaining the add-on ##
es: ## Mantener el complemento ##

source: Note: Maintainers may follow other procedures. This info is only provided for convenience, according to discussions like this [topic about repos management](https://nvda-addons.groups.io/g/nvda-addons/message/9418).
es: Nota: los responsables de mantenimiento pueden seguir otros procedimientos. Esta información sólo se proporciona como una referencia, de acuerdo a debates como este [tema sobre gestión de repositorios](https://nvda-addons.groups.io/g/nvda-addons/message/9418).

source: - Clone the maintainer repo:
es: - Clona el repositorio del responsable de mantenimiento:

source: - ```git clone https://github.com/githubUserName/addonRepoName```
es: - ```git clone https://github.com/usuarioGithub/repoComplemento```

source: - Add remote for Bitbucket repo:
es: - Añade un origen remoto para el repositorio de Bitbucket:

source: - ```git remote add bitbucket https://bitbucket.org/nvdaaddonteam/addonRepoName```
es: - ```git remote add bitbucket https://bitbucket.org/nvdaaddonteam/repoComplemento```

source: - Fetch Bitbucket repo:
es: - Descarga el repositorio de Bitbucket:

source: - Track the stable branch:
es: - Sigue la rama stable:

source: - Periodically:
es: - Periódicamente:

source: - From stable branch:
es: - Desde la rama stable:

source: - ```git pull``` # Get translations
es: - ```git pull``` # Descargar traducciones

source: - ```git merge master``` # Stable code containing translatable messages
es: - ```git merge master``` # Código estable que contiene mensajes traducibles

source: - From master:
es: - Desde master:

source: - ```git push origin master``` # Update translations
es: - ```git push origin master``` # Actualizar traducciones

source: ### References for maintainers ###
es: ### Referencias para responsables de mantenimiento ###

source: - [Push to multiple repos in one step](https://gist.githubusercontent.com/bjmiller121/f93cd974ff709d2b968f/raw/8f17c4d72ba8bd36aea0ec0cf344a8197fa648e8/multiple-push-urls.md)
es: - [Enviar los cambios a varios repositorios en un solo paso](https://gist.githubusercontent.com/bjmiller121/f93cd974ff709d2b968f/raw/8f17c4d72ba8bd36aea0ec0cf344a8197fa648e8/multiple-push-urls.md)

source: - [Book about Git](https://git-scm.com/book)
es: - [Libro sobre Git](https://git-scm.com/book)

source: ## Requirements ##
es: ## Requisitos ##

source: ### Access to addonFiles ###
es: ### Acceso a addonFiles ###

source: This will be granted only to people who have a track record of providing reviews and known to be reliable at their duties, all of this subject to a community-wide dialogue about repo management.
es: Esto se concederá sólo a personas que tengan un registro a lo largo del tiempo de revisiones y de las cuales se sepa que son de confianza en sus deberes, todo esto sujeto a un diálogo de toda la comunidad sobre la administración de repositorios.

source: The maintainer should fulfill the following criteria:
es: El mantenedor debe cumplir los siguientes criterios:

source: 1. Has done at least one basic review.
es: 1. Haber hecho una revisión básica como mínimo.

source: 2. Known to be a reliable role model in terms of add-on authoring, reviewing, maintenance, and promotion (repo management is a job with tons of responsibilities).
es: 2. Que se sepa que es un modelo de rol confiable en términos de autoría, revisión, mantenimiento y promoción de complementos (la administración de un repositorio es un trabajo con un montón de responsabilidades).

source: 3. Known to be responsive to communication to and from users and other developers.
es: 3. Que se sepa que es responsivo a la comunicación para y desde usuarios y otros desarrolladores.

source: 4. Keeps an eye on NvDA Core development.
es: 4. Mantener vigilado el desarrollo del núcleo de NVDA.

source: ### Access to repos and add-on registration ###
es: ### Acceso a los repositorios y registro de complementos ###

source: - Registration or access to repos won't be denied for personal issues, such as differences in opinions, criticism to admins code or attitude based on evidence, etc. If an admin is not reliable at their duties, that person should be replaced by other maintainer.
es: - El registro o el acceso a repositorios no se denegará por problemas personales, como diferencia de pareceres, críticas al código de los administradores o actitud basada en evidencia, etc. Si un administrador no es de confianza en sus deberes, debe ser reemplazado por otro mantenedor.

source: - Anyway, if the registration or access request is done in a manner that is seen (perceived or actual) as threatening or harmful to the individual being asked to register a new maintainer, or for that matter, to the whole community, this request will be denied, and this will be archived forever (to serve as a lesson for the actual individual who did this in the first place, as well as for the community).
es: - Así y todo, si la solicitud de registro o acceso se hace de forma que se vea (perceptiva o realmente) como amenazante o dañina para la persona a la que se pide el alta de un nuevo mantenedor, o para toda la comunidad en esa materia, la solicitud será denegada y se archivará para siempre (a fin de que sirva como lección para la persona que lo hizo en primer lugar así como para la comunidad).

source: ## Related links ##
es: ## Enlaces relacionados ##

source: - [Adding a New Language to Ikiwiki](https://github.com/nvaccess/l10n-code/wiki/Adding-a-New-Language-to-Ikiwiki)
es: - [Cómo añadir un Nuevo Idioma a Ikiwiki](https://nvda.es/documentacion/desarrollo/como-anadir-un-nuevo-idioma-a-ikiwiki)

source: - [mr documentation](https://www.systutorials.com/docs/linux/man/1-mr/)
es: - [documentación de mr (en inglés)](https://www.systutorials.com/docs/linux/man/1-mr/)

source: - [Thread about repo management and registration, started by Joseph Lee](https://nvda-addons.groups.io/g/nvda-addons/message/6937)
es: - [Hilo sobre registro y administración de repositorios, iniciado por Joseph Lee (en inglés)](https://nvda-addons.groups.io/g/nvda-addons/message/6937)

source: ## Aknowledgements ##
es: ## Agradecimientos ##

source: This document is based on work and information provided by Mesar Hameed and James Teh.
es: Este documento está basado en el trabajo e información proporcionados por Mesar Hameed y James Teh.

source: Thanks for making this possible.
es: Gracias por hacer esto posible.
