Repository: bingen13/devguides_translation
Catalog: translations/*/LC_MESSAGES/TranslatingUsingAutomaticProcess.po
Languages: es

source: # Translating using the automatic workflow process
es: # Traducir utilizando el proceso de flujo de trabajo automático

source: This page describes the process of translating NvDA and related files using the automatic workflow process. For more information about the overall translation process, please read the translate intro page.
es: Esta página describe el proceso de traducción de NVDA y los ficheros relacionados usando el proceso de flujo de trabajo automático. Para obtener más información sobre el proceso de traducción en general, lee la página de introducción a la traducción.

source: The automatic workflow process consists of receiving translation files, working on your translations, then submitting your translations to the translations server. This is done via a version control system called Subversion (SVN). From time to time, you'll receive new translations (along with new translation notices via email or Twitter( optional; follow "@SRT_" for tweets), and your translations are included in NVDA periodically so you can test your translations.
es: El proceso de flujo de trabajo automático consiste en recibir archivos de traducción, trabajar en tus traducciones y luego enviarlas al servidor de traducciones. Esto se hace a través de un sistema de control de versiones llamado Subversion (SVN). De vez en cuando, recibirás nuevas traducciones (junto con nuevos avisos de traducción por correo electrónico o por Twitter (opcional, sigue a “@SRT_” para recibir tuits), y tus traducciones se incluirán en NVDA periódicamente para que puedas probarlas.

source: Note that you need to keep the translations up to date and test your translation work to make sure it works as intended. Also, read the release process document to remind yourself about release dates.
es: Ten en cuenta que necesitas mantener las traducciones actualizadas y probar tu trabajo de traducción para asegurarte de que funciona de la manera prevista. Además, lee el documento del proceso de publicación para recordar las fechas de publicación.

source: The workflow details are described below.
es: Los detalles del flujo de trabajo se describen a continuación.

source: ## Creating an account
es: ## Creando una cuenta

source: To begin the workflow process, start by subscribing to the NVDA translations mailing list and request an invitation to join the workflow. Once you receive your [assembla http://www.assembla.com] invitation, you can proceed by creating a username/password so that you can use the svn server. Once you are logged in, you need to accept the invitation to the screenReaderTranslations team. After that, you don't need to come back to the website.
es: Para comenzar el proceso de flujo automático subscríbete a la lista de correos de traducciones de NVDA y solicita una invitación para unirte al flujo de trabajo. Una vez recibas tu invitación en [assembla](http://www.assembla.com), puedes proceder creando un nombre de usuario/clave de acceso tal que puedas utilizar el servidor svn. Una vez te hayas autentificado, necesitas aceptar la invitación al equipo screenReaderTranslations. Después de eso, no necesitaremos regresar al sitio web.

source: ## Download and install Subversion
es: ## Descargar e instalar subversion

source: Currently we recommend Tortoise svn. Download it from http://tortoisesvn.net and install it.
es: Actualmente recomendamos Tortoise svn. Descárgalo de http://tortoisesvn.net e instálalo.

source: The default TortoiseSVN settings and properties are fine, so no need to change anything.
es: La configuración y propiedades predeterminadas de TortoiseSVN están bien, así que no necesitas cambiar nada.

source: ## First time checkout (To download the repository)
es: ## La primera vez que se hace checkout (para descargar el repositorio)

source: To checkout the screenreader translations repository, create a directory e.g. named Translations, right click on it and select "SVN Checkout..." from the context menu. Copy and paste the following url into the repository url edit box:
es: Para descargar el repositorio de screenreader translations crea un directorio, por ejemplo llamado Traducciones, haz clic derecho o pulsa Aplicaciones y desde el menú de Contexto selecciona SVN chekout… Copia y pega la siguiente dirección web en el cuadro de edición de dirección de repositorio:

source: You can see that it is successful when the last line that it printed says something like `Completed; Path: At revision: 1234`
es: Puedes mirar si ha sido correcto cuando la última línea que se imprima diga algo como `Completed; Path: At revision: 1234`

source: ## Repository structure
es: ## Estructura del Repositorio

source: The layout of the repository is as follows:
es: El diseño del repositorio es como sigue:

source: - Folders of two character language codes (such as es for Spanish, fr for French), as used by nvda, contains all the translation documents for this language.
es: - Carpetas de dos caracteres de códigos del idioma (como es para español o fr para francés), según se utilizan por nvda, conteniendo todos los documentos de traducción para este idioma.

source: - scripts: the scripts that are run on the server, should generally not be changed.
es: - scripts: los scripts que se ejecutan en el servidor, generalmente no deberían cambiarse.

source: - some t2tconf files, standard config files that should not need to be changed.
es: - Algunos ficheros t2tconf, ficheros de configuración estándar que no deberían cambiarse.

source: Each language directory contains:
es: Cada directorio de idioma contiene:

source: - add-ons, the translatable messages for various add-ons (if enabled for your language).
es: - add-ons, los mensajes traducibles para varios complementos (si están habilitados para tu idioma).

source: - changes-newRevisions, directory containing updates that need to be translated for the changes.t2t (read only).
es: - changes-newRevisions, directorio que contiene las actualizaciones que deben traducirse para el fichero changes.t2t (solo lectura).

source: - userGuide-newRevisions, directory containing updates that need to be translated for the userGuide.t2t (read only).
es: - userGuide-newRevisions, directorio que contiene las actualizaciones que deben traducirse para el fichero userGuide.t2t (solo lectura).

source: - symbols-newRevisions, directory containing updates that need to be translated for the symbols.dic (read only).
es: - symbols-newRevisions, directorio que contiene actualizaciones que deben traducirse para el fichero symbols.dic (solo lectura).

source: - changes.t2t, localized list of changes (you should edit).
es: - changes.t2t, lista localizada de cambios (debes editarlo).

source: - changes.html, automatically generated html from t2t, so that you can check your syntax.
es: - changes.html, html generado automáticamente desde t2t, para que puedas verificar la sintaxis.

source: - userGuide.t2t, localized manual (you should edit).
es: - userGuide.t2t, manual localizado (debe editarse).

source: - userGuide.html, automatically generated html from your t2t, so that you can check your syntax.
es: - userGuide.html, html generado automáticamente desde tu t2t, para que puedas verificar la sintaxis.

source: - userGuide-structureDifferences.txt, automatically generated diffrence between the english user guide statistics, and the localized user guide stats (very useful).
es: - userGuide-structureDifferences.txt, genera automáticamente la diferencia entre las estadísticas de la guía de usuario en inglés y las estadísticas de la guía de usuario traducida (muy útil).

source: - nvda.po, the nvda interface file, new messages from pot are automatically merged, and you will be sent an email (or a tweet) when there are new messages to be translated.
es: - nvda.po, el archivo de interfaz de NVDA, los nuevos mensajes del pot se fusionan automáticamente, y se te enviará un correo electrónico (o un tuit) cuando haya nuevos mensajes para traducir.

source: - characterDescriptions.dic, your localized character descriptions file (you should edit).
es: - characterDescriptions.dic, tu archivo de descripciones de caracteres traducido (debe editarse).

source: - symbols.dic, your localized symbols file (you should edit).
es: - symbols.dic, tu archivo de símbolos traducido (debe editarse).

source: - Settings, various meta information to help the automated translation system, also used to indicate when you want to translate a specific addon.
es: - Settings, metainformación variada para ayudar al sistema de traducción automática, también se utiliza para indicar cuándo se desea traducir un complemento específico.

source: ## Workflow
es: ## Flujo de trabajo

source: To minimize merge problems, and letting the automated system work
es: Para minimizar los problemas de combinación, y permitir que el sistema funcione automáticamente con

source: effectively it is strongly recommended that you:
es: efectividad se recomienda encarecidamente que se haga:

source: - SVN update before you start working.
es: - svn update antes de comenzar el trabajo.

source: - SVN Commit when you finish working with a section.
es: - svn commit cuando finalices el trabajo con una sección.

source: The workflow is something like this:
es: El flujo de trabajo es algo como esto:

source: 1. You receive an email telling you that nvda.po has been updated, and it will tell you how many messages are untranslated, and how many are fuzzy.
es: 1. Recibes un correo electrónico diciéndote que nvda.po ha sido actualizado, y te dirá cuántos mensajes están sin traducir, y cuántos están provisionales.

source: 1.1 svn update to get the modifications
es: 1. svn update para recibir las modificaciones

source: 1.2 Localize the new messages/fuzzy messages.
es: 2. Traducir los mensajes nuevos/mensajes provisionales.

source: 1.3 Commit, in the commit message you say if the work was finished or not.
es: 3. Commit, en el mensaje del commit dí si el trabajo se finalizó o no.

source: 2. You receive an email (or a tweet) telling you that there are new revisions for the changes or userGuide documents to be translated
es: 2. Recibes un correo electrónico (o un tuit) que te informa que hay nuevas revisiones para los cambios o que se deben traducir los documentos de la Guía del usuario

source: 2.1 You svn update, you find one new directory for example 10289 in changes-newRevisions.
es: 1. svn update, ves un directorio nuevo en changes-newRevisions, por ejemplo 10289.

source: 2.2 Inside 10289 you will find the changes.t2t, differences.txt, wordDifferences.txt and log.txt
es: 2. Dentro de 10289 puedes ver el changes.t2t, el differences.txt, el wordDifferences.txt y el log.txt

source: 2.3 differences.txt will show you exactly what line has been added/changed/removed.
es: 3. En differences.txt deberían estar exactamente las líneas que debes añadir/cambiar/eliminar.

source: 2.4 if your localization is complete, the line numbers of each difference block should be close to where you need to do your changes.
es: 4. Si tu traducción está completa, los números de línea de cada bloque differences deberían estar cerca de donde necesites realizar tus cambios.

source: 2.5 If differences.txt showed you a line that was modified, and it isn't easy to see what changed, (for example an inserted punctuation mark, or corrected spelling) you can see the word by word change by looking inside wordDifferences.txt.
es: 5. Si differences.txt te mostró una línea que se modificó, y no te resulta sencillo ver qué cambió, (por ejemplo, un signo de puntuación insertado o una ortografía corregida), entonces encuentra la misma línea en wordDifferences.txt , y te mostrará palabra por palabra el cambio.

source: 2.6 log.txt, sometimes helpful to see the commit message from nvda authors, so it is provided in case it is useful.
es: 6. log.txt, útil en ocasiones para ver el mensaje de commit de los autores de NVDA, por lo que se proporciona en caso de que sea útil.

source: 2.7 When we finished with all the differences blocks for 10289, we check to make sure that nothing has been missed (see svn diff, svn status)
es: 7. Cuando finalicemos con todos los bloques de differences para 10289, verificamos para asegurarnos de que nada se haya perdido (consulta svn diff, svn status)

source: 2.8 We svn commit, and in the message we say we completed the translation for 10289.
es: 8. hacemos un svn commit, y en el mensaje decimos que completamos la traducción de 10289.

source: ## Useful svn commands
es: ## Órdenes útiles de svn

source: ### Download new changes from the server
es: ### Descargar nuevos cambios desde el servidor

source: To update the repository simply select the Translations folder in your explorer right click on it and activate SVN update.
es: Para actualizar el repositorio simplemente selecciona la carpeta Traducciones en tu explorador haciendo clic derecho sobre ella y activa SVN update.

source: The last line of the output window should be something like updated to revision 1234.
es: La última línea de la ventana de salida debería ser algo como updated to revision 1234.

source: The other lines will show a list of files that have been effected.
es: Las otras líneas mostrarán una lista de ficheros que hayan sido afectados.

source: added file1.txt # meens that file.txt has been added to svn, and you are getting your copy.
es: added file1.txt # significa que file.txt ha sido añadido a svn, y estás opteniendo tu copia.

source: updated file2.txt # means that file2.txt has been updated
es: updated file2.txt # significa que file2.txt ha sido actualizado

source: deleted file3.txt # means that someone removed the file and svn is also removing your copy of the file.
es: deleted file3.txt # significa que alguien eliminó el fichero y svn también está eliminando tu copia del fichero.

source: g file4.txt # means that you have changed the file , and it was also changed by someone else, but svn was happy merging the changes.
es: g file4.txt # significa que se ha cambiado el fichero, y también se cambió por alguien más, pero svn combinó los cambios correctamente.

source: c file5.txt # means that you have modified the file and it has been modified by someone else, but svn could not automatically merge, this causes a problem, so ask for help if you get it.
es: c file5.txt # significa que se ha modificado el fichero y ha sido modificado por alguien más, pero svn no pudo combinar automáticamente, esto causa un problema, así que pide ayuda si te ocurre esto.

source: ### Committing (sending the modifications to the server)
es: ### Haciendo commit (enviando las modificaciones al servidor)

source: If you translated new revisions, changed userguide and so on you can commit the changes by right clicking on your language code
es: Si tradujiste nuevas revisiones, cambiaste la guía de usuario, etc, puedes enviar los cambios

source: inside the translation folder and select SVN commit from the menu.
es: haciendo clic derecho sobre tu código de idioma dentro de la carpeta Traducciones y seleccionando SVN commit desde el menú.

source: In the dialog you should write a Commit message with your language code and a description of the work that was done.
es: En el diálogo deberías escribir un mensaje de Commit con tu código de idioma y una descripción del trabajo que has hecho.

source: You can check/uncheck the files to be committed.
es: Puedes marcar/desmarcar los ficheros a ser enviados.

source: Changed files are checked automatically.
es: Los ficheros con cambios están marcados automáticamente.

source: If you deleted a file or folder in windows,
es: Si eliminaste un fichero o carpeta en windows,

source: by default it is unchecked in this dialog, so you have to check it for it to be deleted from the repository on the server.
es: por omisión está desmarcado en este diálogo, así que tienes que marcarlo para que sea eliminado del repositorio en el servidor.

source: ### unintended modification to file
es: ### Modificación involuntaria de un fichero

source: If you deleted a file by mistake or something like that you can revert the changes by right clicking on the Translations folder, and select TortoiseSVN -> revert out of the menu.
es: Si eliminaste un fichero por error o algo como eso puedes revertir los cambios haciendo click derecho sobre la carpeta Traducciones, y seleccionando TortoiseSVN -> revert del menú.

source: ## missing info
es: ## Información que falta

source: If you have any tips or additional info please update this page.
es: Si tienes cualquier consejo o información adicional porfavor actualiza este archivo.
