Repository: bingen13/devguides_translation
Catalog: translations/*/LC_MESSAGES/TranslatingGestures.po
Languages: es

source: # Translating the gestures
es: # Traducción de gestos

source: The gestures defined originally in NVDA are adapted with English softwares and keyboard layout. In most cases, these gestures can also be executed on other keyboard layouts without any problem. However, sometimes a gesture originally defined by NVDA is not adapted for a specific locale (keyboard layout or software). The need to modify an original gesture may be due to the following reasons:
es: Los gestos definidos originalmente en NVDA están adaptados a la distribución de teclado inglesa y a programas en inglés. En la mayor parte de los casos, estos gestos pueden ejecutarse en otras distribuciones de teclado sin problema. Sin embargo, en ocasiones un gesto definido por NVDA no se adapta a un idioma específico (distribución de teclado o software). La necesidad de modificar un gesto original puede darse por las siguientes razones:

source: * The original gesture is defined with a character that is not a key name on the locale keyboard layout. Generally, the key names are the characters that can be input without the help of a modifier key (shift, control, etc.)
es: * El gesto original se ha definido con un carácter que no es un nombre de tecla en la distribución de teclado del idioma. Generalmente, los nombres de las teclas son los caracteres que pueden introducirse sin la ayuda de una tecla modificadora (shift, control, etc.)

source: * The original gesture takes advantage of the keys physical location on the English keyboard layout, but this advantage does not appear anymore with the locale keyboard layout.
es: * El gesto original aprovecha la ventaja de la ubicación física de las teclas de la distribución de teclado inglesa, pero esta ventaja no se percibe con la distribución de teclado del idioma.

source: * The original gesture is defined to match a native shortcut in Windows or in an application, but the shortcut in the local version of Windows or of this application is not the same as the English one.
es: * Se define el gesto original para que coincida con un atajo de Windows o de una aplicación, pero el atajo en la versión local de Windows o de la aplicación no es el mismo que en inglés.

source: In all of this case, NVDA allows to remap this gesture for this specific locale.
es: En todos estos casos, NVDA permite reasignar estos gestos para un idioma específico.

source: ## Examples of modifications of a `gestures.ini` file
es: ## Ejemplos de modificaciones de un archivo `gestures.ini`

source: Below are three detailed examples of gestures.ini files corresponding to the three listed situations where a gesture remapping could be required.
es: A continuación se encuentran tres ejemplos detallados de archivos gestures.ini correspondientes a las tres situaciones listadas donde podrían ser necesarias reasignaciones de gestos.

source: ### Example 1: The original gesture is defined with a character that is not a key name on the locale keyboard layout
es: ### Ejemplo 1: el gesto original se define con un carácter que no corresponde a un nombre de tecla válido en la distribución de teclado del idioma

source: In English original version, the scripts for left and right mouse click (laptop layout) are executed respectively with NVDA+[ and NVDA+]. On English keyboard layout, the [ and ] keys are the two keys at the right of the P key.
es: En la versión original en inglés, los scripts para hacer clic con los botones izquierdo y derecho del ratón (distribución portátil) se ejecutan con NVDA+[ y NVDA+], respectivamente. En la distribución de teclado inglesa, las teclas [ y ] son las dos que se encuentran a la derecha de la tecla P.

source: On Italian keyboard layout, [ and ] characters can only be input with the help of AltGr modifier: AltGr+è and AltGr+Plus respectively. Thus Italian translators decided to remap these scripts with the two keys at the right of the P key on Italian keyboard layout, i.e. è and +. To do this they have added the following lines in the `gestures.ini` file:
es: En la distribución de teclado italiana, los caracteres [ y ] sólo pueden introducirse con la ayuda de la tecla modificadora AltGr: AltGr+è y AltGr+Más, respectivamente. Por tanto, los traductores italianos decidieron reasignar estos scripts a las dos teclas a la derecha de la P en la distribución de teclado italiana, è y +. Para hacerlo, añadieron las siguientes líneas en el archivo `gestures.ini`:

source: ### Example 2: The original gesture takes advantage of the keys physical location
es: ### Ejemplo 2: el gesto original aprovecha la ventaja de la ubicación física de las teclas

source: Looking again at the scripts for left and right mouse click (laptop layout) we can see that they are originally mapped (in English) to two neighboring keys. This reminds the left and right buttons of the mouse.
es: Mirando de nuevo a los scripts para hacer clic con los botones izquierdo y derecho del ratón (distribución portátil), vemos que originalmente están asignados (en inglés) a dos teclas vecinas. Esto recuerda a los botones izquierdo y derecho del ratón.

source: As seen in example 1, many translators have had to modify these keys. Most of them (if not all) have chosen two neighboring keys. E.g. in French `gestures.ini` the following lines have been added:
es: Como se vio en el ejemplo 1, muchos traductores han tenido que modificar estas teclas. La mayoría de ellos (si no todos) han elegido dos teclas vecinas. Por ejemplo, en el archivo `gestures.ini` francés se añadieron las siguientes líneas:

source: The ù and * on French layout are not at the same location as [ and ] of English layout, but these are still two neighboring keys.
es: Los caracteres ù y * en la distribución francesa no están en la misma ubicación que [ y ] en la distribución inglesa, pero también son teclas vecinas.

source: Moreover we can see here that NVDA+[ and NVDA+] has been among other mapped to None in order to unbind these gestures. For French (France) layout, this was not mandatory since there is no possibility to input NVDA+[ or NVDA+] without any other modifier key.
es: Yendo más allá, aquí podemos ver que NVDA+[ y NVDA+] se han asignado a None, entre otras, para dejar sin asignar estos gestos. Para la distribución en francés (Francia), no era algo obligatorio, ya que no hay posibilidad de pulsar NVDA+[ y NVDA+] sin otras teclas modificadoras.

source: ### Example 3: The original gesture is defined to match a native shortcut
es: ### Ejemplo 3: el gesto original se ha definido para que coincida con un atajo nativo

source: NVDA provides a script for Word document object named `toggleBold`. This script is mapped to the same gesture as the Word native shortcut to set text bold, i.e. Control+B in English version of Word. However on French version of Word, the shortcut to turn text bold is Control+G. The G stands for "gras" meaning "bold" in French. The following lines have been added in the French `gestures.ini` file to remap this script:
es: NVDA proporciona un script para el objeto de documento de Word llamado `toggleBold`. Este script se encuentra asignado al mismo gesto del atajo nativo de Word para poner el texto en negrita, control+b en la versión en inglés de Word. Sin embargo, en la versión en francés de Word, el atajo para poner el texto en negrita es control+G. La g viene de "gras", que significa "negrita" en francés. Las siguientes líneas se añadieron al archivo `gestures.ini` francés para reasignar este script:

source: We can see that Control+B has been unbound. This was necessary because it is the shortcut of another command in French version of Word.
es: Podemos ver que la asignación de control+b se ha eliminado. Esto es necesario porque corresponde a otra orden de la versión en francés de Word.

source: No remapping has been done for toggleItalic script since the shortcut is the same for French and English versions of Word.
es: No se ha hecho una reasignación para el script toggleItalic, ya que el atajo es el mismo en las versiones inglesa y francesa de Word.

source: ## How to remap a shortcut key
es: ## Cómo reasignar una tecla de atajo

source: ### Identify the class, the script and the original gesture to be remapped
es: ### Identificación de la clase, el script y el gesto original a reasignar

source: To edit the gesture.ini file, you will have to identify the class, the script and the original shortcut you want to remap.
es: Para editar el archivo gestures.ini, tendrás que identificar la clase, el script y el atajo original que quieres reasignar.

source: #### Case of a global command script
es: #### Caso de un script de orden global

source: If the gesture to be remapped is a global command, you may execute the following steps to find out the class and the script name of the command:
es: Si el gesto a reasignar es una orden global, puedes ejecutar los siguientes pasos para descubrir los nombres de la clase y el script de dicha orden:

source: * activate input help (NVDA+1)
es: * Activa la ayuda de entrada (NVDA+1)

source: * press the gesture you want to remap, e.g. NVDA+] (laptop layout)
es: * Pulsa el gesto que deseas reasignar, por ejemplo NVDA+] (distribución portátil)

source: * de-activate input help (NVDA+1)
es: * Desactiva la ayuda de entrada (NVDA+1)

source: * open the log (NVDA+F1)
es: * Abre el registro (NVDA+f1)

source: * find out the line corresponding to the moment you have executed the gesture, e.g.:
es: * Busca la línea correspondiente al momento en el que has ejecutado el gesto, por ejemplo:

source: The information you are searching is on this line:
es: La información que buscas está en esta línea:

source: * script name: `rightMouseClick`
es: * nombre del script: `rightMouseClick`

source: * class name: `globalCommands.GlobalCommands` (Note that this is always this class for global commands)
es: * nombre de la clase: `globalCommands.GlobalCommands` (Observa que siempre es esta clase para las órdenes globales)

source: * original gesture: `kb(laptop):NVDA+]`
es: * gesto original: `kb(laptop):NVDA+]`

source: #### Case of an application specific script
es: #### Caso de un script de una aplicación específica

source: In case you want to remap an application specific script, you will have to follow the same steps as those for a global command script. You just need to ensure before proceeding that you are in the targeted application.
es: En caso de que quieras reasignar un script de una aplicación específica, tendrás que seguir los mismos pasos que vimos para una orden global. Antes de proceder, debes asegurarte de que te encuentras en la aplicación deseada.

source: #### Case of an object specific script
es: #### Caso de un script específico de un objeto

source: Object specific scripts such as the ones linked to `NVDAObjects.window.winword.WordDocument` do not have generally an help message. So the previous technique will not work. You will need to explore NVDA's source code to find the class and the script name of the gesture you want to remap.
es: Los scripts específicos de objeto, como los enlazados a `NVDAObjects.window.winword.WordDocument`, no disponen generalmente de un mensaje de ayuda, por lo que la técnica anterior no funcionará. Será necesario explorar el código fuente de NVDA para encontrar el nombre de clase y de script del gesto que deseas reasignar.

source: ### Edit the gestures.ini file
es: ### Edición del archivo gestures.ini

source: 1. In your local copy of the screenReaderTranslations repository, check if the gestures.ini file exists, e.g. d:\SVN\SRT\fr\gestures.ini
es: 1. En tu copia local del repositorio ScreenReaderTranslations, comprueba si existe el archivo gestures.ini. Por ejemplo, d:\SVN\SRT\fr\gestures.ini

source: * If this file does not exist, create it by copying it from the last version of NVDA.
es: * Si este archivo no existe, créalo copiándolo de la última versión de NVDA.

source: * If it already exists, all is fine.
es: * Si ya existe, todo está bien.

source: 2. In this file the sections correspond to the class to which the script belongs. If the class your looking for does not exist, create this section.
es: 2. En este archivo, las secciones corresponden a la clase a la que el script pertenece. Si la clase que buscas no existe, crea una sección para ella.

source: 3. Under the targeted section, add a line corresponding to the new shortcut. E.g.:
es: 3. Bajo la sección deseada, añade una línea correspondiente al nuevo atajo. Por ejemplo:

source: If a line already exists for the script name you want to modify the shortcut, add the new shortcut on the same line, separating each shortcut from another with a comma (,)
es: Si ya existe una línea con el nombre de script cuyo atajo quieres modificar, añade el nuevo atajo en la misma línea, separando cada atajo de los otros con una coma (,)

source: 4. If you want to unmap the original shortcut, just map it to `None`, e.g.:
es: 4. Si quieres eliminar la asignación del gesto original, simplemente asígnalo a `None`. Por ejemplo:

source: Unmapping the original shortcut is only required if this shortcut does not match any other remapped locale shortcut.
es: Eliminar el atajo asignado original sólo es obligatorio si este atajo no coincide con ningún otro atajo reasignado en ese idioma.

source: 5. Save your file in UTF-8 format.
es: 5. Guarda tu archivo en formato UTF-8.

source: 6. Commit your changes to screenReaderTranslations repo.
es: 6. Envía los cambios al repositorio ScreenReaderTranslations.

source: ## What happens next
es: ## Qué ocurre después

source: The automatic translation system will periodically copy the modified gestures.ini files from the screenReaderTranslations repo in the beta branch of the NVDA repo.
es: El sistema automático de traducciones copiará periódicamente los archivos gestures.ini modificados desde el repositorio ScreenReaderTranslations a la rama beta del repositorio de NVDA.
