Repository: bingen13/devguides_translation
Catalog: translations/*/LC_MESSAGES/Triage-process.po
Languages: es

source: For transparency, the following is a brief outline of the process NV Access is following for issue triage. If you would like to help with the triage process (which is an excellent way to make a contribution to NVDA) please refer to [issue triage help on the wiki](https://github.com/nvaccess/nvda/wiki/Issue-triage-help)
es: Por transparencia, lo siguiente es un breve resumen sobre el proceso que NVAccess está siguiendo para la clasificación de incidencias. Si quieres ayudar con el proceso de clasificación (lo que es una excelente forma de hacer una contribución a NVDA), consulta la sección de ayuda de clasificación de incidencias.

source: ### Missing attachments
es: ### Adjuntos que faltan

source: NV Access migrated tickets from our old issue tracker ('Trac') into Github issues. These issues can be identified by having an author of `nvaccessauto`. Some of these issues have comments that indicate an attachment should be available, but it is not. All of these Trac attachments are now accessible at: https://www.nvaccess.org/files/nvdaTracAttachments/ (then the Github issue number). So as an example, for issue [#2396](https://github.com/nvaccess/nvda/issues/2396), get the attachments from https://www.nvaccess.org/files/nvdaTracAttachments/2396
es: NVAccess migró sus tickets desde su antiguo rastreador de incidencias (‘Track’) a incidencias de GitHub. Estas incidencias pueden identificarse porque tienen como autor a nvaccessauto. Algunas de estas incidencias tienen comentarios que indican que debería haber un adjunto disponible, pero no está. Todos estos adjuntos de Track ahora están accesibles en: https://www.nvaccess.org/files/nvdaTracAttachments/ (seguido del número de incidencia de GitHub). De esta manera, como ejemplo, para la incidencia [#2396](https://github.com/nvaccess/nvda/issues/2396) obtén los adjuntos desde https://www.nvaccess.org/files/nvdaTracAttachments/2396

source: If you come across one of these missing attachments, please upload if you think they're relevant to GitHub. Note you'll need to rename adding a .txt extension to code, logs, etc. Anything else should probably be zipped.
es: Si te encuentras con uno de estos adjuntos que faltan, por favor súbelo a GitHub si piensas que es relevante. Ten en cuenta que necesitarás renombrarlos añadiendo una extensión .txt al código, los registros, etc. Todo lo demás probablemente debería comprimirse en zip.

source: ### How prioritisation works
es: ### Cómo funciona la asignación de prioridades

source: We differentiate between the priority for bugs (labelled `bug`) and new features (labelled `feature`). Rather than assign a priority to issues with the `feature` label, typically we try to group new features into a project of related work. We should try to ensure that new features are [well defined](https://github.com/nvaccess/nvda/wiki/Issue-triage-help#new-features-1) before applying the `feature` label. One exception here might be if we can determine that a feature is not something we are likely ever to work on. In this case we should apply `P4` and explain this is not something we are going to look at but will be happy to accept a pull request for. We also have a label for `enhancement`, think of this as a more internal facing change. For instance, editing code comments to provide clearer / more complete information, or extending an internal framework/API to unblock other issues.
es: NV Access diferencia entre prioridad para fallos (etiquetados como `bug`) y nuevas características (etiquetadas como `feature`). En vez de asignar una prioridad a incidencias con la etiqueta de `feature`, NV Access intenta agrupar nuevas características en un proyecto con trabajos relacionados. Se debe intentar que las nuevas características estén bien definidas antes de aplicar la etiqueta `feature`. Podría darse una excepción aquí si podemos determinar que una característica es algo en lo que probablemente nunca se trabajará. En este caso se debería aplicar `P4` y explicar que esto no es algo que vayamos a mirar, pero para lo que se acepta felizmente una solicitud de cambios. NV Access también tiene una etiqueta para mejoras, piensa que esto tiene que afrontar cambios más internos. Por ejemplo, editar comentarios del código para ofrecer información más clara y completa, o extender una API o framework interno para desbloquear otras incidencias.

source: Bugs/regressions are given priorities based on an estimate of their severity, impact and implementation cost:
es: Los fallos y las regresiones reciben prioridades en base a una estimación de su severidad, impacto y coste de implementación:

source: - `P1` issues are typically crashes or severe errors that should be fixed immediately.
es: - Las incidencias `P1` son típicamente errores fatales o muy graves que deben repararse inmediatamente.

source: - `P2` issues should be among the next issues fixed. Try to start on the oldest of these issues.
es: - Las incidencias `P2` deberían estar entre las siguientes incidencias reparadas. Intenta empezar con la más antigua de ellas.

source: - `P3` issues are less likely to get fixed, we hope to get to them "one day". However if something changes (severity/impact/cost) the priority can be reassessed.
es: - Las incidencias `P3` tienen menos probabilidad de ser reparadas, se espera centrarse en ellas "algún día". Sin embargo, si algo cambia (severidad, impacto, coste) su prioridad puede alterarse.

source: - `P4` issues probably won't be worked on by NV Access, however we will be happy to provide implementation guidance and accept a Pull Request.
es: - NV Access probablemente no trabajará en las incidencias de tipo `P4`. Sin embargo, estarán encantados de ofrecer guiado durante la implementación y aceptar una solicitud de cambios.

source: Due to the difficulty in assigning priorities to individual issues, recently (2019) NV Access has asked members of the community to provide their top 2 issues. This data allowed us to find trends resulting in a re-prioritisation of our efforts. While this exercise allowed us to tackle the most important issue for the majority, we are aware that critical issues for smaller groups may be missed. So the above process should still be followed, especially for P1 or P2 issues. If an issue is critical to you, please comment on the issue and explain why.
es: Debido a la dificultad a la hora de dar prioridad a incidencias individuales, recientemente (2019) NV Access ha pedido a los miembros de la comunidad que hablen de sus 2 incidencias más importantes. Estos datos permitieron a NV Access encontrar tendencias, dando como resultado una reasignación de prioridad en sus esfuerzos. Aunque este ejercicio les permitió resolver los problemas más importantes para la mayoría, son conscientes de que hay problemas críticos que afectan a pequeños grupos que pueden no haber sido resueltos. Por tanto, se debería seguir aplicando el proceso anterior, especialmente para las incidencias p1 y p2. Si una incidencia resulta crítica para ti, comenta en ella y explica por qué.
