Repository: bingen13/devguides_translation
Catalog: translations/*/LC_MESSAGES/Using-the-Ribbon-with-NVDA.po
Languages: es

source: Originally by Brian Vogel.
es: Original por Brian Vogel.

source: The ribbons in Windows, whether in File Explorer or specific programs like MS-Word or others, are really just another variant on a menu system that has as its intention making the most commonly used items “front and center” for fast access.
es: Las cintas en Windows, ya sea en el explorador de archivos o en programas específicos como MS-Word y otros, sólo son otra variante de un sistema de menús que tiene por objetivo situar los elementos más comunmente utilizados "al frente y centrados" para agilizar el acceso.

source: Many of the things you already know for using a menu-driven system still apply for accessing the ribbons. In the old-style menus you hit ALT plus the appropriate letter to drop down that menu. In the ribbon system you hit ALT plus the appropriate letter to open a specific tab that shows the ribbon you need to access.
es: Varias de las cosas que ya sabes para utilizar un sistema basado en menús también aplican para acceder a las cintas. En los menús a la antigua usanza se pulsa ALT más la letra correspondiente para desplegar ese menú. En el sistema de cintas se pulsa ALT más la letra correspondiente para abrir una pestaña específica que muestra la cinta a la que necesitas acceder.

source: Every blessed option on a ribbon has a direct keyboard shortcut to activate it, so it is worth learning what your own “greatest hits” generally are and what their keyboard shortcuts are to save yourself a lot of time. That being said, we all occasionally have to use a feature that we seldom use, so on occasion a brute force “tab by tab” search, either through a whole ribbon or within select groups on a given ribbon might be needed.
es: Toda opción en una cinta tiene un atajo de teclado directo para activarla, así que vale la pena aprender cuáles son por lo general tus "grandes éxitos" y sus teclas rápidas para ahorrar un montón de tiempo. Dicho esto, todos nosotros tenemos que usar ocasionalmente alguna característica que rara vez utilizamos, de forma que en ocasiones una búsqueda mediante fuerza bruta "pestaña por pestaña", a través de la cinta o de grupos específicos en una cinta concreta, podría ser necesaria.

source: One big difference between using the old-style menu system and ribbons is that the up, down, left, and right arrow keys were your primary navigation keys for menus. They are not for ribbon navigation. Your primary navigation key is the TAB key, along with CTRL+Right Arrow (or Left Arrow) if you wish to jump from ribbon group to ribbon group.
es: Una gran diferencia entre usar el sistema de menús con estilo antiguo y las cintas es que las teclas de flecha arriba, abajo, izquierda y derecha eran nuestras teclas primarias de navegación para los menús. Pero no lo son para la navegación por cintas. Tu tecla principal de navegación es TAB, junto con CTRL+Flecha Derecha (o Flecha Izquierda) si deseas saltar entre grupos de cinta.

source: What follows will use File Explorer as the program and its various buttons and ribbons. This is from a system running Windows 10, Version 1607 (the Anniversary Update), Build 14393.187. I do not recall having customized File Explorer in any way, so this should apply to File Explorer in its “out of the box” state. The principles of navigation of the ribbon apply in any program that uses one, but the buttons and ribbons in other programs obviously differ.
es: Lo que sigue usará el Explorador de Archivos como programa y sus varios botones y cintas. Está basado en un sistema ejecutando Windows 10, versión 1607 (la Aniversary Update), Compilación 14393.187. No recuerdo haber personalizado el Explorador de Archivos de ninguna forma, de manera que esto debería ser aplicable al Explorador de Archivos en su estado de "fuera de la caja" (estado inicial). Los principios de navegación para cintas se pueden aplicar a cualquier programa que use una, pero los botones y cintas de otros programas difieren, obviamente.

source: Just like it always has been with menus so it remains with tabs/ribbons that pressing ALT throws focus to the controls. Of course, controls are context sensitive and so which are available versus which are not directly depends on the item or items you have selected in the File Explorer window. The primary choices after hitting ALT are:
es: De la misma forma en que lo ha sido siempre con menús, persiste con las pestañas/cintas la tecla ALT para llevar el foco a los controles. Por supuesto, los controles son sensibles al contexto, de forma que cuáles están disponibles y cuáles no depende directamente de los elementos que hayas seleccionado en la ventana del Explorador de Archivos. Las principales alternativas tras pulsar ALT son:

source: * F for the File Tab, which does not have a ribbon but does have a number of controls
es: * F para la pestaña Archivo, que no tiene una cinta pero sí cierto número de controles.

source: * H for the Home Tab, which is by far and away the one that gets the most use
es: * H para la Pestaña Inicio, que es de lejos la que más se usa

source: * S for the Share Tab
es: * S para la Pestaña Compartir

source: * V for the View Tab
es: * V para la Pestaña Ver

source: * 1 for the properties dialog if you have a file or folder selected. Can also be invoked using ALT+Enter instead
es: * 1 para el diálogo de propiedades si has seleccionad un archivo o carpeta. También se puede invocar pulsando ALT+Intro en su lugar

source: * 2 for the New Folder button. Can also be invoked using CTRL+Shift+N instead
es: * 2 para el botón Nueva Carpeta. También se puede invocar pulsando CTRL+Shift+N en su lugar

source: * E to invoke the Windows Help function for File Explorer. Opens a web browser window in whatever browser you’ve set up as your default.
es: * E para invocar la función de Ayuda de Windows para el Explorador de Archivos. Abre una ventana del navegador de internet en el navegador que hayas establecido como predeterminado.

source: ## The Structure of Tabs & Ribbons
es: ## La estructura de Pestañas y & Cintas

source: Most Tabs have a single ribbon, though some have none and are more “menu-like” structure with a collection of controls that are not split into groups/toolbars. The File Tab is like this. Since the Home Tab and its ribbon get the heavy-duty workload the vast majority of the time I will focus on it as my primary in-depth example. The following will presume that you’ve already hit ALT followed by H and have the Home Tab open.
es: La mayoría de las Pestañas tienen una sola cinta, aunque algunas no tienen ninguna y tienen una estructura más parecida a la de un menú con un conjunto de controles no separados en grupos/barras de herramientas. La pestaña Archivo es un ejemplo. Dado que la pestaña Inicio y su cinta tienen la mayor carga de trabajo la gran mayoría del tiempo me centraré en ellas como mi principal ejemplo en profundidad.

source: To move directly in to the ribbon hit the down arrow key once, or hit the TAB key four times, as it traverses some controls on the window prior to entering the ribbon. You will now be sitting in the Clipboard group/toolbar of the ribbon on the Pin to Quick Access control (which will be inactive unless you have a file or folder selected in the main pane of the window). The Home Ribbon is broken in to 5 toolbars/control groups, left to right these are:
es: Para moverte directamente a la cinta pulsa la tecla de flecha abajo una vez o TAB cuatro veces para atravesar algunos controles en la ventana anteriores a la cinta. Estarás ahora dentro del grupo/barra de herramientas Portapapeles de la cinta, en el control "Anclar a Acceso Rápido (que estará inactivo a menos que tengas un archivo o carpeta seleccionado en el primer plano de la ventana). La cinta Inicio está partida en cinco barras de herramientas/grupos de controles, que son de izquierda a derecha:

source: 1. Clipboard
es: 1. Portapapeles

source: 2. Organize
es: 2. Organizar

source: 3. New
es: 3. Nuevo

source: 4. Open
es: 4. Abrir

source: 5. Select
es: 5. Seleccionar

source: Almost every control has a keyboard shortcut to invoke it. The exceptions are those that involve selection from a table/list for a setting, and these have a keyboard shortcut to take you straight into the selection for that control and you can use TAB to traverse those selections.
es: Casi todos los controles disponen de un atajo de teclado para invocarlos. Las excepciones son aquellos que implican la selección de un ajuste en una tabla/lista, que tienen un atajo de teclado para llevarte directamente a la selección para ese control, donde puedes usar tab para pasar por las opciones.

source: You can use the TAB key to do a control-by-control traversal of the entire ribbon. The screen reader will announce when you have traversed from one toolbar/control group into the next. You can also do a quick jump from wherever you might be within a given toolbar to the first control of the next (or previous) toolbar using CTRL+Right Arrow (Left Arrow). When you are moving from control to control via the TAB key you will have the control announced along with the keyboard sequence (coupled with the ALT followed by letter that you’ve already entered) that would be used to invoke it directly.
es: Puedes usar la tecla TAB para atravesar toda la cinta control por control. El lector de pantallas anunciará cuándo pases de una barra de herramientas/grupo de controles al siguiente. También puedes saltar rápidamente desde donde quiera que puedas estar en una cierta barra de herramientas al primer control de la siguiente (o anterior) barra de herramientas utilizando CTRL+Flecha Derecha (Flecha Izquierda). Al moverte control a control con la tecla TAB el control se anunciará el control junto con la secuencia de teclas (iniciada por ALT seguida de la letra que ya has pulsado) que se usa para invocarlo directamente.

source: ## Clipboard Toolbar/Control Group
es: ## Barra de herramientas/grupo de controles Portapapeles

source: Contains the following controls, I will note the direct keyboard sequence that would follow the ALT followed by H if you wish to invoke it directly within square brackets. Some are single characters while others are two characters that must be typed rapidly :
es: contiene los siguientes controles, indicaré entre corchetes la secuencia de teclas que seguiría al ALT más H por si quieres invocarlo directamente. Algunas son un único carácter mientras que otras son dos caracteres que deben escribirse rápidamente :

source: * Pin to Quick Access – if a file or folder is selected will be active and will do precisely what its name states. [PI]
es: * Anclar a Acceso Rápido - Si un archivo o carpeta está seleccionado estará activo y hará precisamente lo que su nombre indica. [PI]

source: * Copy [CO] You can also use the CTRL+C keyboard shortcut to copy (which I always do).
es: * Copiar [CO] También puedes usar el atajo de teclado CTRL+C para copiar (lo que hago yo siempre).

source: * Paste [V] You can also use the CTRL+V keyboard shortcut to paste (which I always do).
es: * Pegar [V] También puedes usar el atajo de teclado CTRL+V para pegar (lo que hago yo siempre).

source: * Cut [T] You can also use the CTRL+X keyboard shortcut to cut (again, which I always do).
es: * Cortar [T] También puedes usar el atajo de teclado CTRL+X para cortar (de nuevo, lo que hago yo siempre).

source: * Copy Path [CP] Copies the full path to the file(s) or folder(s) selected to the clipboard
es: * copiar ruta [CP] Copia al portapapeles la ruta completa al/los archivo(s) o carpeta(s) seleccionado(s)

source: * Paste Shortcut [PS] If you did a previous copy on a file, using Paste Shortcut will do what it says, paste a shortcut (symbolic link) to the original file in the folder you’re sitting in rather than an actual duplicate copy of the file.
es: * Pegar Acceso Directo [PS] Si hiciste previamente una copia en un archivo, Pegar Acceso Directo hará lo que dice, pegar un acceso directo (enlace simbólico) al archivo original en la carpeta en la que estás en lugar de una copia real duplicada del archivo.

source: ## Short List of Commonly Used Key Sequences for Ribbon Navigation.
es: ##Breve Lista de las Secuencias de Teclas Más Comunmente Usadas para la Navegación de Cintas.

source: * ALT plus appropriate letter: Throw focus on a specific tab that contains the ribbon you need to use. For example, in MS-Word, ALT+F for File Tab or ALT+H for Home Tab.
es: * ALT más letra correspondiente: Llevar el foco a una pestaña específica que contiene la cinta que necesitas usar. Por ejemplo, en MS-Word, ALT+A para la Pestaña Archivo o ALT+O para la Pestaña Inicio.

source: * Down Arrow, struck once. In File Explorer this puts you into the ribbon without having to go through a couple of controls that are part of the File Explorer window itself. You can also use this in any other program as well, but often TAB will work. I want people to be aware of this exception primarily for File Explorer since it requires four TAB presses to achieve what a single down arrow press does.
es: * Flecha abajo, pulsada una vez. En el explorador de archivos, te lleva a la cinta sin tener que ir por algunos controles que forman parte de la propia ventana del explorador de archivos. También puedes utilizar esto en cualquier otro programa de la misma manera, pero con frecuencia funcionará TAB. Quiero que la gente esté prevenida sobre esta excepción principalmente para el explorador de archivos ya que requiere cuatro TABS para conseguir lo que hace una pulsación de flecha abajo.

source: * TAB – this is your primary control to control navigation key. It’s great if you don’t know where something happens to be and need to listen for the control and its shortcut character or characters.
es: * TAB - ésta es el principal control para controlar la tecla de navegación. Es genial si no sabes dónde parece estar algo y necesitas escuchar el control y su/s tecla/s de atajo.

source: * CTRL+Right Arrow (or Left Arrow) move to the next (or previous) group of controls. In the old menu system many menu items had submenus and in the ribbon system most controls are grouped together based on their functions, but all are visible. If you know that the group you’re in definitely isn’t what you’re looking for you can quickly jump to the next or previous group rather than having to tab your way through each and every control.
es: * CTRL+Flecha Derecha (o Flecha Izquierda) se mueve al siguiente (o anterior) grupo de controles. En el sistema de menús antiguo varios elementos de menú tenían submenús y en el sistema de ribbon la mayoría de controles están agrupados con base en sus funciones, pero todos son visibles. Si sabes que el grupo en el que estás definitivamente no es lo que estás buscando puedes saltar rápidamente al grupo siguiente o anterior antes que tabular por cada control.

source: Learning the actual keyboard shortcuts for functions that you use all the time will save you a lot of time and effort. For instance, if you use bullet lists in your Microsoft Word documents on a routine basis it’s a lot easier to hit, ALT+H,U, then down arrow through the bullet styles to choose the one you want than to hit ALT+H, CTRL+Right Arrow three times to get to the Paragraph control grouping, Enter to open the bullet list dialog (which happens to be the first control in the Paragraph group), then down arrowing through the bullet styles. Also using keyboard shortcuts like CTRL+B to toggle bold type on/off, CTRL+I for italic, and CTRL+U for underline, is much faster than hunting for these in the Font Group via ribbon navigation.
es: Aprender las teclas de atajo de funciones que utilizas todo el tiempo te ahorrará mucho tiempo y esfuerzo. Por ejemplo, si usas por rutina listas con viñetas en tus documentos de Microsoft Word es mucho más fácil pulsar ALT+O,Ñ,V, luego flecha abajo por los estilos de viñeta para escoger la que quieres, que pulsar ALT+H, CTRL+Flecha Izquierda tres veces para llegar al grupo Párrafo, enter para abrir el diálogo de lista con viñetas (que parece ser el primer control en el grupo Párrafo), luego ir pulsando Flecha Abajo por los estilos de viñeta. Usar también teclas de atajo como CTRL+N para activar/desactivar la escritura en negrita, CTRL+K para cursiva, o CTRL+S para subrayado, es mucho más rápido que buscar estas opciones en el grupo fuente mediante navegación de la cinta ribbon.
